{
    "kws9f0": {
        "score": 163,
        "selftext": "SPCE, we're going back to the fucking moon.\n\n1. First maiden launch this weekend, on Sunday.\n2. Being added to ETF that already smashed up 170%. Already up 14% afterhours on the news.\n3. MASSIVE short interest, 74%. Anyone remember the GME short squeeze of... TODAY? TSLA?\n\nThis shit is going to fly tomorrow at 11:00 AM when all the bankers finally wake up and pretend they understand space flight.\n\n&#x200B;\n\nUnlike us here, on WSB, who know all about mooning.  \n**SPCE July 16 '21 36C**\n\n[https://www.express.co.uk/news/science/1383354/virgin-orbit-launch-when-space-richard-branson-news-evg](https://www.express.co.uk/news/science/1383354/virgin-orbit-launch-when-space-richard-branson-news-evg)\n\n[https://www.cnbc.com/2021/01/13/cathie-woods-ark-invest-plans-space-exploration-etf-arkx.html](https://www.cnbc.com/2021/01/13/cathie-woods-ark-invest-plans-space-exploration-etf-arkx.html)",
        "title": "SPCE is back and is about to bang Richard Branson",
        "created_utc": 1610578750.0,
        "upvote_ratio": 0.94,
        "num_comments": 62,
        "author": {
            "name": "FixFixFixGoGo",
            "id": "1q7ck27z"
        }
    },
    "kws65n": {
        "score": 190,
        "selftext": "Just to put some context on today's events the short squeeze has yet to actaully begin. Assuming an average short entry of $18 the short positions would roughly be underwater a billion dollars assuming they weren't frantically hedging by buying calls all day. \n\nDaily short volume is posted to Finra daily (http://regsho.finra.org/regsho-Index.html). \n\nSHORT VOLUME: 46,075,278  (53%)\nTOTAL VOLUME: 86,578,862\n\nTLDR: additional shorting was used to mitigate an immediate infinity squeeze.  Net result is short interest increased today.\n\n- - - - - EDIT: Additional Context - - - - -\n\nAlways do your own DD, however I am only posting this because of the congrats GME gang/what is the next play sentiment.  Short squeeze hasn't started and if you exit you will be missing out on  🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "title": "GME short squeeze",
        "created_utc": 1610578472.0,
        "upvote_ratio": 0.98,
        "num_comments": 68,
        "author": {
            "name": "mirkan__2",
            "id": "1cws05zi"
        }
    },
    "kwrznn": {
        "score": 90,
        "selftext": "&#x200B;\n\n[all i can say is wow. i just slapped myself to remind myself that this is JUST THE BEGINNING. i love all the donation posts to pay it forward, BUT....PURCHASE SOMETHING FROM GAMESTOP.COM and lets finish off Q42020 w\\/ a BANG. ](https://preview.redd.it/1c1gvklsf6b61.jpg?width=1461&format=pjpg&auto=webp&s=b98c476bedd8801f4a44bc8daf20a848df5a5359)\n\n&#x200B;\n\n[yes i bought a used game. HIGHER MARGINS. hey  u\\/Uberkikz11 the order was placed at 2:42PM PST for your model.](https://preview.redd.it/tfphfi51h6b61.jpg?width=935&format=pjpg&auto=webp&s=7fb753202a37baf6d7ab387b4150d5348e56027f)\n\nGET TO WORK #GMEgang",
        "title": "**DO NOT FORGET TO SUPPORT GAMESTOP BY PURCHASING SOMETHING FROM THEM** #GMEgang",
        "created_utc": 1610577923.0,
        "upvote_ratio": 0.91,
        "num_comments": 31,
        "author": {
            "name": "powahTEN",
            "id": "2dbh0nd1"
        }
    },
    "kwrd0v": {
        "score": 641,
        "selftext": "Investing is my industry, though not directly Wall Street (I own a VC), and one of the studies we commissioned last year was an examination into just how much power retail investors have in an era of $0 commission trading and social media.  We also wanted some metrics on how, if any, that could counterbalance the power of the HFT machines that exploit liquidity and volume to move markets and the role of traditional hedge funds in the digital era.\n\n&#x200B;\n\nI'll spare a lot of the one-off items and deep examination that came back (both because you shouldn't care, plus nobody has the attention span to read 173 pages).  The summary is this:\n\n&#x200B;\n\n# SUMMARY HERE:\n\nSome of you realize it, many of you don't, but you're officially a major market mover, on par with or even more powerful than HFT's in some regards because you've essentially found a way to break the system.  I've seen a lot of posts take about GME's launch and people claiming they don't understand how it happened or people who have an innate sense but perhaps don't grasp the nuts and bolts of it, but it's something you should probably get used to, and something you've been causing a while.\n\n# Maths:\n\nThis sub has about 1.5 million subscribers.  It's estimated there's another 300,000 or so people who read it but aren't subbed to it.  It's estimated a full 1/3 of the people who read this sub don't actually invest at all, so they can be removed.  But of those of you who remain (removing outliers such as myself that would skew the numbers irrationally), conservative estimates on your AUM (assets under management) is **somewhere between 5.5 and 7 \\*\\*BILLION\\*\\* dollars**.  Which would put you in the top 4% of all hedge funds if that money were all thrown in a pool (only 7% of funds have over 1bln).  Except you have an inherent advantage in that you aren't regulated like a hedge fund and don't have to follow any rules.  You can just do whatever the fuck you please because it's funny (GME).  And the more you do it, the more powerful you become as a collective.\n\n&#x200B;\n\nWhat does this mean?\n\n&#x200B;\n\n# (TLDR HEREHEREHERE)\n\nIt means that, when you decide to act collectively, you can effectively overpower the machines and institutional investors and move a small or mid cap  stock in a direction the rest of the market doesn't want to take it as a herd.  And you can do it whenever you like.  Or, in the case of a large cap stock like TSLA, even though you couldn't latently overpower the market, if you decided to move in the direction of momentum (as you did last year), you effectively function analogously like putting a supercharger on an engine.\n\n&#x200B;\n\n# What should you do with this information?\n\nWell, I suppose you start by giving yourself a tuggie while thinking about it.  But then understand that you've already determined 2021's stock of the year less than 2 weeks in by sheer force of will.  Just like TSLA was last year in spite of the numbers making absolutely zero fucking sense (there's no logical reason why TSLA is worth  more than every other car maker combined when they don't sell shit), you've made GME the 2021 stock of the year that you can just keep making go up and up no matter what the numbers or fundamentals say...just because you fucking want to.  As long as you guys stay in the herd and just keep holding the line, you can essentially push that stock to whatever price you damn well please (hell, this sub probably owned 6% of the company this morning).  You guys bullrushed this so hard that, at one point today, THERE WEREN'T EVEN SHARES AVAILABLE TO SHORT.  By brute force, you essentially made it so the stock HAD to go up.\n\n&#x200B;\n\nIt's an interesting phenomena.  I myself gave it a run around Christmas and bought a bunch of 1/15 options @ 19 late last year which I just exercised today, honestly expecting them to expire worthless.  Fast forward to today, and I'm sitting on 60,000 shares of a company I don't even believe in after exercising those today.  But what I have come to believe is the power of you glorious retards, so I'm riding shotgun for this one.\n\n&#x200B;\n\nJust keep that in mind when you start seeing the herd here start to move in a direction.  I read a lot of comments today about people who didn't hop on the train because they didn't believe or because they pussed out, and this was an interesting test case of you dudes being able to do whatever the fuck you want when you unify, so just put on the cap and start chanting One Of Us...\n\n&#x200B;\n\n&#x200B;\n\nOh, and because I forgot in the original post:\n\n&#x200B;\n\n 🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀  🚀🚀🚀🚀🚀🚀🚀 ",
        "title": "It's time for some real talk - of what you've all become, the stock of the year, and how much power you actually wield (don't worry, the TL:DR is \"Autism good\")",
        "created_utc": 1610576076.0,
        "upvote_ratio": 0.97,
        "num_comments": 193,
        "author": {
            "name": "NrdRage",
            "id": "cny2q"
        }
    },
    "kwqvwh": {
        "score": 59,
        "selftext": " [https://www.marketwatch.com/story/gamestop-investors-celebrate-gain-porn-as-cnbcs-jim-cramer-says-reddit-is-in-control-11610569885?siteid=yhoof2](https://www.marketwatch.com/story/gamestop-investors-celebrate-gain-porn-as-cnbcs-jim-cramer-says-reddit-is-in-control-11610569885?siteid=yhoof2) \n\n&#x200B;\n\nI swear to god I hope you all get out of this thing in the green.",
        "title": "GME - Cramer is a believer.",
        "created_utc": 1610574721.0,
        "upvote_ratio": 0.91,
        "num_comments": 7,
        "author": {
            "name": "Ben_Frank_Lynn",
            "id": "11fehc"
        }
    },
    "kwqlhw": {
        "score": 72,
        "selftext": "Hey retards, first post in here. As we're all jacking off to today's gains, let's take a moment to look back at the history we're trying to re-create. Back when you all had even less hair on your balls, Porsche quietly bought up 70%+ of VW. They told the world on Sunday, Oct 26 and the day after............**🚀** **🚀** **🚀** **🚀** **🚀** **🚀** **🚀** **🚀** **🚀** **🚀** **🚀** **🚀** **🚀** \n\nOK thanks for the history lesson, but who cares? Two takeaways\n\n1. There were 2x considerable drops before the squeeze. Who truly has BRASS BALLS will be known here.\n2. The squeezed price stayed high for several days after because the estates of the  hedge fund managers who shorted VW had to go through very complex wills to figure out WTF to do after the manager jumped out the window. The second part of that may or may not be true. \n\n&#x200B;\n\ntl;dr GME has NOT squeezed yet. Buy SHARES now!  It's not too late, but this is likely your last chance. You'll have plenty of time (days) to cash out at tendie town. **🚀**  **🚀**  **🚀**  **🚀**  **🚀**  **🚀**  **🚀**  **🚀** \n\nPositions: 428 shares, 1x 20c jan15",
        "title": "History lesson DD: VW & GME🚀🚀🚀",
        "created_utc": 1610573896.0,
        "upvote_ratio": 0.96,
        "num_comments": 26,
        "author": {
            "name": "Jacksonxp1",
            "id": "72bll7gv"
        }
    },
    "kwqeds": {
        "score": 984,
        "selftext": "It's happening. Melvin is soft sucking our tips right now. Unfortunately, he is actively trying to spit it and quit it. The real swallowing and squeezing of every last drop hasn't even begun. I have been with you bunch of retards on our worst days and you can fucking bet that I am going to be here on our best days. \n\n&#x200B;\n\nFirst off, congratulations to those that actually had the brain power to shove taint deep into GME. You are all heroes and deserve every tendy and spoil you earned from pillaging Melvin's guts. This train isn't stopped and it hasn't even hit second gear. We are taking these bitches to the slaughterhouse and we are going to margin call them so hard that their kid's credit suffers. THE WAR IS NOT FUCKING OVER!\n\n&#x200B;\n\nSecondly, to all you brain dead idiots that messaged me on your lunchbreak while at your full time glory hole jobs just to say that I was retarded and you're buying puts, I hope you were lying. If not, you are likely gonna be homeless next week so get used to living in the backseat of your broken down car. I can't imagine being as stupid as you and broke as shit. We get it, you hate making money and prefer to lose it. Whatever floats your boat I guess.\n\n&#x200B;\n\nWe can't stop, won't stop GAMESTOP. You all need to remember that shorts have not covered. Some have, maybe. Most have not. This party is just getting started. If you want to earn your wife back and make her stop seeing her boyfriend then listen here because as mentioned earlier this week, I have been giving you guys the mother fucking SCRIPT and you just have to follow it. For those that missed out on gains today, I feel you. Unfortunately, I sold my Jan 15 calls for 600 dollars just a few days ago. 100 of them. Let that sink in. While it wasn't my entire GME position, it would have changed my life. I missed out on so much money taking care of personal stuff that honestly, it's going to take a long time to recover from it. OH FUCKING WELL, I'm going to make it back and you smooth brains are going to make even more. This roller coaster isn't fucking over. Grab your cocks and socks because it's fucking money time. We have at least a week to watch these retard shorters scramble to cover their positions and we are gonna be jerking it all goddamn week while we ride our green dildos. This army is mobilized and we aren't stopping till we are at the fucking bank with all of Melvin's money. I know some of you guys are getting \"fuck you\" levels of money and I could cry I'm so proud. \n\n&#x200B;\n\n LONG LIVE GME AND ITS ROCKET TIME BOYS.  🚀🚀🚀🚀 🚀🚀🚀🚀 🚀🚀🚀🚀🚀🚀🚀🚀 🚀🚀🚀🚀",
        "title": "Our time has come but GME isn't fucking done yet. 🚀🚀🚀🚀",
        "created_utc": 1610573332.0,
        "upvote_ratio": 0.97,
        "num_comments": 241,
        "author": {
            "name": "jbro12345",
            "id": "n4cs6"
        }
    },
    "kwq8tc": {
        "score": 7,
        "selftext": "I know most of you, my fellow autists/retards, are distracted by your massive GME gains today but....\n\nIt's rumored that the BTWN (SPAC) and Tokopedia which is an Indonesian e-commerce startup might  reach a $10 Billion deal. I'm not as well informed as some of you but I just wanted to have a discussion whether it's worth a shit or not.\n\nMay the autist juices flow through you!",
        "title": "$BTWN and Tokopedia",
        "created_utc": 1610572896.0,
        "upvote_ratio": 0.71,
        "num_comments": 25,
        "author": {
            "name": "Renowned1k90",
            "id": "7isf7h4"
        }
    },
    "kwpvev": {
        "score": 64,
        "selftext": "What a sensational day it was! \n\n$GME was on the top list in terms of Reddit Score & Rocket Score for the last 7 days and confirmed it's potential today !! 🚀🚀\n\nDon't hesitate to look at the open source most Trending  stocks by Subreddit at [http://unbiastock.com/reddit.php](http://unbiastock.com/reddit.php) . Your Support & Suggestions are more than welcome! \n\nNext one on the list : - $PLTR !!",
        "title": "GME Most Trending Stock Confirmed !!",
        "created_utc": 1610571851.0,
        "upvote_ratio": 0.94,
        "num_comments": 17,
        "author": {
            "name": "Swiss-Rock",
            "id": "98nxwgah"
        }
    },
    "kwpu5i": {
        "score": 79,
        "selftext": "Looks like Melvin closed half of their put positions today. So it looks like MMs would have delta hedged by buying back a shit ton of GME causing this explosion? Doesn't this mean that GME continues to moon this week as the rest of the puts are closed?\n\nIf you didn't buy the dip before close, you're retarded, we're mooning again tomorrow, or by Friday. Confirm bias me.\n\nPositions: 600 shares.\n\nEdit: Ok wait, I guess it's possible that they bought additional puts as a futile short attack, we'll see the OI tomorrow.\n\nEdit2: It's hard to interpret this but there are new big put positions open for 25p and 30p. So they might have rolled up the strike. But probably just digging themselves a deeper hole.\n\nhttps://preview.redd.it/vi20pyzy46b61.png?width=2916&format=png&auto=webp&s=83348656c16cbd160766e9616b7cea3dc8cad2cc\n\n&#x200B;\n\nhttps://preview.redd.it/tlzv1phvy5b61.png?width=1528&format=png&auto=webp&s=8981c74755dc57354c6d989dbf62627f27807bd4",
        "title": "Melvin's GME 24p 1/15 Only Half Closed",
        "created_utc": 1610571755.0,
        "upvote_ratio": 0.99,
        "num_comments": 59,
        "author": {
            "name": "jesuspwndu",
            "id": "a0hyq"
        }
    },
    "kwppvs": {
        "score": 201,
        "selftext": "GME was a fucking value play. Thats some boomer shit right there. But here in wsb we once again meme’d GME gains into reality(oh and basic fucking math, thx melvin ya morons) and are reaping the rewards of an investment decision that actually made sense in general. Specialty retail shop survives 08 and wuflu, has interest of major investors, and is positioned to become profitable again cuz the revenue is there it only must become more efficiently generated. Pretty easy right? Just buy shares or leaps and wait. \n\nProud of these gains for everyone today, cant wait for the next few weeks as the shorts die and cohen shits on their portfolios. \n\n550 shares and 1 01/21/22 $20 C\n\nGod speed my fellow autismos",
        "title": "The irony of GME",
        "created_utc": 1610571429.0,
        "upvote_ratio": 0.97,
        "num_comments": 21,
        "author": {
            "name": "Vi0lentByt3",
            "id": "ej2vb"
        }
    },
    "kwpilt": {
        "score": 135,
        "selftext": " **🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀** \n\n**TL;DR: Price movement today was mostly caused by autists going long on GME because of daddy Cohen's giant throbbing member, the real short squeeze isn't even here yet.  Check the bolded sections below if you want your dick to explode(unless you're Melvin and have no dick).**  \n\n**Happy Hunting you degenerates.**\n\nGME Shares @ $16.23\n\n**🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀**  **🚀🚀🚀🚀🚀**   \n\n&#x200B;\n\nDow Jones:\n\n\"A long-buying tsunami ... is the primary factor for the price move,' short-selling expert from S3 says  \n\n\nGameStop Corp. (GME) shares soared Wednesday in an apparent short squeeze, but one analyst who specializes in information on short selling doesn't think that's the case.  \n\n\nGameStop shares surged more than 60% Wednesday -- which would be its largest one-day percentage gain ever, according to Dow Jones data --more than a week after short interest on the videogame retailer's stock exceeded the number of shares outstanding. At last check, more than 125 million shares had traded hands in the day's session, compared with a 52-week daily average volume of 6.5 million shares.  \n\n\n**While GameStop has 69.8 million shares outstanding, short interest on the stock rose to 71.2 million shares on Dec. 31 from a previous 68.1 million shares, according to FactSet data.**  \n\n\nOn Monday, GameStop shares finished up 10% (https://www.marketwatch.com/story/gamestops-stock-shoots-up-after-reaching-agreement-with-activist-investor-2021-01-11) after it reached an agreement with activist investor RC Ventures to add three of its members to the board, and advanced less than 0.1% on Tuesday. Also, on Monday, the company said holiday same-store sales rose 4.8% and that digital sales had jumped 309%.  \n\n\n**While noting that shorts definitely were a part of the buying binge, Ihor Dusaniwsky -- the head of predictive analytics at financial technology and analytics firm S3 Partners, which specializes in analyzing data on short selling -- said he doesn't agree that GameStop's price surge was the result of a squeeze.**  \n\n\n\"GME's board shake-up and stronger holiday sales is causing a long-buying tsunami, which is the primary factor for the price move,\" Dusaniwsky said in emailed comments. \"While I agree that we are seeing some shorts squeezed out of their positions due to massive mark-to-market losses today, this is much like the chicken-and-egg question -- did long buying lead to short covering\\\\squeeze or short covering\\\\squeeze lead to long buying?\"  \n\n\nDusaniwsky believes it's the former.  \n\n\n**\"We will not be seeing a massive drop in shares shorted over the next few days, more like a 10%-20% drop which would mean 7 to 14 million of shares covered, which is nowhere near the almost 70 million shares traded this morning,\" the analyst said. \"Long buyers are the primary force driving GME's stock price up. \"**  \n\n\nGameStop shares have skyrocketed more than 500% in the past 12 months, compared with a 16% gain in the S&P 500 index and a 42% rise in the Nasdaq Composite Index .  \n\n\n\\-Wallace Witkowski\"",
        "title": "🚀🚀🚀🚀🚀GME Squeeze hasn't even Happened yet🚀🚀🚀🚀🚀",
        "created_utc": 1610570838.0,
        "upvote_ratio": 0.98,
        "num_comments": 47,
        "author": {
            "name": "eagseagle",
            "id": "iz1wo"
        }
    },
    "kworga": {
        "score": 80,
        "selftext": "First off, stop hailing wsb for causing this, i believe that we make barely a drop. If not for Cohen’s activisim, we would probably be in the 10s. That said, congrats on all who were finally rewarded. \n\n&#x200B;\n\nI believe that our daddy Ryan Cohen is behind this, although not purely by buying. \n\n&#x200B;\n\nFirstly, notice how his tweets got more and more frequent leading up to today. \n\n&#x200B;\n\nNext, compare the circumstances of today with the +25% day on 22nd - mooning on a day with no news, after news related to cohen. Note that the mooning came 1 and 2 days respectively after the news, indicating that the news wasn’t the cause. \n\n&#x200B;\n\nIn conclusion, Cohen, being an insider, recalled his shares, starting off the short squeeze.  This also explains how during these 2 rallies, shares available to short remained constant on iborrowdesk, indicating that those shares cannot be shorted anymore.\n\nedit: an analyst from s3 has came out saying that this is primarily long buys driving the price up, is that common for institutions to accumulate by 60% days?",
        "title": "A theory on why GME rose 94% today",
        "created_utc": 1610568713.0,
        "upvote_ratio": 0.88,
        "num_comments": 38,
        "author": {
            "name": "supremeslp",
            "id": "r7vihq1"
        }
    },
    "kwookt": {
        "score": 302,
        "selftext": "I've been seeing some disturbing things in comments and the daily discussion today -- people talking about selling GME, taking their current gains and shoving them into their little piggy banks and patting themselves on the back. People talking in the past tense about the moves GME made today.\n\nThis is the biggest, dumbest, most stupidest smoothbrain move of all time.\n\nThe action on GME today was a **correction.** Market cap is currently at 2.13B (share price $33.13). GameStop made **$1.77 billion** in revenue in the **holiday season alone.**\n\nThere's really only 1 question you need to ask yourself when thinking about if you should stay in GME:\n\n**Do you believe Ryan Cohen can turn GME around and turn it into a growing company?**\n\nIf you answered that with a yes (which you should), then I can't stress enough how stupid it is to sell today. Half of the fucking boomers out there still probably think GameStop's going to go out of business because they don't believe in daddy Cohen and his ability to print tendies for shareholders. GME will 🚀🚀🚀🚀🚀🚀🚀🚀  \n\nSuccessful, established companies trade at a P/E of like, what, 20? Walmart is 20. Amazon is 91. Shopify is 724. Verizon is 13. Bank of America is 16. EA is 31. Tesla is fucking 1621.\n\nIf you think Ryan Cohen can turn GameStop around into a profitable, growing company, you should see that the real upside of all this shit isn't a 60% leap, or, fuck it, even a 100% leap today -- this thing's got long term value. We'll see the share price fucking triple when the market at large sees RC get these guys on track. Fucking hold that shit.\n\ndisclosure 75 shares, 1 4/16 32c, 3 4/16 40c, -1 11/19 15p",
        "title": "GME and the Past Tense, aka selling now is a fucking smoothbrain move",
        "created_utc": 1610568490.0,
        "upvote_ratio": 0.96,
        "num_comments": 98,
        "author": {
            "name": "cardinalshitheed",
            "id": "5iwhcp6w"
        }
    },
    "kwo8hp": {
        "score": 171,
        "selftext": "In this case paper handing is selling GME today.\n\nJust a friendly reminder that this stock is worth $50 on fundamentals alone without even accounting for what Cohen brings to the table. The short interest is still larger than life and this is just the first of many squeezes. Naked short selling still exists and is GME is still on the list. There is more internal buying taking place by Cohen and his benevolent goons. Melvin has 01/15 24P and we will not let this shit touch $24. \n\nThe shorters know there will be paper-handed profit takers on the way up and they will wait for steadiness and dips to keep covering trying to average down their price point. HOLD! Do not let them. The harder the squeeze, the heavier the pressure is on the those filthy non believers. This squeeze will continue and will last weeks, don’t even try to set limit sells unless they’re at $500, no one here has any idea what the peak is if we keep the pressure on Melvin. And for any doubters that are laughing at $500 limit sells, let me explain with a retarded ELI-autistic thesis.\n\nIf every single share of GME was put up for sale at once and there was no buy interest, the price floor is $0. Now imagine the opposite where we have buy interest larger than shares outstanding (i.e. all shorts were to cover at once), what is the ceiling? Who the fuck knows, especially any of us retards.\n\nNow we know the two extremes, reality lies somewhere in between depending on how many shorts cover, get margin called etc and how many paper-handed pussies choose to sell early. \n\nTLDR: fuck Melvin, hold GME shares like your wife holds her boyfriend\n\nPositions:\n\n900 shares at $18.05",
        "title": "Paper handing isn’t just selling for a loss",
        "created_utc": 1610567229.0,
        "upvote_ratio": 0.98,
        "num_comments": 23,
        "author": {
            "name": "probable-maybe",
            "id": "1jdpjik8"
        }
    },
    "kwnh7s": {
        "score": 192,
        "selftext": "Hi all! Since today has been an epic day, I was wondering if anyone wanted to share the wealth? I was thinking we could donate some of our GME profits to some local charities. I was thinking people could post links to their favourite charities, then who ever donates can post screenshots.\n\nTo spice things up, for every proof of donation, I'll donate $25 in addition to whatever you donate AND give you gold.\n\nEdit: to all the salty reets who don't want to close positions: chill. I know some of you guys paperhanded that shit and have some cash. In your honour: [https://imgur.com/a/OSowK5g](https://imgur.com/a/OSowK5g)",
        "title": "GME Charity Drive?",
        "created_utc": 1610565058.0,
        "upvote_ratio": 0.96,
        "num_comments": 56,
        "author": {
            "name": "publiccerts",
            "id": "gknn6"
        }
    },
    "kwmxm0": {
        "score": 15,
        "selftext": "“There is a GameStop short squeeze, but no the squeeze is not the major force behind the price move,” Ihor Dusaniwsky, managing director of predictive analytics at S3 Partners, said by email. “This is much like the chicken and egg question -- did long buying lead to short covering/squeeze or short covering/squeeze lead to long buying?”\n\nThis is a quote from the Bloomberg article today. Lads, diamond hands, and chill. Go jerk off of it helps. The only thing getting squeezed is your butthole from the stress. The GME squeeze is just beginning.",
        "title": "GME is just barely getting started",
        "created_utc": 1610563516.0,
        "upvote_ratio": 1.0,
        "num_comments": 2,
        "author": {
            "name": "Enasakoma",
            "id": "iyj7g"
        }
    },
    "kwmk9i": {
        "score": 70,
        "selftext": "Questions:\n\n&#x200B;\n\nDo we know if anyone was covering? OR was this legitimate buying due to cramer and this hitting twitter AND people catching on to the new board members? (few day lagg)?\n\n&#x200B;\n\nIF puts didn't (or bought) haven't covered, could we assume the price is going to be pushed down a bit with all of their effort and they are just waiting for the hype to die down a bit?\n\n&#x200B;\n\nThoughts?\n\n&#x200B;\n\nedit:\n\nLet me rephrase, I aint trying to piss on anyone or their parade I just wanted a legitimate discussion here as we know Melvin and their gaybear gang like to  be dicks.",
        "title": "GME Despite the hype, I got questions",
        "created_utc": 1610562486.0,
        "upvote_ratio": 0.96,
        "num_comments": 101,
        "author": {
            "name": "KamikazePenguiin",
            "id": "j84k0"
        }
    },
    "kwln2x": {
        "score": 49,
        "selftext": "First of all, it's pronounced Val-é, like valley. Make sure before you go pitching this, know it's not \"vail\". You will get laughed out of the boardroom or bus station depending on when you meet the MD.\n\nTLDR: VALE $25 Jan 2022.\n\n&#x200B;\n\n**Iron Ore**: Like MT, which was the hottest meme stonk of 2 weeks ago before all the retards went back to trying to see who mark the top on GME, VALE is driven by iron ore and resource prices. However instead of the prices of finished steel products which is what MT deals in, Vale deals in the dirty stuff out of the ground.\n\n1. So why not MT like a regular autismo? Well, finished steel products have already had the extended run due to demand far outstripping inventories from 2019/2020. Yes you can make the argument that the supply/demand issue can become more problematic, but you might be buying something very extended. Plus, these kinds of price shocks are called \"transitory,\" meaning that the extra demand is unsustainable (it's just all the orders hitting at once). Plus, we're dealing with steel here, not something precious and supply-constrained like gold or girlfriends.\n2. Honestly, why not MT? Well, their input prices (iron ore and energy) might start heading up.\n3. If anyone here has taken basic economics, this is the start of a curve shift (instead of moving along the curve) as everyone country in the world starts building with newly printed/borrowed money (more on that later). Demand from mills will drive up prices of the input goods, which in this case is iron ore.\n\n&#x200B;\n\nhttps://preview.redd.it/fvb6o60ms4b61.png?width=1194&format=png&auto=webp&s=01fc39ce24539fc23244d154826d976d8dd9b0e8\n\n**Infrastructure**: Everyone who can borrow is borrowing. We're in year 12 now of massive monetary loosening, and it's not really working because all the new liquidity is going straight into stonks and financial assets which yield more than building bridges or improving that road.\n\n1. Why isn't this just lip service again? In the US especially, we have the return of Mama Yellen. Her economics is pretty classical Keynesian, or that you need fiscal (government) spending instead of monetary easing. As Keynes said, you can't loosen a bag by pushing on a rope (you can slow the economy by increasing rates, but you can't always improve it by going the other way). She has had first hand experience in this during her term as Fed Chair: rates are still dragging near 0, but inflation was still nonexistent. Who has control of fiscal spending now? The Tax and Spend Democrats who will definitely at least listen to what Mama Yellen has to say. This is also the main driver of green stocks (we're going to ~~print~~ ~~borrow~~ tax so much money and build so many chargepoints). But before that, we're going to build new highways, roads, buildings etc.\n2. What about overseas? Infrastructure bonds are easier to issue than other types. Basically, the borrower would usually be a government (slightly more trustworthy). These countries which formerly borrowed at nosebleed levels in US dollars has suddenly seen their interest rates drop, with the ability to borrow in local currency. Are they going to spend on infrastructure? Well, that's what their bond is backed by. Even though 80% of the money is going to go to an oligarch, at least a bridge will be built.\n\n&#x200B;\n\nhttps://preview.redd.it/2sogh48qu4b61.png?width=1370&format=png&auto=webp&s=f40170cacd8c1f20fda16238720c51c77132791a\n\n**Inflation**: this is my weakest point, but a helpful one. I expect inflation to start heading up these next few years, especially in the US because of where the money is going.\n\n1. Wage increases. Biden's has repeatedly said he will raise the federal minimum wage to $15. Yes, you can argue that will move towards more automation and lower the actual amount of people working, but this section is not going to argue about that. One of the main reasons why goods inflation (not asset inflation) has been so low is because those who benefited from lower yields do not automatically spend more. How many burgers can Bezos eat in 1 day? With higher wages hitting a larger part of the population who will actually spend it, inflation is expected to go up, driving up the prices of everything else.\n2. Central Bank tolerance of inflation. The fed has already said they are moving more towards long run inflation averaging. This means higher inflation will be tolerated for longer, because the years before that had low inflation. This view, coupled with the fed's view that any spike in prices after we get out of the pandemic will be transitory, means that we have the prefect mix of powder and oxygen to spark runaway inflation. What benefits during these times? Good ol' usable metal.\n\n**Brazil:** Everyone and their ~~mothers~~ idiot wealth advisors are clamoring for emerging markets again. This time, there are a few different drivers:\n\n1. Cheap liquidity, and even cheaper dollars. Go read about the carry trade here. The dollar will be weak in the next few years because of additional borrowing and spending, but also even more because everyone will be selling dollars to buy overseas assets. Why? Well, there's higher return overseas, like the Bovespa vs SPX chart below.\n2. Higher tax rates in the US. You know that's what's going to happen. You know corporate taxes are going to get bumped up to 28% from 21%. Tech companies are smart enough to move their profits overseas, but not so much for domestic manufacturing. Vale is incorporated in Brazil, which last time I checked wasn't the US.\n3. Brazil is super cheap right now. That also has to do with the fact most Brazilian companies are involved in natural resources and agriculture, which doesn't have the shine of tech. This is also why Vale is so cheap and doesn't move as much (more below).\n4. Regulation? Brazil doesn't have them. You want to blow up half the Amazon? Well, does it make money?\n\nhttps://preview.redd.it/z007jr85z4b61.png?width=1458&format=png&auto=webp&s=33165fc2dfd77667d949f754e0a4f7c2574e3b00\n\n&#x200B;\n\nNote: Vale does not move as quickly as tech companies. It's a damn mining company. Fortunately, the IVs are also relatively low (40% for $25 Jan 2022, at about $1 a contract). I do not recommend playing anything before June.",
        "title": "VALE: Iron Ore, Infrastructure, Inflation and Brazil",
        "created_utc": 1610559949.0,
        "upvote_ratio": 0.89,
        "num_comments": 45,
        "author": {
            "name": "1poundbookingfee",
            "id": "1uiw1p7"
        }
    },
    "kwlit0": {
        "score": 995,
        "selftext": "Ok retards. Listen up. Papa cohen and his 2 migos (the same 3 guys that got Chewey to a $46 Billion market cap) are about to take you and every autist to the moon.\n\nWithout getting too technical, a group of fucking assholes called Melvin Capital or some shit are knee deep in Puts. They were suppressing the price at 22$ for the past month. Today the price shot up 60% and Melvin is probably having a stroke right now. They will have to eventually buy these shares back from us Autists, institutions, and every other lucky fuck who has a GME share to sell. \n\nProblem for these boomers, is that the board of $GME holds 20% of the overall stock. On top of that, institutions like Blackrock, Vanguard hold another 20% or so, they will NOT sell. Wall Street Bets has 1.8 million users. Dont underestimate our power. On top of that, Cramer is going to shill this to every boomer today/tommorow. Look at his twitter.\n\nSo basically Autists, if we keep buying up GME, Melvin and his boomer friends will be fukt. GME at a $25 Billion market cap means that GME is valued at ~300$/share. 35$ is a STEAL. \n\n3 Step TLDR for the ultimate Autist: \n1. BUY GME STOCK NOT OPTIONS. 2. HOLD FOR 3-6 MONTHS. 3. BUY LAMBO FOR YOUR WIFES BOYFRIEND.",
        "title": "$GME DD for the average Autist. Why 35$ is cheap for GME.",
        "created_utc": 1610559643.0,
        "upvote_ratio": 0.97,
        "num_comments": 290,
        "author": {
            "name": "etolk992",
            "id": "3v9ilxfm"
        }
    },
    "kwlhx8": {
        "score": 627,
        "selftext": "I just made a donation to Autism Canada in honor of WSB of the tendies I made today.\n\nI invite you people to do the same :)\n\n[https://autismcanada.org/donate/](https://autismcanada.org/donate/)\n\nhttps://preview.redd.it/ri4szzfqy4b61.png?width=1333&format=png&auto=webp&s=a5cf4a78a67caafac8005f17e92efd42652a3dee",
        "title": "I expect all of you GME Autists to make donations. Giving back is important. :)",
        "created_utc": 1610559578.0,
        "upvote_ratio": 0.96,
        "num_comments": 89,
        "author": {
            "name": "double_a_mtl",
            "id": "151wq4"
        }
    },
    "kwkf4t": {
        "score": 75,
        "selftext": "Some ideas to help you out:\n\n[https://www.edmunds.com/luxury/](https://www.edmunds.com/luxury/)\n\n[https://www.fraseryachts.com/en/yachts-for-sale/](https://www.fraseryachts.com/en/yachts-for-sale/)\n\n[https://www.feedingamerica.org/find-your-local-foodbank](https://www.feedingamerica.org/find-your-local-foodbank)\n\nPositions:\n\n&#x200B;\n\n[Had to splice two pics together, thus the changed &#37; from timing.](https://preview.redd.it/wl4uvv3bq4b61.png?width=1152&format=png&auto=webp&s=364dc865857bc15f6906daaec30f5b464fe87b39)",
        "title": "GME Gang - What are we spending our tendies on?",
        "created_utc": 1610556680.0,
        "upvote_ratio": 0.93,
        "num_comments": 37,
        "author": {
            "name": "AngryPheldagrif",
            "id": "5h4sd4jf"
        }
    },
    "kwkayi": {
        "score": 25,
        "selftext": "Today Goldman Sachs chief economist warned of a coming correction in the market. We’ve been discussing the dollar bouncing and this possible correction for the last couple days. This is my 3rd post on the subject. \n\nI’ve come to understand from some of your comments that many traders here do not view the market in periods longer than a day. Certainly not in weeks or months. When I say that the dollar is bouncing, it isn’t going to happen in a day. So when you see the dollar rising and falling over the next couple weeks, save the “This didn’t age well” comments and wait, because moves in the dollar happen over weeks and months - not hours and days. My outlook for the correction is late Jan/Feb So don’t read this and think that the market is gonna sell off tomorrow. Personally I still think we have one leg higher to go in the SP500 before the correction. \n\nGoldman coming out and also warning of a correction today, increases my conviction about what I am saying. I don’t like big trading firms, I think they are market manipulators with criminal rapsheets. That doesn’t mean I ignore them when they say these things, especially when it reinforces my own thesis on the market which I developed independent of their analysis. \n\nAnyways, hope some of you find value in this. And on a side note, watching GME blast off today put a huge smile on my face. Nicely played WSB... ya did good kid. 👍🏻",
        "title": "Day 3 discussion on the dollar and a market correction",
        "created_utc": 1610556333.0,
        "upvote_ratio": 0.86,
        "num_comments": 21,
        "author": {
            "name": "Extracrispytendies",
            "id": "9352rjcp"
        }
    },
    "kwjyhm": {
        "score": 1333,
        "selftext": "You’ll be seeing a lot of gain porn throughout the entirety of today. For those of you who paper handed, I’m sorry. Although maybe it opened your eyes to realize that WSB runs the market. We’re bigger than investment firms, hence why there’s still a play to be made.\n\nPLTR. Yet to explode, yet held on by all the same diamond hands of $GME. There’s a presentation at the end of this month for Palantir and it’s for showcasing their technology so shareholders and people who haven’t gotten in yet can better understand the product they’re providing. Although you don’t want to get in after the presentation, you need to get in before. If you think that $GME is exploding, just wait because $PLTR is known by everyone. I’ve even heard random idiots at bars talking about it. The amount of diamond 💎 hands 🖐 in PLTR is catastrophic, there’s no doubt that this company will succeed in the future. \n\nLockup.\n\nLockup period is coming to an end, and shareholders will be selling their stakes. It’s inevitable, but that’s why you make a play on PLTR now because the drive up before lockup will be something extraordinary since shareholders will try to maximize their gains upon lockup ending. Take those GME tendies and put them straight back into the market with good ol’ Palantir.\n\nMake some money now, sell before lockup and screw over the shareholders by forcing them to hold their shares once again. The amount of volume upon lockup ending will be tremendous and quite possibly the biggest shit show of 2021. I’m in for the ride and hope you guys are too.\n\nTL;DR: Presentation end of month = Drive up in stock price. Lockup in early February = Drive up for shareholders to capitalize their gains.\n\nPositions: 400 Shares @ 26.4, 1/15 27c , 1/22 28c\n\nEdit: 🚀🚀",
        "title": "For those who doubted $GME.",
        "created_utc": 1610555353.0,
        "upvote_ratio": 0.96,
        "num_comments": 377,
        "author": {
            "name": "shuffil",
            "id": "2xmy1hr9"
        }
    },
    "kwjxof": {
        "score": 176,
        "selftext": "Volume is 43M right now as I write this post. Floats are 24M. Taking into account the 100k of puts and the buys, failure to delivers and the 300% short interest to float they still haven't fully covered.\n\nAlso around 40K+ puts got traded today.\n\nThis makes you realise how deep the shorts and puts are right now and despite our huge run how massively more they have to cover. Remember our calculations that it takes a few days for shorts to cover because of massive short to float ratio.\n\nI am not a financial advisor and explaining why the run has not been stopping since the morning.\n\nEdit: We are just leaving earth 🚀🚀🚀🚀🚀🚀\n\nEdit2: Volume reaching 70M, enough to cover. afaik.\n\nhttps://preview.redd.it/dap98232n4b61.png?width=900&format=png&auto=webp&s=c5bf389cc2f6dff38e3a0643a5f51f0bbdf2ed66",
        "title": "Kind reminder for our fellow GME GANG",
        "created_utc": 1610555283.0,
        "upvote_ratio": 0.98,
        "num_comments": 60,
        "author": {
            "name": "ShitFeeder",
            "id": "2o83vdvy"
        }
    },
    "kwjlen": {
        "score": 328,
        "selftext": "&#x200B;\n\nhttps://preview.redd.it/yki77r6hp4b61.png?width=615&format=png&auto=webp&s=c4e51a466e39445c79adc9326e72c78de95f33ad\n\nUpdated!\n\nHOLDING!BUY BUY BUY SHARES\n\nWhen the Margin calls roll (9.45-9:50) we will see MARS!\n\nTHANKS FOR THE AWARD ;D\n\n\nHow to change my flair?",
        "title": "GME: i am not f***** selling! GME to 100!",
        "created_utc": 1610554356.0,
        "upvote_ratio": 0.96,
        "num_comments": 53,
        "author": {
            "name": "slocs1",
            "id": "fabwt"
        }
    },
    "kwjcqc": {
        "score": 47,
        "selftext": "Listen fuckers,\n\nMy actual work function is outside equities. But I can walk you through some technicalities of how borrowing of shares work and the technicalities behind short squeezes.\n\n&#x200B;\n\nTry to not buy GME on margin, the more GME is bought in cash accounts, the more buyins are forced on shorts.\n\n&#x200B;\n\nBuyins are done on the open market to source shares and or to close out short positions for which there are no shares to pair against (DTC participants do not like allowing naked shorts and violating REG SHO). DTC participants will also not go into negative share segregation either.\n\n&#x200B;\n\nBasically: If Morgan Stanley requires 30,000 GME from GS, GS could have 100,000 but if it is segregated, it will not be able to make delivery to MS. Over time, MS will force GS to take action to source shares. If it cannot a buyin can be executed and the burden (mkt cost and position closeout) will be passed to GS. This illustrated example can happen regardless of a long or short market bias on a security. A stock could be un-sourcable, even if a huge majority of participants are long. It just means a lot of the float is tightly held,and held in cash accounts-- you usually only see this in grandpa stocks, or thinly traded stocks for the buy and hold camp of people.\n\n&#x200B;\n\nSo, if there is a huge rush of cash account buying, there will be more shares held in segregation which will force closeouts of short positions (smaller ones not huge insitutional bets). These buyins are always literally market buys and the  burden is passed from the investment bank to the short.\n\n&#x200B;\n\nNow in theory, this is only sustainable for a short amount of time because you autists will have to sell and realize gains for those sweet tendies, but in a world of sunshine and rainbows, this buying could continue day after day and the whole thing becomes a positive feedback loop.",
        "title": "Thoughts on Buying GME in CASH accounts , on stockloans and segregation",
        "created_utc": 1610553665.0,
        "upvote_ratio": 0.93,
        "num_comments": 8,
        "author": {
            "name": "Simon_Inaki",
            "id": "4pwf1"
        }
    },
    "kwj72y": {
        "score": 62,
        "selftext": "Previous post [here](https://www.reddit.com/r/wallstreetbets/comments/kqmx8y/gme_loss_porn_it_aint_over_yet/)\n\n[Modest gain, rolled some of the gains into shares](https://preview.redd.it/cqbal5bnf4b61.jpg?width=1115&format=pjpg&auto=webp&s=ff3f1e8b91d6ce3aacd5c352f7799c33bfde930b)",
        "title": "Follow up to GME loss porn",
        "created_utc": 1610553254.0,
        "upvote_ratio": 0.95,
        "num_comments": 16,
        "author": {
            "name": "CEO_OF_SPY",
            "id": "6iqzjssf"
        }
    },
    "kwiuwv": {
        "score": 84,
        "selftext": "With GME doing so well, and seeing the slight dip as investors cream their undies at the sniff of $30 a share, where do we draw the line to sell? \n\nI’m fairly new and see the talk of the short squeeze but without showing how much of a retard I am... how do we know when it’s squozen? What’s your guys point that you’ll sell at?",
        "title": "With GME up over 40% today, where do we draw the line?",
        "created_utc": 1610552287.0,
        "upvote_ratio": 0.87,
        "num_comments": 75,
        "author": {
            "name": "Midgetised",
            "id": "u1ain"
        }
    },
    "kwfr3x": {
        "score": 60,
        "selftext": "Let's assume there's only 5 GME shares in total.\n\nLet me make my question even more clearer.\nSuppose A has 5 share. B sells short the 5 shares. Now C buys those 5 shares. Again D short sells those shares. E buys it.\n\nNow, A, B and E must receive their dividend of $10 for their 5 shares. So in total they receive $30. Short sellers must pay them $30?\n\nBut there were only 5 total outstanding shares in the first place. So the company only spends $10 in dividends whereas the short sellers have to spend $30?\nIs this true?\n\nI have been asking this question in Quora, reddit etc. Everyone seems to be giving an answer that's opposite of the other persons answer. I have posted in daily threads, r/investing etc.\n\nHope wallstreetbets can actually give me a clear and concise answer.\n\nEdit: adding to this question. How would shorts actually cover all the shares they sold short? My brain can't seem to figure it out. 23M float. 70M short. Are the shorts braindead? Surely not. It’s such a crowded trade.",
        "title": "What happens when a company's shares short is more than the outstanding number of shares and the company then announces dividend? Will shorts have to pay more in dividend than the actual amount of money that will be spent by the company for dividend? GME gang",
        "created_utc": 1610542019.0,
        "upvote_ratio": 0.93,
        "num_comments": 19,
        "author": {
            "name": "potatoandbiscuit",
            "id": "7r79rqlg"
        }
    },
    "kwb827": {
        "score": 1571,
        "selftext": "Hello again folks. I’ve taken some time to do my own DD on GME and sharing it with you, in addition to all the other great DD out there. I’m going to cover shorts, debt, and what I think might accelerate GME’s mission to Mars.\n\n**TL:DR;** GME is a ticking time bomb. Shorts R Fuk. Buy shares, Sell puts to acquire shares cheaper. Buy leaps on red days. No idea what's gonna happen in the very short term but 2021 will be massive.\n\n# About the Shorts\n\nSo, updated short interest came out today. If you haven’t seen it, shorts **increased** their positions through the end of the year:\n\n&#x200B;\n\n[12\\/31 short position update](https://preview.redd.it/k66xyn1oq1b61.png?width=781&format=png&auto=webp&s=a61c48086c09a509fe4a7152db90ba4a3c082323)\n\nWhat. The. Fuck.\n\nI really can’t figure out the macro logic here because from the outside it looks like they’re digging their own graves.\n\nOn the day-to-day scale, I think I understand how this is happening. If you look at the days with a high short volume ratio, the narrative is clear: Shorts are actively trying to defend GME crossing 20 significantly, and coming in hard when threatened. Shorts also took advantage of general market selloff on Jan 4 to push GME down.\n\n&#x200B;\n\n[Days with heavy shorting activity](https://preview.redd.it/dir3ss9sq1b61.png?width=1175&format=png&auto=webp&s=7d0859c5aff4dce709a27b945786507ba9c4de18)\n\nThis is also why GME ended up ***only*** \\~12% after the recent RC announcement. Short volume was a whopping **4MM** shares on that day.\n\nThe problem is shorts are doing all this active shorting to defend their existing short positions, but they’re either not able or not choosing to close all of the intraday shorting, so it’s accumulating. As of 12/31 the **total short positions (71.2M) exceed total issued shares (69.75M).**\n\n# The precarious position of the shorter\n\nShorts find themselves in a very precarious position. Let’s talk about the float and DTC (days-to-close). **The DTC number you see above is a lie.** There’s an argument to be made that **DTC is infinity.**\n\nThere are a total of 69.75M shares issued by GME. According to [this guy](https://www.reddit.com/r/wallstreetbets/comments/kw0djb/gme_floatshort_data/) who has a CapIQ subscription, insiders hold 22.8M shares. I was able to verify using this [nasdaq source](https://www.nasdaq.com/market-activity/stocks/gme/insider-activity) that the top insiders hold about 20% of shares:\n\n&#x200B;\n\n[Top Insider Holdings](https://preview.redd.it/id7ppwjvq1b61.png?width=781&format=png&auto=webp&s=abc9f4103776787f435ebbe719f5420c776d7ad1)\n\nThe thing with insiders is that they can’t easily sell due to lots of restrictions so they’re not considered part of the “actively” traded part of the stock. I.e. They can’t just sell on price action.\n\nIn addition to insiders, [**institutions now own 110% of GME shares**](https://www.nasdaq.com/market-activity/stocks/gme/institutional-holdings)**.** (Thanks shorters!). Some of these institutions may actively trade, but the top holdings (FMR, BlackRock, Vanguard, etc.) *will not trade based on price action* as they are generally holding for their ETFs / index funds that hold GME.\n\n&#x200B;\n\n[Institutional Holdings](https://preview.redd.it/de46p98yq1b61.png?width=790&format=png&auto=webp&s=6b3b9332efb259e72eae6209a3ce1743ed0b462f)\n\nNow, thought experiment. What happens ***if*** shorts decide to cover? They have to buy back 71M shares. Who are they going to buy it back from?\n\n1. They can’t buy them back from insiders.\n2. Let’s be conservative here, and say that Fidelity, BlackRock, Vanguard will hold on to their shares, but all of the other institutions will paper hand when shorts start to cover. This is very conservative because there are other institutions that hold GME for their own ETFs.\n\nSo, 69.75M shares - 22.8M for insiders - 23.43M held by BlackRock/Vanguard/Fidelity = **23.52M shares left.** So fuck all other short-to-float ratios out there, the **short % of tradable float is at least 300%.**\n\n[Investopedia ](https://www.investopedia.com/terms/d/daystocover.asp#:~:text=Key%20Takeaways-,Days%20to%20cover%2C%20also%20called%20short%20ratio%2C%20measures%20the%20expected,for%20the%20company%20in%20question.)tells us that days to cover is *“calculated by taking the* ***number of currently shorted shares*** *and* ***dividing that amount by the average daily trading volume*** *for the company in question.”*\n\nGME’s [20-day average daily volume](https://www.barchart.com/stocks/quotes/GME/technical-analysis) is about 10.4M shares, so that’s about 6.83 days to cover. This, however, is **a lie.** *The DTC definition listed by Investopedia stops making sense when short interest exceeds purchasable float.*\n\nMath whiz’s out there… if you have to buy 71M shares from a pool of 23.5M shares, and GME’s daily volume is 11M shares a day, how many days will it take to cover?\n\nAnswer: **Infinity. You can’t. You can never cover.** There literally are not enough shares to buy to close your shorts. You can only buy-to-close 23.5M shares, and that’s even if you can convince all of them to sell (i.e. $$$$$). **True DTC is Infinity.** This is part of the reason shorts haven’t covered. *There’s no way out of the burning building they’re in.*\n\n# How it gets worse part 1) Institutional Buying\n\nHere’s how it gets worse. Besides all the retards like you and me buying GME b/c of Lord Cohen and u/DeepFuckingValue, GME is about to cross some serious thresholds that make it attractive to more institutional buying.\n\nFirst, in the recent [Q4 numbers](https://news.gamestop.com/news-releases/news-release-details/gamestop-reports-2020-holiday-sales-results) release:\n\n* “The Company is continuing to suspend guidance, however, unless further unforeseen COVID-19 related impacts occur, it expects to realize positive comparable store sales results and **profitability** in the fiscal fourth quarter.\n\nSo, GME is about to cross into the positive EPS category, which in addition to the debt story below is going to potentially **unlock** **more institutional buying** that is currently blocked by rules like not investing in companies with negative P/E.\n\nSecond, let’s talk about debt.\n\n## Debt\n\nBusinesses leverage debt to scale; particularly true with retail businesses that have to pay for inventory in advance of selling it. High cost of debt -> lower profits -> lower ability to pay debt -> higher debt costs, and the cycle continues. On the flipside, if GME was able to increase its credit rating, you get lower debt costs, higher profitability, which leads to higher credit rating, etc.\n\nI believe we’re seeing a campaign from GME to pay down debt to reduce a) restrictive covenants in the 2021 notes (preventing things like more share buybacks) and b) upgrade their bonds to investment grade.\n\nNot only will a credit upgrade lead to cheaper debt, it will **unlock more institutional investment that are currently restricted against buying equities with below-investment-grade debt ratings.**\n\n## Debt\n\n* Debt was $472MM up until July 2020\n\n&#x200B;\n\nhttps://preview.redd.it/l87lqgtwr1b61.png?width=1069&format=png&auto=webp&s=7c897cd39f4b8874839fcdf602802cf015d78b22\n\n* GME announced a voluntary pre-payment of $125MM of debt ([link](https://www.globenewswire.com/news-release/2020/11/10/2124246/0/en/GameStop-Announces-Voluntary-Early-Redemption-of-Senior-Notes.html)) that will happen 3 days after the earnings call (earnings Dec 8, debt repayment Dec 11)... “**using cash generated from operations to reduce our outstanding debt”**\n\n## Debt rating:\n\n* First, take a look at GME’s bond pricing. GME’s bonds were significantly impacted by the March crash. However, GME’s bond pricing has recovered and is now **trading at par**, meaning the market believes that GME will pay back its debt (i.e. not a bankruptcy risk).\n\n&#x200B;\n\n[GME Bonds trading at par](https://preview.redd.it/cu6rpvpur1b61.png?width=1063&format=png&auto=webp&s=8cd2fd2376d717c198e65aa7d9f22ed4ec77b853)\n\n* Now, look at its Moody’s rating history. First, for context, anything under a Baa3 rating is considered junk (ratings chart here) and greatly affects who can buy your bonds and what types of rates you get.\n\n&#x200B;\n\n[Moody's debt ratings. GME currently sits at B3](https://preview.redd.it/56e3ba82s1b61.png?width=867&format=png&auto=webp&s=c1f56f076c11f01204a1086b43670a5a48ab7f30)\n\nHere are Moody’s actions on GME ([source](https://www.moodys.com/credit-ratings/GameStop-Corp-credit-rating-808528072)). In particular:\n\n* Downgrade on 5/2019 to Ba2\n* Downgrade on 1/2020 to B2\n* Downgrade on 4/2020 to Caa1\n* Upgrade on 7/2020 to B3\n\n&#x200B;\n\n[GME upgraded to B3 in Jul 2020](https://preview.redd.it/menraih6s1b61.png?width=786&format=png&auto=webp&s=da868433f2546ffe1c5ce3294e48559d9f03e256)\n\n## Speculation on debt:\n\n* GME is working with Moody’s & others to get credit rating back to Investment grade. Showing **positive earnings/profitability** and **paying back debt early** is key to this. I believe we should see an upgrade soon to at least Baa3 (the lowest level of investment-grade debt).\n* The market is not generally considering GME’s debt as risky as Moody’s credit rating would suggest. The market can move faster than Moody’s.\n\nPositive EPS + Debt ratings upgrade = massive institutional buying = shorts further in the hole.\n\n# How it gets worse part 2) Passive Buying Feedback Loop\n\nGME is part of [62 ETFs holding about 10.7M shares](https://www.etf.com/stock/GME) in addition to a whole bunch in index funds (not ETFs). I couldn’t get a number for index funds but am going to estimate around 10M for them as well given the Vanguard/Fidelity numbers above.\n\nMore than 50% of these holdings are passive, **market-cap weighted funds**. Now here’s the feedback loop that really fucks the short story up.\n\n1. Institutions buy GME ->\n2. Price goes up ->\n3. Market Cap Goes up ->\n4. Weight in Funds Goes up ->\n5. ETFs buy more GME for every $ of inflow ->\n6. Price goes up -> return to step 3\n\nAt $20, GME is already up >5x from its low of \\~$4 in 2020. This means that for every $1 thrown into IWM, for example, Blackrock is putting 5x as much of that $1 into GME as it was back at GME’s lows. As GME’s price goes up, **any market-cap weighted fund puts more money into GME for every $1 of inflow.**\n\nThe passive feedback loop has already started. It will really kick into high gear with institutional buying.\n\n# Other speculations:\n\n1. I believe RC is already slated to be CEO, and this will be announced in the June 2021 annual shareholder meeting.\n   1. This is why the ICR presentation was pulled. RC didn’t want the content in the ICR presentation to be the market-adopted story on the GME strategy.\n   2. 3 board members are retiring. I believe this is part of a pre-negotiated deal where RC is taking over. The 3 that are stepping down didn’t agree with the mgmt change.\n2. GME is due for a re-rate of price/sales. GME is currently trading at a P/S of 1 - if you ONLY include the ecommerce revenue. From a total revenue perspective it’s closer to .2. **GME is currently worth less than its quarterly revenue.** From the [Q4 sales pre-release](https://news.gamestop.com/news-releases/news-release-details/gamestop-reports-2020-holiday-sales-results):\n   1. “Net quarterly sales were $1.770 billion”\n   2. “E-Commerce sales, which are included in comparable store sales, rose 309% and represented approximately 34% of total company sales, with total worldwide E-Commerce sales year to date reaching over $1.35 billion, far exceeding the Company’s $1.0 billion growth objective;”\n\nAt this point, it’s really the endgame for shorts. They have to find a way to exit before Cohen is CEO.\n\n# ",
        "title": "GME - EndGame: DTC Infinity.",
        "created_utc": 1610521104.0,
        "upvote_ratio": 0.99,
        "num_comments": 389,
        "author": {
            "name": "FatAspirations",
            "id": "53quka80"
        }
    },
    "kw6pcv": {
        "score": 59,
        "selftext": "Elon is a believer in gaming. He thinks that in autonomous vehicles, entertainment is crucial and that gaming is the most preferred form of entertainment.\n\n[The first hint](https://twitter.com/elonmusk/status/1343608530998153222)\n\nAt this point in time, TSLA will be . . . well the same, huge and in a class of its own (sorry NIO).\n\nGME will be fully recovered and have shifted into mobile gaming (phones, cars, busses, trains, planes, waiting rooms, not quite in the age of functional contact lens entertainment . . .).\n\nWe can only hope to imagine what the sit down between Elon and RC would entail.  My best guess is that they meet for a private game of battleship (Elon not a big fan of chess) wearing short shorts.  Out of respect, RC only lets one nut dangle out of his shorts so that Elon can have the two nut seniority.\n\nThey realize VR is out of the question - too many lawsuits, but then realize they can just add bullshit to the terms and conditions and go full VR.  I'm talking VR racing (ironic isn't it), VRcations to Ibiza, and unfortunately the dreaded VR work meeting.\n\nSome less innovative but nearly as rich asshole companies, will immediately hop on board to milk the bonus productivity from its employees.  Think about it, company cars that take employees to and from home, meetings, conferences, etc. that track in vehicle activity.  This pressures employees to work from the car as often as possible, and the best part for the company is the car drives itself back after dropping off said employee at home.  Every large company will be forced to order their own tesla work vehicle fleet to compete with the productivity.\n\nAnd in traditional retard fashion $TSLA 96,024 1/13/23  $GME 969 1/13/23",
        "title": "2023 a TSLA GME story",
        "created_utc": 1610504274.0,
        "upvote_ratio": 0.86,
        "num_comments": 11,
        "author": {
            "name": "dizz31",
            "id": "5b5i20mw"
        }
    },
    "kw4mwt": {
        "score": 33,
        "selftext": "I'm a moron, and was trying to think of some additional plays should the GME short squeeze start to occur. The first thing that comes to mind is that shorts may have their long positions closed as they get margin called as GME rises - which could cause sell offs in other seemingly unrelated equities. Is this an absolutely stupid strategy?\n\nI went to see what Melvin Capital was holding and what I would liquidate if I was in such a crunch. They seem to have quite a few EXPE calls that are could be deep in the money, they also appear to own approximately 5% of EXPE's shares and 5x of it's average daily volume. As a best guess, they are up 40-50% on this position, so it might be one they would close to cover - and could possibly cause a selloff as a result. They also own a fair amount of FISV and FISV calls, but figure they'd liquidate the calls before they sell any shares. There are a couple other positions I was looking into but wasn't sure it was worth my time.\n\nHowever, other than puts, I did not see a short position listed on on the information I was getting (I just googled Melvin Holdings and checked the first site that didn't charge me to see some of the info from a 9/30/20 13F). Is there some place to confirm MC has short positions and not just puts? Is this a complete waste of time, or is a sell off probable for those that get caught with burnt shorts? Lastly, are there any strategies that would likely be used by a company like MC that would indicate which positions they might close (i.e. FIFO, biggest gain, worst performing, whatever would likely affect prices the least, etc) that might not be something a WSB moron like myself might be aware of?\n\nTLDR: Should I spend time trying to find stocks that might sell off as a result of GME shorts losing leverage as the squeeze takes place, and if so - any recommended (preferably free) websites for accurate information that an ignoramus could use?\n\nPositions: 167 GME shares, 1 short 1/8 $28 C, a couple random GME straddles in the $20-34 range with exp between 1/8 & 7/16, 2 long 7/16 $30 C",
        "title": "GME Short Squeeze Additional Plays",
        "created_utc": 1610497394.0,
        "upvote_ratio": 0.83,
        "num_comments": 25,
        "author": {
            "name": "Relton81",
            "id": "3b8ak6sf"
        }
    },
    "kw3o3o": {
        "score": 572,
        "selftext": "&#x200B;\n\n[WSB autist assaulted by actual investor content, 2020 colorized](https://preview.redd.it/lci82g6poya61.jpg?width=1280&format=pjpg&auto=webp&s=cc7d19de2249c6c8215675b9de05bc8bc7dcd09d)\n\n# My Problem:\n\nLike most of you retards, I need my financial biases pre-digested so it slides into my brain like a well-lubricated shit. No wrinkles please. Just looking at a 10-K my grey matter shrivels like a raisin and I don't like it. I come to WSB for those low hanging tendies, but your ugly-ass wall of text DD gives me brain constipation.\n\n# How DD should look:\n\nFor the love of the intellectually deficient, **use formatting** to make your posts equal opportunity for the non-savant autists in the crowd. Visual clarity makes my dick hard.\n\nI invest like a lobotomized magpie with currency incontinence. If your post doesn't have a **big shiny ticker** with a **clear call to action**, I'm just going to perch on the next meme stock post and shit on the gay bears as my ignorance reaps blissful returns. Because my rabid attention span jumps around like a coked-up kangaroo, **use** **bold words** so that I can skim and don't have to stretch my brain around comprehending complete sentences. \n\nBecause I am financially illiterate, when you say \"technical analysis\" I hear Tech, $NKLA, and anal cysts. I'm confused. I hurt myself in my confusion. I choose $NKLA. Bad call. For proper direction, I need a big ass arrow and in a three to fours words description, **tell me where to allocate my two brain cells.** \n\nI've never read a fucking annual report cuz no body got time for that, so if you can't deliver it to me in iconography like the dark ages peasant I am I'll just get my gambling fix from someone with more **🚀🚀🚀🚀🚀🚀🚀🚀**\n\n# Example:\n\n**Big Shiny Ticker:** $GME\n\n**Action Step:** Buy shares/calls before EOW\n\n**Noodle over:** Puts expiring = prices up  **🚀🌕** \n\n[Stonk arrow go up](https://preview.redd.it/5xfnzjibiza61.png?width=1033&format=png&auto=webp&s=09420dea7dc62e412a6c03a45a38a3ea2d0fe92e)\n\n&#x200B;\n\n# TL;DR:  \n\nhttps://i.redd.it/7ql72u6nrya61.gif\n\n**Positions:**\n\n  \nGME  - 1/29 - 20.5c\n\nMT - 6/18 - 28-30c\n\nCLF - 7/16 - 20c\n\nKMI - 6/18 16-20c\n\nPSTH\n\nRTRD - yes",
        "title": "To all the DD posts with a wall of text",
        "created_utc": 1610494298.0,
        "upvote_ratio": 0.97,
        "num_comments": 71,
        "author": {
            "name": "unnovator",
            "id": "10myne"
        }
    },
    "kw3buz": {
        "score": 0,
        "selftext": "Aight, I've been semi-successfully trading GME (and some MRNA) since November 30th 2020. Here's a list of trades [https://docs.google.com/spreadsheets/d/1cZ2rNqW123eTj7rapyWNWC-zHEaLs79njlHEIJRY1\\_U/edit#gid=199204529](https://docs.google.com/spreadsheets/d/1cZ2rNqW123eTj7rapyWNWC-zHEaLs79njlHEIJRY1_U/edit#gid=199204529)\n\nMy ROI from swing-trading over the last 45 days is almost 50%. Small peepee, I know, but gains is gains.\n\nIf I just kept adding more GME shares to my portfolio over the last 45 days (buy and hold), my ROI would be less than 15%.\n\n***I don't know about you, but I want 50% more money, not 15% more money.***\n\nSo, if we ignore the short-term taxes (pain in the ass), there's a case to be made for ***some*** swing trading AKA paperhanding. Especially with such an obviously manipulated stock like GME (no doubt it's getting suppressed. Fuck Melvin. Fuck BofA.)\n\nBut, it gotta be done smartly. Let's quickly go over some examples\n\n**SCENARIO 1**\n\nMonday, January 11 2021 - the awesome news of Daddy Cohen joining the Board of Directors, paired with the really meh holiday sales report was an obvious signal the stock is gonna experience some drastic moves. We all know what happened - solid volume, but we slammed into that $20.6 wall, then we took a few steps back only to get stuck at $20.5 again and then it was over. Solid 12.7% green day in the end.\n\nBut, nobody really knew what was gonna happen, before it happened. This is the time where you 💎👐, because there's way too many variables to predict where the price will go and where it will end. if it goes $2+ up, you don't sell, if it goes $2 down, you don't sell. Just hold and let the dust settle. Stonk will eventually go up anyway, so no need to rush anything.\n\nI personally held 312 GME bags since December 31 - that's a lot of painful red days before yesterday for me.\n\n**SCENARIO 2**\n\nToday, Tuesday, January 12 2021 - Not the best day for 🧻👐 swing trading, but pattern got established early on... After getting rejected at $20.6 and $20.5 the day before, [it didn't even manage to break $20.4 today](https://prnt.sc/wm5r8u), then it was [followed by the $20.25 ceiling](https://www.reddit.com/r/wallstreetbets/comments/kvwpxg/gme_autists_preparing_to_break_the_2025_ceiling/). I sold at $20.17 (bought at $19.01 on December 31, remember?). The price was pretty bouncy after I sold, but volume was low, so the price wasn't moving up or down too much despite big swings in RSI. Therefore, I concluded it was not gonna fall much below $19.78 for the rest of the day. It fell to $19.73 IIRC, but I bought at $19.78.\n\n***Without spending a single extra cent out of my own pocket, I now own more GME shares than at the start of the trading day.***\n\nTomorrow, I will observe if the price upswing gets rejected again and look to sell at $20.3, maybe $20.4, immediately in the first trading hour after market opens. Then, I'll watch and see if we get a massive sell off like today and buy the dip.\n\nIf the price upswing doesn't get rejected, instead it continues climbing above $20.4 and breaks the $20.6 wall tomorrow, I will not sell, instead I will 💎👐. However, unless we get some good news, tomorrow will probably be meh like today.\n\n**SCENARIO 3**\n\nMonday, January 4 2021 - You're an idiot like me and you buy at $19.01 on December 31 2020. Come Monday, the price plummets all the way down to $17.1 or whatever it was. Red day, bloody as fuck. Do you 🧻👐, or do you 💎👐?\n\nThe answer is obvious, ***you wipe your ass with diamonds until your ass and the shit coming out of it bleed as well.***\n\nThat's what I did. It hurt. But I didn't sell, I held. Reward finally came today when I sold for a decent profit, and then used that profit to buy the dip.\n\nMore shares, more gains.\n\nPOSITION: europoor 318 shares at $19.78 as of today\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🌒",
        "title": "Know when to 💎👐 and when to 🧻👐 your GME shares!",
        "created_utc": 1610493241.0,
        "upvote_ratio": 0.45,
        "num_comments": 47,
        "author": {
            "name": "RandomYouTuber69",
            "id": "7q7xktrk"
        }
    },
    "kw1ky0": {
        "score": 501,
        "selftext": "Short interest for 12/31/20 is 71.2M up from 68.13M. I'll repeat it again like I have for every bi-weekly update done since I started this. These  🌈 🐻 haven't covered jack shit. These  🌈 🐻 naked shorted GME after hours on Dec 8th and haven't covered at all. Every single big rally you saw was buyers stepping in, none of it was any major players covering.\n\nShort squeeze hasn't even BEGUN. If [this is true that the outstanding float is only 27.2M then holy shit. How does one even unwind from their short position at 260.9% SI to float](https://www.reddit.com/r/wallstreetbets/comments/kvrucg/gme_float_position_actually_27_million/). With Daddy Cohen here to stay, I'm no longer here for just the squeeze, I'm here for the long term tendies. Cohen going to be the next Elon.\n\nI can tell you them gay CNBC boomers are jealous and don't want to jump into this yet because it'll prove that we autistics are better than they are at picking winners, but worry not. When GME  🚀  🚀  🚀  to 69420.69$ they'll fomo into that like they're doing now in TSLA.\n\n🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀",
        "title": "GameStop GME Short Interest Update for 12/31/20",
        "created_utc": 1610488078.0,
        "upvote_ratio": 0.96,
        "num_comments": 170,
        "author": {
            "name": "veryforestgreen",
            "id": "2ajnv0"
        }
    },
    "kw1j7a": {
        "score": 125,
        "selftext": "**TLDR: BBBY missed earnings estimates, but if you listened to the earnings call, metrics and guidance are much better than shorters say.  The stock is poised to rally back to october highs with guidance, buybacks, and a SHORT SQUEEZE**   \n\n\n* **Short interest is still extremely high at 76% and earnings were honestly strong**\n* **Jim cramer - \"shorts are trying to control the price right now\" but he talked with the CEO and the company looks great**\n* **He thinks it has much more room to grow and is AMAZING value**\n* **150 million in buybacks coming before february 29th**\n* **strong guidance from earnings**\n* **Bigger stimulus from biden**\n* **YoY growth was HUGE with a gain of .08 EPS vs -.38 EPS last year**\n\n**Buybacks:**\n\n**With an accelerated repurchase program, BBBY is buying back 150 MILLION dollars in shares (7 million shares) before February 27th.**  \n\n**Strong earnings and buybacks will kill shorts over the next month, and BBBY will continue climbing.**\n\n**\"Failed\" Earnings:**\n\n**Here's an excerpt from the \"failed\" earnings calls that shorts want you to believe was horrible**\n\n**Mark Tritton:** \n\nSimply put, we're delivering on what we said we would do. We said we would put a team in place that would have the right talent and expertise to execute our new vision and inject new ideas and that we will create the right organizational structure to facilitate more streamlined decision-making, and we've done that. We said we would lean into the digital space and make it easier and more convenient for our customers to shop with us, and we are doing that. We said we will reset our cost structure, modernize for growth, and refine our organization, and we've done that and continue to focus on gross margin improvement.\n\nWe said we had a clear mandate to reestablish our authority as the preferred omnichannel home destination and that we would use customer-inspired and market insights to develop our new customer value proposition, and we are doing that. We said we would evaluate our asset base and how best to optimize its value to the business on a go-forward basis, and we have done that. And finally, we said our mission is to ensure that Bed Bath & Beyond is well-positioned for long-term success, and we're doing just that. \n\n**- EBITDA up 300% YoY**\n\n**- Digital sales up 69%**\n\n**- Debt lowered**\n\n  \n**BBBY gives me GME vibes after earnings. Belittled by shorts before it moons.**\n\nThe stock still has tons of room to go. Christmas earnings and stimulus checks are coming and shorts are panicking. Ride this stock to 25$ or even higher   \n\n\n**Positions: 1000 shares, 25 Feb 19 C, 25 March 3/19 C**",
        "title": "The BBBY Short Squeeze Starts Now 🚀🚀🚀 Earnings were NOT a Disaster, and BBBY is about to BURN the Shorters with Buybacks",
        "created_utc": 1610487933.0,
        "upvote_ratio": 0.99,
        "num_comments": 87,
        "author": {
            "name": "scaling_gamer",
            "id": "8upm8tu6"
        }
    },
    "kw05rz": {
        "score": 56,
        "selftext": "Grabbed this data as part of my review and thought I'd throw it here for easy digestion.  This is showing Melvin Capital's put positions against GME logged on their 13F over time.  To be clear, this is not showing their short position as that is not required to be filled in the 13F.\n\n&#x200B;\n\nhttps://preview.redd.it/omlrjtrjpya61.png?width=249&format=png&auto=webp&s=ef8a865941eb819f965cff06cdc614064641f4a8",
        "title": "Melvin Capital - GME Put Positions",
        "created_utc": 1610483914.0,
        "upvote_ratio": 0.88,
        "num_comments": 28,
        "author": {
            "name": "Anonbowser",
            "id": "12hfd5"
        }
    },
    "kvwn3f": {
        "score": 274,
        "selftext": "This is going to be a quick example on only one ratio why GME is still undervalued and could theoretically be valued at $90 a share.\n\n\nLet's me start with this quote.\n\n \"Price to Sale (P/S) ratios between one and two are generally considered good, while a P/S ratio of less than one is considered excellent.\"  - [source](https://www.investopedia.com/ask/answers/032515/what-considered-favorable-price-sales-ratio.asp#:~:text=Price-to-sales%20(P%2FS)%20ratios%20between,can%20vary%20significantly%20between%20industries.)\n\nSo if we look at GME, it has a market cap of 1.4 billion.\n\nTo get a P/S ratio we divide market cap by 2020 Revenues (6.466 billion) \n\n1.4 / 6.466 = .21\n\nLike the quote says anything under 1 is excellent and anything between 1-2 is considered good so to get a P/S of 1 you get a market cap of 6.466 billion well if the market cap was 6.466 billion each share would be valued at $92 instead of the current price of $20.\n\nTo get a P/S ratio of 2 you would double that and the price would be $184.\n\nJust some info while we wait for more stuff to come from Cohen \n🚀🚀🚀🚀🚀🚀",
        "title": "GME P/S Ratio 🚀🚀🚀 to $90?",
        "created_utc": 1610473869.0,
        "upvote_ratio": 0.95,
        "num_comments": 96,
        "author": {
            "name": "jsmerrill95",
            "id": "6b2wp9kc"
        }
    },
    "kvrv7b": {
        "score": 688,
        "selftext": "**TL;DR** on the bottom unless you're into masochism cuz I took Adderall for this and it's long as fuck.\n\nI called GRWG, I called RAVN, now its time for me to take Mommy Cathie’s hand and lead my fellow WSBautists to the moon once more. KTOS makes rockets, and there's one with our name on it. 🚀\n\n**Quick Wikipedia Introduction:**\n\n&amp;gt;**Kratos Defense &amp;amp; Security Solutions, Inc**, (NASDAQ: [KTOS](https://www.nasdaq.com/symbol/ktos)), headquartered in San Diego, California,specializes in directed-energy weapons, unmanned systems, satellite communications, cyber security/warfare, microwave electronics, missile defense, training and combat systems.   \n&amp;gt;  \n&amp;gt;Customers include the U.S. federal government, foreign governments, commercial enterprises and state and local government agencies. Kratos is organized into six major divisions:   \n&amp;gt;  \n&amp;gt;Defense and Rocket Support Services   \n&amp;gt;  \n&amp;gt;Microwaves Electronics  \n&amp;gt;  \n&amp;gt;Modular Systems  \n&amp;gt;  \n&amp;gt;Public Safety and Security  \n&amp;gt;  \n&amp;gt;Technology and Training  \n&amp;gt;  \n&amp;gt;Unmanned Systems.  \n&amp;gt;  \n&amp;gt;Some of Kratos' newest products are part of a Pentagon effort to partner with innovators and incubate technology-focused businesses in Silicon Valley  \n&amp;gt;  \n&amp;gt;Kratos has primarily an engineering and technically oriented work force of approximatively 2,700 with a substantial number of the Company's employees holding national security clearances. Virtually all of Kratos' work is performed on a military base, in a secure facility or at a critical infrastructure location. [Source](https://en.wikipedia.org/wiki/Kratos_Defense_%26_Security_Solutions)\n\n**Why You’re Really Here**\n\n**October 8th, 2020**, ARK Investment Management LLC filed a 13F-HR form disclosing ownership of **558,726 shares** worth $8,733,000.\n\n**November 30th, 2020**, ARK Investment Management LLC filed a 13F-HR form disclosing ownership of **1,106,685 shares** worth about $21,337,000 USD—representing a 98% increase in shares and a 144% increase in value in under two months. GUH 🚀🚀🚀\n\nARK recently doubled their stake in KTOS, and they're are not alone in their confidence. \n\nSmart money loves KTOS, as illustrated by their 89.86% institutional ownership: \n\n* Blackrock has a 6.83% stake in the company at 8.3 million shares\n* Vanguard has a 6.55% stake at 8 million shares\n* Fidelity has a 5.36% stake at 6.6 millions shares. [Source](https://money.cnn.com/quote/shareholders/shareholders.html?symb=KTOS&amp;amp;subView=institutional)\n\nI'm no genius, and neither are you. But I have made myself good money riding the coattails of those with billions at stake and teams of researchers behind them.\n\nThat said, institutional ownership comes as no surprise as far as defense companies go. Instituions love to own them. They’re safe investments. The military's got deep pockets and smart money knows never to bet against America. \n\nHowever, Kratos is not just any old Defense and Aerospace company. There is a reason that ARKQ [added 153,098 shares to their fund just last week.](https://cathiesark.com/ark-combined-holdings-of-ktos)\n\n**Like GRWG, Kratos Defense and Security Solutions has spent the last ten years gobbling up their competition.** Six acquisitions and one merger later, the frequency of their contracts reflect their place as a leader in military tech development:\n\n* December 8th, 2020: [Kratos Receives $37.7 Million Skyborg Program Contract Award from USAF Advanced Aircraft Office](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-receives-377-million-skyborg-program-contract-award-usaf)\n* December 10th, 2020: [Naval Air Systems Command Exercises Option for an Additional $38.7 Million for Full Rate Production (Lot 2) of the BQM-177A Subsonic Aerial Target System](https://ir.kratosdefense.com/news-releases/news-release-details/naval-air-systems-command-exercises-option-additional-387)\n* December 21st, 2020: [Kratos Receives $17.8 Million Contract Modification Related to XQ-58A Valkyrie from USAF Research Laboratory](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-receives-178-million-contract-modification-related-xq-58a)\n* December 28th, 2020: [Naval Air Systems Command Exercises Option for an Additional $3.6 Million to Kratos for Contractor Logistics Support &amp;amp; Engineering Services for the BQM-177A Subsonic Aerial Target System](https://ir.kratosdefense.com/news-releases/news-release-details/naval-air-systems-command-exercises-option-additional-36-million)\n* December 29, 2020: [Kratos Awarded Contract Modification Valued at $22 Million to Provide Satellite Command and Control System Sustainment](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-awarded-contract-modification-valued-22-million-provide)\n* December 30, 2020: [Kratos C5IS Business Receives $10.5 Million in National Security Related Program Orders](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-c5isr-business-receives-105-million-national-security)\n* Januray 4, 2020: [Kratos Receives $11 Million Development Contract for Next Generation Satellite Program](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-receives-11-million-development-contract-next-generation)\n\nKratos’ acquisitions have allowed it to develop proprietary technologies that are sold as products. Not only that, but as many of the above contracts show, they are also being paid 🚀 buku bucks 🚀 to maintain and service the products and tech that they sell.\n\nBut ok yeah, sure, they produce: disposable missiles made for aerial target practice, small sUAS swarming drones, satellites, radios, and augmented reality simulation training systems and microwave electronics—but that is not what grabbed my attention and surely not what grabbed the attention of Cathie Ark. \n\nReady for the kicker? Say it with me now:\n\n**Ground Vehicle Automation**\n\n&amp;gt;The Kratos Multi-Platform Appliqué Kit (M-PAK) is the next generation of Ground Vehicle automation. The system can be used to quickly and easily convert your existing fleet of standard human-driven vehicles into optionally-manned systems that can be driven in manned or unmanned modes. M-PAK is a scalable system that can be used as a stand-alone vehicle mobility kit or sensors can be added to offer various levels of autonomy… M-PAK allows for a semi-permanent installation in a vehicle, which releases the user from committing to one vehicle platform or a particular vehicle.\n\nThese two developments are why Cathie bought up KTOS for ARKQ. These vehicle conversion kits also represent Kratos’ foray into the commercial space. Their ground vehicle automation kits, originally used to safely lead military convoys, are now used to man impact-absorbing trailers behind slow-moving highway construction vehicles. Up until recently, the job of driving the impact truck was filled by some poor employee. Now, with Kratos’ product, this job can be completely automated, with the GPS-guided computer safely trailing whatever work vehicle it is instructed to. [Source](https://www.kratosdefense.com/systems-and-platforms/unmanned-systems/ground/autonomous-truck-mounted-attenuator)\n\nBasically, you can turn any truck into a completely independently acting, simple, autonomous vehicle with the installation of this semipermanent kit.\n\n&amp;amp;#x200B;\n\n**Sea Surface Vehicle Automation** \n\n&amp;gt;Kratos \\[has also\\]developed a number of vehicle control systems that are easily installed and quickly convert most human-driven seaborne vessels to unmanned systems.  \n&amp;gt;  \n&amp;gt;The Kratos C2 is currently in use and supporting mission operations for the U.S. Navy and Army utilizing the High-Speed Maneuvering Surface Target (HSMST), which was developed in response to a requirement for a 40+ knot target to represent littoral threats encountered by the fleet and which would retain 35 kt capability in advanced sea states. [Source](https://www.kratosdefense.com/products/uav/land-and-sea/sea-surface-vehicle-automation)\n\nSo they’re making boat drones too. \n\nMilitarily, these unmanned sea surface vehicles can be used against seaborne targets and mine hunting. Commercially, the tech being developed by Kratos may have applications in cargo shipping, seaweed farming, and data collection.\n\n**Most Importantly**\n\nIn terms of the fundamentals, **tomorrow, January 13, there will be a virtual conference during which time they will be exhibiting some more of their new tech.** I believe that they will play into the recent EV/AI hype and focus on these automation kits and their potential foray into the commercial space. With some good media coverage, I think this could be a very positive catalyst for the stock. I tried calling investor relations to ask some questions, but they dubbed my calls. **Big dick energy. Bullish.** 🚀🚀🚀\n\n&amp;gt;President &amp;amp; CEO, Eric DeMarco, and its Executive VP &amp;amp; CFO, Deanna Lund, will present at the 23rd Annual Needham Virtual Conference on January 13th at 11:30am Eastern. [Link to webcast.](https://wsw.com/webcast/needham103/register.aspx?conf=needham103&amp;amp;page=ktos&amp;amp;url=https://wsw.com/webcast/needham103/ktos/2276742)\n\n**NOW ON TO MY FAVORITE PART: THE TECHNICALS!!!!!**\n\nVery simple, very bullish. Consolidation on an upwards trend. \n\n&amp;amp;#x200B;\n\n[MACD\\/RSI Bullish. Beautiful technical setup](https://preview.redd.it/uvhok3mnmwa61.png?width=2004&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=339ee0941d924979ad9345a82d07760a7693843f)\n\nBreakout above the channel and a retest of resistance becoming support. Super solid buy wall at around $25.69. Anything around these levels I would count as buying the bottom. Set a stop loss slightly below the support to minimize downside risk. \n\nThis morning January 12th, premarket action suggests a moon mission. They were [just awarded another 12 million dollar contract a few hours ago](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-awarded-127-million-task-order-complete-cost-optimized). \n\n**TL;DR: : With its powerful acquisitions, sticky government contacts, consistent revenue growth, institutional backing, THICC technicals and TOMORROW'S imminent positive catalyst, KTOS cannot go tits up. Not to mention Blackrock, Vanguard, and most importantly—Mommy ARK are on our side.** \n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n**Positions:**\n\n🦅(Cashed out of RAVN when my calls went ITM as I said I would). 🦅\n\nSome miscellaneous shit, the odd LEAP or whatever\n\nPLTR: 400 Shares\n\nGME: 400 Shares\n\nKTOS: 100 shares,\n\nKTOS: 25x Feb/19/21 $30C\n\nKTOS: 3x May/21/21 $30C\n\nEdit: yo we MOONING MOONING 🌝🌝🚀🚀🚀\n\nEdit: u/gunslingerx64 alerted us to a new article that just broke: \n\n“Elekta Awards Kratos Contract for FedRAMP Advisory Services” [Source](https://finance.yahoo.com/news/elekta-awards-kratos-contract-fedramp-210000594.html)\n\nEdit: u/BennyR72 brought this one to our attention [20 high performance drones and supporting equipment were just ordered by an overseas customer](https://ir.kratosdefense.com/news-releases/news-release-details/kratos-international-customer-orders-20-additional-high)\n\nEdit: u/molecular_crusade [took some great notes and takeaways from the conference](https://www.reddit.com/r/stocks/comments/kwkztn/ktos_and_its_bright_future/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nYOU DIRTY FUCKING ANIMALS WE’RE FLYING.🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "title": "Cathie Ark-Backed Tech Innovator Kratos Defense [KTOS] Will Moon After Tomorrow’s Conference. [Free Crayon Bonus Included] [THICC Fundumendals] 🚀🚀🚀",
        "created_utc": 1610458942.0,
        "upvote_ratio": 0.97,
        "num_comments": 495,
        "author": {
            "name": "The_Ron_Swansonson",
            "id": "15none"
        }
    },
    "kvrucg": {
        "score": 488,
        "selftext": "So unlike what Yahoo Finance will tell you (48 million shares in float) the real number is currently at 27.29 million shares. [See this link](https://www.gurufocus.com/term/FloatPercentageOfTSO/GME/Float-Percentage-Of-Total-Shares-Outstanding/GameStop-Corp#:~:text=GameStop%20Float%20Percentage%20Of%20Total%20Shares%20Outstanding&text=GameStop's%20total%20shares%20outstanding%20is,total%20shares%20outstanding%20is%2039.12%25.&text=As%20of%20today%2C%20GameStop's%20Insider%20Ownership%20is%2013.58%25.)\n\nWhy is this important? \n\nWell, this puts (haha) the 68 million~ shares shorted under quite a bit more pressure should they eventually have to start buying. And with all this momentum going on, they just might have to start closing those shorts. Uphill from here.\n\nTL;DR: Fun confirmation bias. 🚀🚀🚀😳🚀🚀🚀\n\nPositions: 1.1k shares.\n\nEDIT: Messed up on definition for float. Float would be ~87% of outstanding shares, or roughly 60 million (Restricted stock/Ryan Cohen's shares - Outstanding free-to-trade shares).",
        "title": "GME Float Position Actually 27 Million",
        "created_utc": 1610458859.0,
        "upvote_ratio": 0.96,
        "num_comments": 176,
        "author": {
            "name": "danielbauwens",
            "id": "6vd7d"
        }
    },
    "kvpptq": {
        "score": 465,
        "selftext": "Its Monday, 2nd August 2021. PLTR has hit 19 after trading in the low teens for months, while TSLA is now 3000 and steel companies have hit new ATHs. You've lost half your account on TSLA puts and PLTR calls. You don't have any steel stocks because the other half is in GME shares, bought at 20.50 since Ryan Cohen and his best buds joined the board of directors.\n\nBut apart from news of GME pulling out of ICR, there hasn't been any news from GME since January and its now trading at 12 bucks a share. You hear a noise behind and and turn around to see your wife and her boyfriend pointing and laughing at you before they go into her bedroom and close the door.\n\nDejected, you sell your GME shares and head over to [r/investing](https://www.reddit.com/r/investing/) to find some boomer stock that pays you 5 bucks a year in dividends.\n\nWhile browsing, you get a notification about a new tweet from Ryan, the man himself. Its a singular rocket emoji with a link to GameStop's website. Curious, you click the link.\n\n\"Gamestop is now pleased to announce that it is now the sole and official distributor of Corsair products, NVIDIA cards, and AMD CPUs. We have also partnered with Sony, Microsoft and Nintendo to be the only distributor of their games and consoles. We have developed technology to stop bots from scalping new hardware. With these new partnerships, GameStop will be the world's first and only company dedicated solely to gamers. Also we are the only official North American dealer for Nio.\"\n\nYou check RobinHood. GME has now exploded to 10,000 a share, Ryan Cohen has surpassed Elon Musk as the richest man on Earth and Mars, and you get a message from your dad apologizing for doubting you and how he can't wait to tell the family at Christmas.",
        "title": "August 2021.",
        "created_utc": 1610449800.0,
        "upvote_ratio": 0.86,
        "num_comments": 38,
        "author": {
            "name": "SuddenChampionship5",
            "id": "50vl7kjr"
        }
    },
    "kvm2wh": {
        "score": 875,
        "selftext": "I've made fun of so many of you GME autists. I sincerely apologize, and am more than willing to admit how fucking wrong I was. I should never have doubted you, and will be reaching out to everyone I made fun of in my comment history to apologize personally.\n\nu/DeepFuckingValue's post coupled with today's boomer stock news placing GME in almost all of their top 5 lists has finally convinced me to join the GME Gang. u/DeepFuckingValue is now my personal lord and savior, and through His saving grace, has allowed me to pray the gay bear away.\n\nGME TO THE FUCKING MOON BOYS, I'M GOING ALL IN  🚀🚀🚀 (Only 750 shares or so, but that's every dime I got. It took a lot of burgers to flip for that scratch).\n\nfake edit: I can't believe I am doing this. Will I wake up and still feel the compulsion to actually go through with it? Hold me to it, boys. Let's change some goddamn lives together.\n\n&#x200B;\n\n**RC APPROVED EDIT: DID IT BOYS!**  I just ripped the band-aid off, and it's already healed. I'm 60 shares short of where I thought I would be, but my Wendy's paycheck has 182 hours of overtime on it, so I'll be at 750 come Friday.\n\nScreenshot:  [Imgur: The magic of the Internet](https://imgur.com/a/2WODAnV)\n\nToday's history:  [Imgur: The magic of the Internet](https://imgur.com/a/jw8HJxD)\n\nFinal Portfolio:  [Imgur: The magic of the Internet](https://imgur.com/a/vqu3rtl)  A couple of notes. First, that Capital Prospect shit stock was a free stock I got yesterday by signing my wife up. I can't sell it for 2 more days, and it's really pissing me off. Proof this isnt a \"new RH account\" in the history screenshot. Second, You see that dip? That was me rape-selling everything. See that green line of prostate pleasure? That's all GME, baby.\n\nWSB AUTISTS, HEED OUR LORD'S CALL. SELL EVERYTHING, BUY GME. Fuck Melvin, fuck bears, fuck boomer stocks, and fuck my ASS WE'RE GOING TO BE RICH.  🚀🚀🚀🚀🚀🌙🌙🌙🌙🌙🌙🌙 GME is here, it's legit, and it's going straight up. GME Gang for life. Let's diamond hand this shit.\n\n# Wednesday Edit: Holy shit. ",
        "title": "GME Bear No More! GOING ALL IN TOMORROW, YOU COCKCLOWNS",
        "created_utc": 1610432365.0,
        "upvote_ratio": 0.97,
        "num_comments": 183,
        "author": {
            "name": "shallow-pedantic",
            "id": "cwgu3"
        }
    },
    "kvjjuo": {
        "score": 260,
        "selftext": "(For humorous purposes only. This is a shitpost, please excuse all factual inaccuracies and omissions)\n\n&#x200B;\n\n**$AAPL**: Cloud computing and SaaS are for nerds. Chinese ppl luv ifone, therefor Tim Apple go brrrrrr\n\n**$ACB:** Thank god $ACB came through just as you ran out of stimulus money and almost couldn’t afford edibles.\n\n**$AMD**: You picture SuBae during sex. Cathie who??\n\n**$AMZN**: “You never actually own $AMZN, you merely look after it for the next generation.” If you know, you know, if not you probably can't afford $AMZN.\n\n**$BA**: Boeing pleas fly. Literally.\n\n**$BABA**: WHERE IS JACK MA??!!?!?!!\n\n**$BB:** It’s 2012, and you’ve just discovered how to connect your Curve to your car with bluetooth.\n\n**$BRK.B:** “Scared money never makes money.” Scared, as in scared to tell your friends your account still hasn’t fully recovered from the COVID crash.\n\n**$DASH**: You have a list handy at all times explaining why we are not in a repeat of the dot com bubble.\n\n**$DIS:** Who knew betraying your childhood memories could be so profitable?\n\n**$F:** F\n\n**$FB**: You are just happy you don’t own $TWTR… right?\n\n**$GME**: You believe in the Squeeze like Seventh Day Adventists believe in the Second Coming. RC is God and DFV is His prophet, blessed be his tendies.\n\n**$GOOG**: You have a pet chameleon, or python, or some other cool but slow-moving animal.\n\n**$MSFT:** You are a boomer, but want to hang with the youths so you bought some LEAPS. No one thinks you’re cool.\n\n**$MT:** You are patient and still care a bit about fundamentals. You would honestly make a good “investor” if gambling wasn’t so much fun.\n\n**$MRNA:** $PFE HOLDERS HATE HIM! for making a better vaccine with this ONE WEIRD TRICK!!!\n\n**$NIO:** You liked Winnie the Pooh as a kid, but now have a nagging suspicion that he will snatch away your tendies like it’s democracy in Hong Kong.\n\n**$NKLA:** You are retarded, and have the clinical records to prove it.\n\n**$PLTR:** You have no idea what this company does, besides manufacture 🚀🚀🚀. There used to be a lot more of you…\n\n**$PLUG:** Something something gold rush, selling shovels, etc. etc.\n\n**$PTON:** For the fiftieth time, No, you did not mean Palantir. You wish it were summer 2020.\n\n**$PSTH:** You don’t like to take no for an answer, like when the co-founder of Stripe told you no, there is no deal with Bill SPACman.\n\n**$SPCE:** You’re really just waiting for the SpaceX IPO.\n\n**$TSLA:** At this point, you are either buying your third Lambo or selling your 2004 Corolla for a margin call. There is no in between. Remember, Elon giveth, and Elon taketh away.\n\n**$TWTR:** \\#Pray4TWTR\n\n**$ZOOM:** You belong here.\n\n&#x200B;\n\nEdit: Positions - MSFT, PLTR, CSCO, CMBM, TMUS, PFE",
        "title": "What Your Favorite $MEME $TONK$ Say About You",
        "created_utc": 1610422979.0,
        "upvote_ratio": 0.94,
        "num_comments": 82,
        "author": {
            "name": "ygao97",
            "id": "68omm0cm"
        }
    },
    "kvjbuk": {
        "score": 846,
        "selftext": "**Warning: Post contains dangerous amounts of numbers and options analysis. If you are a smooth brain stick to TLDR**\n\n**TLDR: Melvin bears are fuk when their 51000 FD puts expire on Friday**\n\n**Edit: If you have any criticism, please comment. I just like numbers so I can be wrong or not have the complete picture.**\n\n&#x200B;\n\nIn November u/ronoron, wrote an excellent DD detailing Melvin Capital Put positions on GameStop which you can read [here](https://www.reddit.com/r/wallstreetbets/comments/k3gn91/people_pumping_gme_melvin_capital_management/). He found that Melvin Capital held a short position of GameStop of 54,000 15 Put Contracts exp Jul 16 2021 equaling their disclosed short exposure of 5,400,000 shares on the [Q3 13F](https://www.sec.gov/Archives/edgar/data/1628110000090571820001111/0000905718-20-001111-index.htm) form.\n\n&#x200B;\n\n[Short Interest vs. Share Price](https://preview.redd.it/qpoz2i4agra61.jpg?width=3038&format=pjpg&auto=webp&s=544c69e831f419afc6cdf5f87853d57b2ac58225)\n\nSince that DD, GameStop has risen to a high of $23.35, Ryan Cohen increased his stake to 12.9% along with obtaining board seats for himself and Chewy CFO and COO. The Q4 13F form for Melvin Capital will be released on February 16 so their concise short exposure isn't public yet.\n\n[Melvin 13F Ending 9\\/30\\/20](https://preview.redd.it/di6hfhz0gra61.png?width=2576&format=png&auto=webp&s=dfb9dd25d1f1a6c9b53fc2f5584fbbcb4ea7d9dc)\n\nThrough the OI on the options chain we can get a decent enough picture of the institutional short positions and which positions Melvin Capital and other Institutions are likely holding. As of EOD Jan 11, the open interest on Melvin Capitals Jul 15p is down 88% to 620. We will see in their new 13F if they fully closed their position however after some further investigation, I believe they rolled their position to Jan 15.\n\nOn the 15 Jan 21 chain, there is significant open interest for the 24 put. Currently 51025 contracts are open which is a similar quantity to Melvins July puts. Melvin Capital is the only institution with such a large put position publicly disclosed.\n\n[\\\\\"Fuck your puts\\\\\" -JPow](https://preview.redd.it/kw0u0igljta61.png?width=1947&format=png&auto=webp&s=f6aa82e353606c84433e230fcc51842de185e823)\n\nSecondly, the lower strike puts (Under $10) have significant OI. There is a specific block of puts, strike 5-10, totaling 57155 in open interest. These strikes have disproportionate OI to comparable strikes and other expiration dates. Melvin Capital is retarded but they aren't stupid. To hedge their long put position of 15 Jan 24 puts, they would open up put debit spreads to cap their max loss and cheapen their positions.\n\nImportantly, their 24 Put FD's are decently fuk. Accounting for the average expected move, their position has an 81% chance of closing ITM. Overall those puts have been destroyed by GME's increase in value and theta decay depending on how long they have held these. If you remember Ryan Cohen just announced his board seat than Melvins position is looking seriously precarious. They cannot easily scape their position right now since they have gone all in on one strike which is significantly illiquid. Trying to sell would crater the bid/ask. They will most likely close out through a block trade with the MM that wrote the options. This way Melvin avoids the liquidity issue on the open market.\n\nAccounting for all of this, todays price action makes a good amount of sense. After the board announcement, the stock rose in PM over 21% briefly before getting crushed. Simultaneously, shares available to borrow on IBKR dried up from 45,000 to just 100 shares. Fidelity experienced similar action. As some commentators have mentioned, yes this is not a full picture of shares available to borrow and institutions have multiple avenues outside retail accessible desks to short. While not an exact view it is still a decent picture of short activity. If someone can see all the shares available through other desks, please comment.\n\nSomeone is going all in trying to keep the price down and it stands to reason it is Melvin, the only institution with FD puts and an underwater position. They have the capital to keep the price down for this week until their position expires and by no means face solvency issue.\n\nShort interest update will be updated tomorrow and I bet it is up bigly. All this selling pressure isn't coming from profit takers especially with such low borrowing availability.\n\nhttps://preview.redd.it/tpuciifxlta61.png?width=1232&format=png&auto=webp&s=23f0a371de79cffb21de32edce9d3249b87323a5\n\nThe most important factor here is delta hedging from whichever Market Makers wrote the puts for Melvin. Contrary to WSB belief, they are not out just to fuck over degens. They are supposed to be delta neutral to avoid conflicts with customer interest. This means they will hedge their short options positions with Delta\\*Contracts number of shares. For the week ending 15 January, the total hedging is disproportionately short at -8124390 shares. Those are all shares MM as an aggregate sold to neutralize their positions. MM's can't sell 8 million shares so they buy further OTM put positions to help neutralize their greeks. Significant OI lower on the chain supports this. Their position of short shares and long puts will be unwound when their short 24 puts are closed out. The significant overall negative delta hedging will cause upward pressure end of week depending on how many shares were sold. In most weeks the overall hedging is fairly even or positive delta (thanks to WSB buying so many calls) but the market is very heavy in puts this week.\n\n&#x200B;\n\nAll of this evidence points towards massive upside for next week. Melvins short selling pressure should be off and a significant degree of institutional buying should be expected as those positions are unwound. Melvin will presumably start unwinding any short stock positions after their puts are closed which will increase upward pressure. The shorts are more fuk than you would believe and if Melvins puts are worthless by Friday the top is blowing off.\n\n**Positions:**\n\nI'm not here to pump and dump any specific dates and strikes. The calls vs shares argument has been talked over a million times by smarter people. I have mostly shares after my Nov and Dec calls got wiped off the face of the earth.",
        "title": "GameStop: Melvin Capital Put Positions",
        "created_utc": 1610422206.0,
        "upvote_ratio": 0.98,
        "num_comments": 317,
        "author": {
            "name": "StarSwitch",
            "id": "58lkkbu7"
        }
    },
    "kvd5ae": {
        "score": 32,
        "selftext": "I am back this week with some really interesting data to share.  As expected the amount of stocks / contracts picked up massively from last week. For the expiration of 1/15/21 there were 838 contracts  and 1826 mentions of these contracts.  Compared to last week this is a huge jump and really something to talk about.\n\nFor those that are new here is a quick introduction: I have been analyzing comments and posts on reddit to determine what stocks/contracts are mentioned the most. This week I am looking at the options contracts that have been mentioned on the subreddits we track. Specifically, I am looking at contracts expiring this Friday 1/15/2021. The data collected for this analysis was collected from 1/1 – 1/8.\n\nThe goal here is to track what reddit is following and to see how reddit preforms. There is this notion that retail investors often fail to beat the market. This is why financial advisors recommend that you buy into the major ETF’s such as SPY. As historically there have been few people that manage to beat the major Index’s year over year. My hypothesis going into this week is that I should bet against the trends on reddit as typically the retail investor is wrong.\n\nCurrent Results: \n\n1. Week 1: +$1710\n2. Week 2: -$2610\n3. Week 3: +$45\n\nTotal: -$855 \n\nThough we are in the negative out of the 8 contracts our data suggested we sell 7 of them were profitable.  I think the loss so far is mostly attributed to position sizing, but thats something I will work on in the future. \n\nI just want to emphasize it does not matter if I am right or wrong. More importantly this research is to identify if there are any trends worth following. Please do not argue below that I am wrong or right this is research and I am sharing the results. \n\n# Call Data\n\n* Out of 838 Contracts 648 are calls (77% Calls)\n* 56% of the calls are out of the money\n* The out of the money calls are on average 25% out of the money\n* The in the money calls are on average 20% in the money (probably because of the huge pump last couple of weeks)\n\n# Put Data \n\n* Out of 838 Contracts 175 are Puts (23%)\n* 86% of the calls are out of the money\n* The in the money puts are 25% in the money\n* The out of the money puts are 29% out of the money \n\nJust based on the above data is is clear that reddit is leaning heavily bullish into the 1/15 expiration. \n\n# Most popular call contracts in the money\n\n&#x200B;\n\n|Date|Mentions|Strike|Ticker|Type|\n|:-|:-|:-|:-|:-|\n|1/15|22|700|TSLA|Call|\n|1/15|22|95|AMD|Call|\n|1/15|19|50|NIO|Call|\n|1/15|16|105|ARKG|Call|\n|1/15|14|60|NIO|Call|\n\n&#x200B;\n\n# Most Popular Call Contracts Out of the Money\n\n&#x200B;\n\n|Date|Mentions|Strike|Ticker|Type|\n|:-|:-|:-|:-|:-|\n|1/15|57|30|PLTR|CALL|\n|1/15|36|1000|TSLA|CALL|\n|1/15|30|40|PLTR|CALL|\n|1/15|18|55|DKNG|CALL|\n|1/15|17|30|GME|CALL|\n\n&#x200B;\n\n# Most Popular Put Contracts in the money\n\n&#x200B;\n\n|Date|Mentions|Strike|Ticker|Type|\n|:-|:-|:-|:-|:-|\n|1/15|3|140|SRPT|PUT|\n|1/15|2|65|PLTR|PUT|\n|1/15|2|30|PLTR|PUT|\n|1/15|2|300|BABA|PUT|\n|1/15|2|280|BABA|PUT|\n\n&#x200B;\n\n# Most Popular Put Contracts out of the Money\n\n&#x200B;\n\n|Date|Mentions|Strike|Ticker|Type|\n|:-|:-|:-|:-|:-|\n|1/15|7|100|DASH|PUT|\n|1/15|7|85|DASH|PUT|\n|1/15|6|20|PLTR|PUT|\n|1/15|5|35|CRSR|PUT|\n|1/15|4|25|LAZR|PUT|\n\n&#x200B;\n\nMy hypothesis is that the majority of these contracts will be losers. Based on the data I would be looking to sell the following:\n\n* PLTR 30 Calls @ $17 Premium\n* TSLA 1000 calls @ $500 Premium \n* CRSR 35 Puts @ $55 Premium\n* LAZR 25 Puts @ $35 Premium\n\nTLDR: GME 50 CALLS 1/15 are a lock",
        "title": "Weekly Update: Selling the most popular options contracts on Reddit 1/15 EXP",
        "created_utc": 1610402079.0,
        "upvote_ratio": 0.85,
        "num_comments": 15,
        "author": null
    },
    "kvcard": {
        "score": 554,
        "selftext": "We all know that the 🌈🐻s are calling GameStop (GME) blockbuster because the gaming industry is going digital away from physical discs, etc. However, these peak autistic retards (and not in the good way) think that our lord and savior Daddy Ryan (RC) has not addressed this issue. RC has indeed addressed this problem. In fact, that's where the ***greatest*** opportunity lies.\n\nFirst off, let me start with some speculation on where RC will be taking GME. There's a lot of speculation that GME will now become the Amazon of the gaming world as the one stop shop for all things gaming. Even if GME is unable to capture gaming sales due to the transition to digital sales, GME is still massively undervalued. GME's collectible business alone generated *737M* in 2019. Fucking action figures and shit. GME's market cap is roughly *1.35B.* Theoretically, GME running solely an online collectibles business would be undervalued right now. Don't forget, these  🌈🐻s are betting on *bankruptcy*, ie the stock going to 0. GME just needs to produce a sustainable business model to beat the shorts. Not only that, there's always going to be gaming hardware and supplies sales like consoles, controllers, headsets, gaming chairs. GME also sells TVs, monitors, gaming PCs, etc.\n\nFrom the holiday sales update, we saw GME's E-Commerce sales are up over 300% and now account for 34% of company sales. This is exactly what RC is looking for. GME is already involved in the digital sales business by selling digital games, digital subscriptions, digital gift cards, etc. If GME were to truly becoming a one stop shop for gaming, people would use GME instead of buying directly through their console or PC because while they shop for PS/Xbox games using GME, they can also shop for games for their PC, all while buying gift cards for their friends or purchasing gaming subscriptions like PlayStation Plus.\n\nBut here's the real reason why people will use GME for purchasing digital games. *Online trade-ins.* Say it with me, you beautiful retard. ***Online trade-ins.*** In RC's open letter to the board, he wrote:\n\n\" Significantly upgrading e-commerce can provide for greater revenue capture across larger gaming catalogs, digital content and community experiences, ***online trade-ins***, streaming services and Esports. \"\n\n[https://s.wsj.net/public/resources/documents/RC\\_Ventures\\_Letter\\_to\\_GameStop.pdf](https://s.wsj.net/public/resources/documents/RC_Ventures_Letter_to_GameStop.pdf)\n\nGME's highest margin revenue stream is physical disc trade-ins. However, if GME is able to create a digital ecosystem where its customers buy all their digital games through GME across all platforms (PC, PS, Xbox, etc), they would be able to trade in their digital games for store credit to buy new digital games. For example, if someone trades in a digital PS5 game, they could use that store credit to buy a PC game. This would keep customers coming back for the same reason people go back to GME today. Furthermore, RC addresses the move towards digital by specifically pointing out \"digital content and community experiences\" and \"streaming services and Esports\". Daddy Ryan is here to transform GME, not just make what it's currently doing better.\n\nPositions: 2000 shares at 18.64 (1300 purchased this morning after RC news), 1 LEAP ($25 strike, Jan 2023) - all positions purchased on margin like a true degenerate retard\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nTLDR: GME creates an online platform for customers to buy all their games digitally across all platforms (PC, PS5, Xbox, etc) and RC plans on giving customers online trade-ins for store credit to buy new digital games to keep them coming back.",
        "title": "For all the 🌈🐻 s saying GameStop (GME) will go bankrupt due to gaming moving away from physical discs to digital sales, Daddy Ryan has already thought of this",
        "created_utc": 1610399685.0,
        "upvote_ratio": 0.93,
        "num_comments": 217,
        "author": {
            "name": "j__p__",
            "id": "qgq6c"
        }
    },
    "kval5a": {
        "score": 34,
        "selftext": "The link that was posted here yesterday is now down: [https://icrinc.touchcast.com/showtime/icr-conference/embed/29ae0663-5b2d-e54d-5a8e-1f7af6dd404f](https://icrinc.touchcast.com/showtime/icr-conference/embed/29ae0663-5b2d-e54d-5a8e-1f7af6dd404f)\n\nAnd it's no longer on the GME Investor Relations page: [https://news.gamestop.com/events-and-presentations](https://news.gamestop.com/events-and-presentations)\n\nWhat is going on?",
        "title": "GME's ICR conference cancelled?",
        "created_utc": 1610394986.0,
        "upvote_ratio": 0.87,
        "num_comments": 34,
        "author": {
            "name": "j__p__",
            "id": "qgq6c"
        }
    },
    "kva682": {
        "score": 231,
        "selftext": "Josh Brown admitted that he reads us autists everyday on live TV but then proceeded to shit on us with his fellow boomer CNBC hosts.. Jokes on them, Tesla and Nio are up up 1000's of % while their boomer stocks are up 5%\n\nIve seen more million dollar gain porn this last week than ever before.. meanwhile Josh Brown is happy with 6% a year on his fund\n\nAlso GME is near a recent ATH.. get wrecked",
        "title": "Josh Brown step forward and collect your flair!",
        "created_utc": 1610393885.0,
        "upvote_ratio": 0.97,
        "num_comments": 32,
        "author": {
            "name": "AlexKarp2024",
            "id": "943eo53o"
        }
    },
    "kv82hx": {
        "score": 43,
        "selftext": "Ok so I thought that PRPL was dead months ago, now they are at an ath of 37ish. Talk to me PRPL crew, should I be interested in their short term future? \n\nThen you GPRO gnomes. I saw yall talking the last few weeks about, well, I don't know because I ignored you... talk to me boys. Are yall pumpn and dumping here or is there some real prospects for their short term future? \n\nAnd for the rest of yall watching your private lists, is there any other true poppers that we all are overlooking due to the shadows cast by the usual wsb hot picks? \n\nI think it's time we discuss non TSLA, NIO, GME, PLTR, stocks for a moment in this thread. \n\nGod speed retards 🚀🚀🚀",
        "title": "Surprise pop ups of today: GPRO and PRPL",
        "created_utc": 1610388099.0,
        "upvote_ratio": 0.88,
        "num_comments": 49,
        "author": {
            "name": "NothingTard",
            "id": "7kwo6rz5"
        }
    },
    "kv7mpp": {
        "score": 385,
        "selftext": "[https://assets.swoogo.com/uploads/798518-5fd216977c207.pdf](https://assets.swoogo.com/uploads/798518-5fd216977c207.pdf)\n\nSo if this agenda from ICR conference 2021 is correct, GameStop is no longer participating in the event this afternoon. Part of the reason why I think they pulled out last minute is because they don't want the bears to use this event as a catalyst for another manipulation attack on $GME.\n\nGME already got a big boost from the Ryan Cohen board of members announcement and holiday sales release. This was probably going to be covered during the ICR event but since they released this info already they probably didn't have anything positive to say during the event so they would be just repeating the same thing. Just based on the consensus of WSB retards, if they went through with the event it may discourage the hype that was built this morning and gay bears might attack the stock due to their put options expiring worthless this week. This is probably a 9001IQ play just to fuck with the bears. If anyone else sees this in a different view please comment\n\nEdit: Also, on iborrowdesk this morning the shares available to short was at 100. Yes fucking 100 shares left to short. right now it's at 10000 which is still very low compared to other days. https://iborrowdesk.com/report/GME\nIt's either the bears bought alotta shares trying to bank on disappointments from the event but now is fucked because GME canceled the presentation and is cover OR they are running out of bullets.",
        "title": "Gamestop is pulled out from ICR Conference and I Think I Know Why",
        "created_utc": 1610386854.0,
        "upvote_ratio": 0.95,
        "num_comments": 127,
        "author": {
            "name": "SnooWalruses7854",
            "id": "7y8qmrbe"
        }
    },
    "kv7k8k": {
        "score": 72,
        "selftext": "Has anyone noticed that GameStop no longer shows up on the ICR conference agenda? Not sure if this is worrying or not but take a look yourselves.\n\nThis link was posted here on Dec 27, it shows GME presenting at 4:30 on Monday under technology.\n\n[https://preview.redd.it/s4w3kdjuxk761.png?width=2680&format=png&auto=webp&s=69f1f373ed48de753c31a4a9a898f4d56ac39fdf](https://preview.redd.it/s4w3kdjuxk761.png?width=2680&format=png&auto=webp&s=69f1f373ed48de753c31a4a9a898f4d56ac39fdf)\n\nHere is the link to the current agenda that you can find on the ICR webpage today.\n\n[https://assets.swoogo.com/uploads/798518-5fd216977c207.pdf](https://assets.swoogo.com/uploads/798518-5fd216977c207.pdf)\n\n&#x200B;\n\nAdditionally, here is the link someone posted earlier to a live countdown. It no longer works.\n\n[https://icrinc.touchcast.com/showtime/icr-conference/embed/29ae0663-5b2d-e54d-5a8e-1f7af6dd404f](https://icrinc.touchcast.com/showtime/icr-conference/embed/29ae0663-5b2d-e54d-5a8e-1f7af6dd404f)\n\nPositions: GME shares and April calls.\n\n&#x200B;\n\nEdit: [https://news.gamestop.com/events-and-presentations](https://news.gamestop.com/events-and-presentations)\n\nNo longer on events calendar",
        "title": "Attnetion GME Gang: GME ICR Conference",
        "created_utc": 1610386663.0,
        "upvote_ratio": 0.88,
        "num_comments": 18,
        "author": {
            "name": "irnamson123",
            "id": "1mlv734y"
        }
    },
    "kv7bo0": {
        "score": 313,
        "selftext": "At face value, today was a great day for GameStop. However, upon a deeper look, its AN EVEN GREATER DAY for the long-term health of the business.\n\nLet's talk about the current board makeup. Including the 3 new members added today, there are 13 members on the Board. Now, as was indicated in the 13D, \"the Board will be reduced to nine members following the Annual Meeting\", which is in June 2021.\n\nHere's where it gets interesting. For a simple majority, there needs to be 5 members voting in a certain direction. Now, the 3 new members are obviously on Team Cohen. Who else?\n\nWell, we have Kurt Wolf,  Managing Member and Chief Investment Officer of Hestia Capital Management. Given his Hestia's history with GME, he is most definitely going to be on Team Cohen. That's 4/5. So who else? Well, we still have Carrie Teffner, a director who has been on the board since 2018. At first, not much to see. Former CFO of Crocs, who cares.\n\nWell, here's the great part. Before Crocs, she used to be the CFO of Petsmart. Who cares right? Let me ask you this. Who sold their business to Petsmart in 2017? You guessed it - YA BOY COHEN. Granted, she left before the business was sold. BUT, Petsmart had been looking at Chewy for years, and she clearly knows how good of an operator he is. That's 5/9. Game, set and match.\n\nSo there you go - a MAJORITY ON THE BOARD. Could things change? Sure. But this just goes to show how GME's long term health is in much better shape.\n\nOh, and one last thing:  🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n&#x200B;\n\nPosition: 4500 shares, \\~$3k in options",
        "title": "Deeper look into Ryan Cohen's strategic GME move",
        "created_utc": 1610386022.0,
        "upvote_ratio": 0.95,
        "num_comments": 54,
        "author": {
            "name": "ClassicJagLive",
            "id": "umzzkvc"
        }
    },
    "kv69t2": {
        "score": 289,
        "selftext": "See the most recent Gamestop press release of today:\n https://news.gamestop.com/news-releases/news-release-details/gamestop-reports-2020-holiday-sales-results\n\nUnder The header Fiscal Fourth Quarter 2020: \"It expects to realize positive comparable store sales results **and profitability**. \n\nThe above sentence seems to refer to the last quarter of 2020, of which the results are expected to be released this upcoming March. \n\nIf they have actually managed to turn a profit in the last quarter of 2020, for the first time since several years and thus coming back from a position of structural losses, WHILE THERE IS AN ONGOING WORLDWIDE PANDEMIC, that is in my opinion quite substantial news! \n\nThis means that even without Ryan Cohen (actively) involved management is steering the ship in the right direction!\n\nTL;DR: Tendies incoming, regardless of a squeeze happening or not🚀🚀!",
        "title": "Has GME just turned profitable again? 🚀🚀 Holiday sales numbers impression below!",
        "created_utc": 1610383087.0,
        "upvote_ratio": 0.96,
        "num_comments": 59,
        "author": {
            "name": "Kindness__is__key",
            "id": "675idsjb"
        }
    },
    "kv4knr": {
        "score": 514,
        "selftext": "&#x200B;\n\n[What's not to love?](https://preview.redd.it/wd804coyxpa61.jpg?width=1400&format=pjpg&auto=webp&s=6dbfef515b704e95e8bd3f1ed173adc788ef35f5)\n\n&#x200B;\n\nAlright GME Gang,\n\nThe haters are out in full force today, but remember that this is just the beginning. Think back to the numerous posts about RC and all the DD that was done. He has spent the past year cultivating and refining his personal brand with numerous articles for a particular reason and it's important not to lose sight of the long game here. The reason you love him so much is because of the halo effect that he's created.\n\n&#x200B;\n\nThe RC campaign bus is just leaving the station and if there's one thing RC has proven is that he has the ability to get big money on board. Outside of a handful of funds, there isn't really any big money in GME at the moment and now with RC on board, you can bet your ass that smart money is going to take a closer look. Don't sell yourself short, play the long game if you don't need the money and watch as RC reinvigorates the Gamestop brand with all his youthfulness. I really wouldn't be surprised to see him become ***the*** brand ambassador, making headlines and TV appearances. GME is going to be the story of 2021.\n\n&#x200B;\n\nRemember, there wasn't a whole lot to bet on with GME, but there's a hell of a lot to bet on with RC. Smart money is coming your way. Bears...watch your backs.\n\n&#x200B;\n\nTL;DR: Smart money will bet on RC turnaround. I'm on desktop so you'll have to imagine the rockets. \n\nPositions: 4,100 shares",
        "title": "Smart money will bet on RC and a GME turnaround",
        "created_utc": 1610378149.0,
        "upvote_ratio": 0.96,
        "num_comments": 158,
        "author": {
            "name": "thekittynati",
            "id": "6q0uroj7"
        }
    },
    "kv2qc0": {
        "score": 15,
        "selftext": " \n\n# GameStop Says Total 2020 Holiday Sales Declined 3.1%\n\n# GameStop Reports 2020 Holiday Sales Results\n\nGRAPEVINE, Texas, Jan. 11, 2021 (GLOBE NEWSWIRE) -- **GameStop Corp. (NYSE:**[**GME**](https://pro.benzinga.com/stock/GME#NYSE)**),** today reported worldwide sales results for the nine-week holiday period ended January 2, 2021 reflecting a 4.8% increase in comparable store sales and a 309% increase in E-Commerce sales.  Total sales declined 3.1% driven by an 11% decrease in the company's store base due to its planned de-densification strategy, temporary store closures around the world due to government mandates and lower store traffic, particularly later in December, due to the significant impacts of COVID-19.  The Company believes the industry-wide traffic decline during the Holiday period adversely impacted comparable sales for the nine-week period in the high single-digit to low double-digit percentage point range.  In addition, significant worldwide supply chain constraints impacted the ability to distribute products to customers across all sales channels.  However, the Company experienced unprecedented demand for recently launched gaming consoles, and while consumer demand far outpaced constrained supply in the nine-week period, the Company believes these products will drive sales well into 2021 as console availability from our suppliers improves later in the year.   \n \n\n**Holiday Sales (the nine-week period ended January 2, 2021 compared to the nine-week period ended January 4, 2020)**\n\n* **Total comparable store sales** increased 4.8% compared to last year and reflected a 29.6 percentage point sequential improvement from the third quarter of fiscal 2020.  These positive results were adversely impacted in the high single-digit to low double-digit percentage point range, as a result of a significant reduction in consumer traffic related to the increase in COVID-19 cases;\n* **Net sales** were $1.770 billion, a 3.1% decrease compared to 2019, as strong console demand was offset by store closures under the Company's planned de-densification strategy, temporary store closures mandated by local governments due to COVID-19, and industry-wide limited supply of new gaming consoles, and supply chain constraints broadly;\n* **E-Commerce sales**, which are included in comparable store sales, rose 309% and represented approximately 34% of total company sales, with total worldwide E-Commerce sales year to date reaching over $1.35 billion, far exceeding the Company's $1.0 billion growth objective;\n* **Regional Sales,** in Australia/New Zealand, where the Company's operations were materially less impacted by the effects of the COVID-19 pandemic, total comparable sales for the nine-week period increased approximately 31%, outperforming the Company's other operating regions.\n\nGeorge Sherman, GameStop's chief executive officer said, \"GameStop maintained its status as the omni-channel destination for gaming and entertainment with unprecedented demand for the new gaming consoles and a significant increase in E-Commerce sales.  Demand for the new generation of consoles remains very strong, and as a result, we anticipate the consumer's excitement for the new console technology will benefit us going forward well through 2021.  We reported a 4.8% increase in comparable store sales, including over 300% increase in E-Commerce sales reflecting demand for new consoles, continued strength for Nintendo Switch and our expanded gaming product assortment. While E-Commerce sales contributed approximately 34% of total sales for the first nine weeks of the fourth quarter, our sales growth progression also includes an adverse impact to comparable transactions related to the meaningful drop in retail traffic during the holiday sales season due to an increase in COVID-19 cases around the world.\"\n\nMr. Sherman continued, \"Overall, we remain confident in both the positive growth aspects for 2021 driven by our strategy to add new and exciting product revenue streams across all things games and entertainment and the strong demand for the new generation for console-based video game products  We look forward to executing on both of these areas in 2021 to expand our addressable market and product offerings supported by the many exciting opportunities to leverage our brand, extensive loyalty member base, and improving digital capabilities.\"   \n\n**Fiscal Fourth Quarter 2020 Outlook (13 weeks ending January 30, 2021)**  \n\n\nThe Company continues to focus on efforts that position it to manage through this unprecedented time, including maintaining its balance sheet strength, prioritizing the allocation of resources to areas of the business that produce strong cash flow, reducing expenses across the business, developing and expanding its digital strategy, and intensifying inventory discipline. Due to the uncertainty around the duration and evolving impact of COVID-19, the Company is continuing to suspend guidance, however, unless further unforeseen COVID-19 related impacts occur, it expects to realize positive comparable store sales results and profitability in the fiscal fourth quarter.   \n\nThe Company anticipates reporting fourth quarter and full fiscal year 2020 results in late March. \n\n**About GameStop.**  \n\n\nGameStop Corp., a Fortune 500 company headquartered in Grapevine, Texas, is a digital-first omni-channel retailer, offering games and entertainment products in its over 5,000 stores and comprehensive E-Commerce properties across 10 countries.  GameStop, through its family of brands offers the best selection of new and pre-owned video gaming consoles, accessories and video game titles, in both physical and digital formats.  GameStop also offers fans a wide variety of POP! vinyl figures, collectibles, board games and more. Through GameStop's unique buy-sell-trade program, gamers can trade in video game consoles, games, and accessories, as well as consumer electronics for cash or in-store credit.  The company's consumer product network also includes [www.gamestop.com](http://www.gamestop.com/) and Game Informer® magazine, the world's leading print and digital video game publication.\n\nGeneral information about GameStop Corp. can be obtained at the Company's corporate website. Follow u/GameStop and u/GameStopCorp on Twitter and find GameStop on Facebook at [www.facebook.com/GameStop](http://www.facebook.com/GameStop).\n\n**Cautionary Statement Regarding Forward-Looking Statements - Safe Harbor**  \n\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.  Such statements are based upon management's current beliefs, views, estimates and expectations, including as to the Company's industry, business strategy, goals and expectations concerning its market position, future operations, margins, profitability, comparable store growth, capital expenditures, liquidity and capital resources and other financial and operating information, including expectations as to future operating profit improvement. Such statements include without limitation those about the Company's financial results, expectations and other statements that are not historical facts. Forward-looking statements are subject to significant risks and uncertainties and actual developments, business decisions and results may differ materially from those reflected or described in the forward-looking statements. The following factors, among others, could cause actual results to differ materially from those reflected or described in the forward-looking statements: macroeconomic pressures, including the effects of COVID-19 on consumer spending and the Company's ability to keep stores open; the impact of the COVID-19 pandemic on the Company's business and financial results; the economic conditions in the U.S. and certain international markets; the cyclicality of the video game industry; the Company's dependence on the timely delivery of new and innovative products from its vendors; the impact of technological advances in the video game industry and related changes in consumer behavior on the Company's sales; the Company's ability to keep pace with changing industry technology and consumer preferences; the impact of international crises and trade restrictions and tariffs on the delivery of the Company's products; the Company's ability to obtain favorable terms from its suppliers; the international nature of the Company's business; the Company's dependence on sales during the holiday selling season; fluctuations in the Company's results of operations from quarter to quarter; the Company's ability to de-densify its global store base; the Company's ability to renew, terminate or enter into new leases on favorable terms; the competitive nature of the Company's industry; the Company's ability to attract and retain executive officers and key personnel; the adequacy of the Company's management information systems; the Company's reliance on centralized facilities for refurbishment of its pre-owned products; the Company's ability to react to trends in pop culture with regard to its sales of collectibles and dependence on licensed products for a substantial portion of such sales; the Company's ability to maintain security of its customer, employee or company information; potential harm to the Company's reputation; the Company's ability to maintain effective control over financial reporting; the Company's vendors' ability to provide marketing and merchandise support at historical levels; restrictions on the Company's ability to purchase and sell pre-owned video games; potential decrease in popularity of certain types of video games; changes in the Company's global tax rate; potential future litigation and other legal proceedings; changes in accounting rules and regulations; and the Company's ability to comply with federal, state, local and international law. Additional factors that could cause results to differ materially from those reflected or described in the forward-looking statements can be found in Exhibit 99.4 of GameStop's Current Report on Form 8-K filed on June 5, 2020 and in GameStop's Quarterly report on Form 10-Q filed on September 9, 2020 and other filings made from time to time with the SEC and available at the SEC's Internet site at [http://www.sec.gov](http://www.sec.gov/) or [http://investor.GameStop.com](http://investor.gamestop.com/). Forward-looking statements contained in this release speak only as of the date of this release. The Company undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future developments or otherwise, except as may be required by any applicable securities laws.\n\n**Contact**  \n\n\nGameStop Corp. Investor Relations",
        "title": "GameStop Says Total 2020 Holiday Sales Declined 3.1%",
        "created_utc": 1610372068.0,
        "upvote_ratio": 0.67,
        "num_comments": 7,
        "author": {
            "name": "andreic1",
            "id": "3oe8g9d5"
        }
    },
    "kuzprh": {
        "score": 205,
        "selftext": "Literally the worst thing you can do to your stock is sell it at its lowest because you are likely to miss out on future upturns, especially when this is the week for Cohen to announce his big moves (not really but I'm sure he'll file a form 4 this week since he has to if he's been buying these shares in the last 2 weeks) \n\nIf you don't believe me (fair enough I am on WSB) read this article by investopedia https://www.investopedia.com/articles/investing/021116/3-reasons-not-sell-after-market-downturn.asp\n\nThis stock is not going to be your friend who provides you with gentle comfort each day and quietly gets on with things. This stock is a friend who tells you that you're a lazy fuck and shouts at you till you get your shit together. It's the stock that makes you a successful bastard. \n\nIf you're on margin trim your position fine but then buy at any dip. If you're holding stock then good work 👊 and if you're on calls then maybe start seeing if you can exercise your stock this week to help push this stock further and get rid of these theta gang twats.\n\nThis rollercoaster is about to begin and you better hold on for your dear life because you'll never forget it 🚀🚀🚀🚀🚀\n\nPositions: stock @ 18.60 cost basis\n\nTLDR: Hands inside the vehicle please cos this motherucker is going all the way up\n\nEdit1: If you want a stock that could feasibly hit triple figures by end of 2021 buy a ticket for the ride and hold on tight and keep buying 🎢🚀\n\nEdit2: RYAN COHEN IS NOW ON THE BOARD!!!",
        "title": "For you GME paper handers 🖕",
        "created_utc": 1610359039.0,
        "upvote_ratio": 0.95,
        "num_comments": 58,
        "author": {
            "name": "SHoo98",
            "id": "50zvvyd7"
        }
    },
    "kuxmr9": {
        "score": 58,
        "selftext": "TLDR: SRPT 🚀\n\nOk, retards. So SRPT dropped 51% last week because they did not reach a main goal in one of their clinical trials. BUT this shit is normal for genomics and does not warrant a 51% drop. People got scared and sold and it’s looking to gain a minimum of 20% this week for a few reasons.\n1. The JP Morgan Healthcare conference is happening this week and they will be there. The major point of this conference is to get institutions to buy invest. During this conference they will show how it’s normal to not meet main goals and will show their pipeline success which means they will land new investors plus old will buy on discounted price. \n2. All genomics go through this. There will be goals not met through the process. What is mainly important is how successful their overall pipeline is and their future work. You can check it out on their website. All indicators are great.\n3. I invest heavily in this field and actually do research which is why I don’t throw my money at GME and PLTR to lose it.\n4. A company just doesn’t lose half its value because of one goal not met in one of many on going clinical trials. \n5. 🚀\n\nJust buy the stock and thank me later.\n\nEdit: forgot to add there’s another class action lawsuit filed on Jan 7th. This happened at the end of 2013, which they bounced back from really quick.\n\nEdit: CATHIE WOOD bought a shit ton of shares after the drop. And if you don’t know who she is just delete your accounts.\n\nEdit: apparently you retards don’t understand I bought after the drop 🤦‍♂️. And am imploring y’all to do the same.",
        "title": "Quick DD for who ever wants to listen and make you quick tendies",
        "created_utc": 1610349041.0,
        "upvote_ratio": 0.78,
        "num_comments": 82,
        "author": {
            "name": "Neveses",
            "id": "12peic"
        }
    },
    "kux8y8": {
        "score": 165,
        "selftext": "https://www.tradingview.com/x/uiiqdYve/\n\nYou’ve seen every post talking about Cohen and the GameStop employee’s opinion on how business is going, cool cool. However, y’all MF’s need to understand why the chart is bullish AF!!\n\n1.\tGolden Cross - 50MA (green) crossing the 200MA (red) up\n2.\tThe bottom is in, where do we go from here? MF UPPPP - that chart doesn’t show it, because I didn’t scroll back enough but it was on a downwards trend since Nov 2013. Then from Aug 2019 - Jul 2020 it was going sideways in an “accumulation zone”. Big money here was collecting all those shares from weak 🌈 🐻 paper hands. The accumulation zone is designed to break those hands and transfer those shares.\n3.\tTrajectory set to the 🌝 - GME started going up and then formed a beautiful upwards channel and we’re approaching the bottom support AKA THE YOLO BUY ZONE!!! \n\nAt the time of this post, price on GME is $17.69. Smaller time frames show that it could still go a bit lower, but I’m no bitch and I’ll start accumulating my shares early tomorrow and average it out.\n\nShort term price target at about $24 = 40% GAINZZZZZZZ\n\nLong term, 🌝 🌚 🌙 \n🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nSee you there you retards\n\nEDIT 1/11:\nhttps://www.globenewswire.com/news-release/2021/01/11/2156168/0/en/GameStop-Announces-Additional-Board-Refreshment-to-Accelerate-Transformation.html\n\nCohen announced on the board. Pre-Market is already above $20. Love when crayons and FA dock their dicks together\n\n\nEDIT 2 1/11: \nMy Position - $24C 4/16",
        "title": "GME On That Moon Shit 🌝 - Technical Analysis 🖍",
        "created_utc": 1610347368.0,
        "upvote_ratio": 0.93,
        "num_comments": 39,
        "author": {
            "name": "IDoItForTheScience",
            "id": "c3uq3"
        }
    },
    "kusng4": {
        "score": 726,
        "selftext": "So...I recently opened an E*TRADE account and after many...minutes...of some hard nosed research, I figured you idiots were onto something with the whole GME 🌚🚀🚀🚀 spiel that I put the vast majority into GME. In the few weeks since then, I’ve added a few more shares to average down a bit and am up to 420 shares. Yea weed.\n\nAnyway...I’ve seen other stonks I was going to choose go up 20-50% in the few weeks since choosing what play to make...and here I am, down $2/share. So...where we at? \n\nRockets ready for liftoff after ICR? Should I keep dumping my paycheck into more and more shares, because I’m the biggest idiot of all time? I just don’t know!!\n\n420 shares @ 19.62\n\n\nEdit:\n\nI prayed for rain and the tendies came to town! Good start to the day. I added a few calls and convinced my dad to put $5000 into GME. See you tonight at the ICR!",
        "title": "100% of my portfolio on GME because of you idiots",
        "created_utc": 1610330453.0,
        "upvote_ratio": 0.95,
        "num_comments": 272,
        "author": {
            "name": "CTJimmyJam",
            "id": "8daaeu0u"
        }
    },
    "kus6r6": {
        "score": 0,
        "selftext": "All you frickin autists who have no idea have been reading yahoo finance and shit to say that there is a 130%+ short interest in GME. I have spent a few hours looking into all this shit\n\n1. The short interest is like 60%. \n\nhttps://www.shortsight.com/short-interest-of-float-2-0/\n\nhttps://twitter.com/ihors3/status/1346561814956552193?s=21\n\n2. Legally, the passive investors have to recall their shares on a “material vote”, practically I think material isn’t defined. They didn’t recall their shares when there was a proxy battle between permit/hestia and the board. Only chance they recall their votes is if there is a go private, even then they might not. Not sure about this.\n\nhttps://www.marketscreener.com/quote/stock/STATE-STREET-CORPORATION-14499/news/Investing-Giants-Cede-Full-Vote-Power-WSJ-30755472/\n\nhttps://www.blackrock.com/corporate/literature/publication/securities-lending-viewed-through-the-sustainability-lens.pdf\n\n3. Don’t underestimate how long shorts can and will hold out. Look at Tesla. The passive investors DO have a handshake agreement as you can see in the blackrock PDF. Read the examples of Dell and Telecom Italia. Incidentally other \n\nThat being said, GME being taken private is still the key element to a short squeeze.\n\n$gme gamestop",
        "title": "The Real Short Interest of GME and other Details",
        "created_utc": 1610328813.0,
        "upvote_ratio": 0.31,
        "num_comments": 27,
        "author": {
            "name": "514link",
            "id": "5hfmz62u"
        }
    },
    "kuhaca": {
        "score": 860,
        "selftext": "I want to add to the GME backlash-backlash by explaining why I'll never sell my shares as long as Ryan Cohen is in. I'm a bit older than a lot of you weirdos, and us Gen Xers might have an extra perspective on the GME saga that I haven't seen mentioned that often.\n\nI remember **Pets.com,** and there's no reason why I should because I was busy going to raves and dropping E or whatever (i.e. studying). But I do remember it, because it was hard to miss. In 1998-99 it exploded as this dazzling symbol of everything that was vibrant and excitingly fucking totally mental about the dot.com boom. Amazon threw money at the startup, it had an enormous media presence and apparently a great online store, and it raised over $80 million on the NASDAQ (I looked at Wiki for that).\n\nAnd then Pets.com so entirely and rapidly collapsed that it became a laughing stock for years. FOR YEARS. The parody ad that was aired during the 2001 Super Bowl was only the start. I don't live in the US (we couldn't even buy from the company over here), but I remember everyone laughing their heads off over the mess that was Pets.com.\n\nAnd in the following years, when people were still wiping their eyes from crying or laughing at this god-awful lesson, Ryan Cohen was thinking about setting up.....a fucking online pet store. It should have been the last thing anyone would have wanted to touch. From my own limited DD, the granddaddy of US pet companies, Petsmart, had been a B&M store for about 15 years already, and the difficulties it experienced from 1996 meant it wasn't exactly a guiding light either.\n\nSo the 25-year-old Ryan Cohen decided to open Chewy and was abruptly - and logically - turned down by 100 investors. They smiled politely and ran a mile. But according to Cohen, he **'moved forward and never changed his business strategy'** despite having 100 doors closed in his face. Eventually, one of those investors got back to himself and cofounder Michael Day and said they liked the numbers and would throw a bit of money at the new company.\n\nCohen and Day proceeded to turn Chewy into a behemoth. Less than one year after being founded, Chewy had revenues of $26 million, though it was losing money, and then from 2014 to 2015 it grew from $205 million to $423 million, due to its focus on customer service and emotional connection etc. We all know about Petsmart buying the outfit for **$3.5 Billion** in 2017, only six years after starting up.\n\nThis whole story is the thing that sticks in my head, more than any hope of a squeeze or the likelihood of a slow, long turnaround under the current board.\n\nAnd Cohen's latest tweet about the roller-coaster only adds to my possibly demented thinking, because in his keynote speech he gave to the Florida Venture Capital Conference in 2018, he compared growing a business to having a child, saying,\n\n'It is a huge act of selflessness and dedication and if you are ready for it, **it is going to be a crazy,  crazy, crazy roller-coaster and it will be the journey of a lifetime.'**\n\nSo, to people looking at the excellent but pessimistic technical analysis, the gloomy outlook over the upcoming earnings and the conference tomorrow, and the hit pieces that are popping up at the moment like wildfire, you can shove them up your hole.\n\nRyan Cohen has a screw loose, and I'm betting on that beautiful screw.\n\n&#x200B;\n\n(Pos: ca. 300 shares @ ca. $17; not much, but everything's relative)",
        "title": "They'll have to prize my GME shares out of my cold, dead, perfectly formed hands",
        "created_utc": 1610295411.0,
        "upvote_ratio": 0.96,
        "num_comments": 192,
        "author": {
            "name": "BobNanna",
            "id": "3ek7edaj"
        }
    },
    "kugvqi": {
        "score": 87,
        "selftext": "[last week post](https://www.reddit.com/r/wallstreetbets/comments/kro81j/crayon_mania_weekly_addition_gme_tsla_amd_crm_gt/?utm_source=share&utm_medium=web2x&context=3)\n\n[upcoming earnings charts](https://www.reddit.com/r/wallstreetbets/comments/kqmsqo/crayon_mania_gme_tsla_pltr_amd_crm_nio_zm_and_dis/?utm_source=share&utm_medium=web2x&context=3)\n\nyou can look at my profile and check about section for my other profile and sort by best. \n\n# Positions: \n\n* CRM Mar 19 '21 $250 Call\n* AAPL Feb 05 '21 $133 Call\n* RKT Feb 19 '21 $30 Call\n* PLTR Jan 15 '21 $21 Call\n* AMD Feb 05 '21 $92 Call\n* GME Feb 12 '21 $17 Call\n\nLooking at adding TSM, and NVDA. I will wait for NIO and SPY to dip. \n\n# RKT\n\nLive chart:  [https://www.tradingview.com/chart/RKT/1eI21EWf-rkt-1-11-weekly/](https://www.tradingview.com/chart/RKT/1eI21EWf-rkt-1-11-weekly/)\n\nhttps://preview.redd.it/8kfmdgnc0ja61.png?width=3510&format=png&auto=webp&s=d3debfd8c26333bf9112b4f4301d2f77dc0a10fc\n\n# PLTR\n\nLive chart:  [https://www.tradingview.com/chart/PLTR/7Zq3cquM-pltr-1-11-weekly/](https://www.tradingview.com/chart/PLTR/7Zq3cquM-pltr-1-11-weekly/)\n\nhttps://preview.redd.it/rrpp7ubg0ja61.png?width=3510&format=png&auto=webp&s=5c3089d1a6d539e9b0313a081169cb7c17becd8c\n\n# NVDA\n\nLive chart: [https://www.tradingview.com/chart/NVDA/LZR4wpi6-nvda-weekly/](https://www.tradingview.com/chart/NVDA/LZR4wpi6-nvda-weekly/)\n\nhttps://preview.redd.it/e3sxqgih0ja61.png?width=3510&format=png&auto=webp&s=9c09b0021d56aa0a6193d9f787bb66cb75407176\n\n# CRM\n\nLive chart: [https://www.tradingview.com/chart/CRM/1sB2Wx7Z-crm-weekly/](https://www.tradingview.com/chart/CRM/1sB2Wx7Z-crm-weekly/)\n\nhttps://preview.redd.it/xalxvvln0ja61.png?width=3510&format=png&auto=webp&s=d14c26629799e94844f2524e4ffb493cb7fb0ef0\n\n# TSLA\n\nLive chart: [https://www.tradingview.com/chart/TSLA/2wUdRm5Y-tsla-weekly/](https://www.tradingview.com/chart/TSLA/2wUdRm5Y-tsla-weekly/)\n\nhttps://preview.redd.it/rfm9uu3p0ja61.png?width=3510&format=png&auto=webp&s=d17d31df6b7438c8fd921e56dc6080abc2d8176f\n\n# AMD\n\nLive chart: [https://www.tradingview.com/chart/AMD/NrjzfSqs-amd-weekly/](https://www.tradingview.com/chart/AMD/NrjzfSqs-amd-weekly/)\n\nhttps://preview.redd.it/ywznytvt0ja61.png?width=3510&format=png&auto=webp&s=092b30aa20a2c6bdc7c111dc1ce35781d912a6bb\n\n# AAPL\n\nLive chart: [https://www.tradingview.com/chart/AAPL/IuYT5ES6-aapl-weekly/](https://www.tradingview.com/chart/AAPL/IuYT5ES6-aapl-weekly/)\n\nhttps://preview.redd.it/2an443011ja61.png?width=3510&format=png&auto=webp&s=88dec3e21b2d85a2864accec693f83eaab4426ef\n\n# GME\n\nLive chart: [https://www.tradingview.com/chart/GME/rf7J3d4N-gme-weekly/](https://www.tradingview.com/chart/GME/rf7J3d4N-gme-weekly/)\n\nhttps://preview.redd.it/7or7uf121ja61.png?width=3510&format=png&auto=webp&s=672fe4246e73380b1b3bdf4f24c0d50d49edd221\n\n# SPY\n\nLive chart:  [https://www.tradingview.com/chart/SPY/kjQXaOOl-spy-weekly/](https://www.tradingview.com/chart/SPY/kjQXaOOl-spy-weekly/)\n\nhttps://preview.redd.it/5khn6um31ja61.png?width=3510&format=png&auto=webp&s=59db130ee21de009f93b94af5e70eb33b92a0cb8\n\n# NIO\n\nLive chart: [https://www.tradingview.com/chart/NIO/PVr1qlFw-nio-weekly/](https://www.tradingview.com/chart/NIO/PVr1qlFw-nio-weekly/)\n\nhttps://preview.redd.it/nied2am41ja61.png?width=3510&format=png&auto=webp&s=dee3b1f9e905b5c3b9fa99ceea35a84c7a210b0f\n\n# TSM\n\nLive chart:  [https://www.tradingview.com/chart/TSM/fnWaG0rP-tsm-weekly/](https://www.tradingview.com/chart/TSM/fnWaG0rP-tsm-weekly/)\n\nhttps://preview.redd.it/h0gt6vp51ja61.png?width=3510&format=png&auto=webp&s=c1382c9d49306e40827b50f39086983037203421",
        "title": "🖍️🖍️🖍️Crayon Mania🖍️🖍️🖍️_Week of 1/11_TSLA, GME, RKT, PLTR, CRM, AMD, NVDA, AAPL, SPY, NIO, and TSM or 4 dos dat kant red gooode 🚀🚀🚀👨‍🚀👨‍🚀👨‍🚀🚀🚀🚀",
        "created_utc": 1610294179.0,
        "upvote_ratio": 0.93,
        "num_comments": 56,
        "author": {
            "name": "napkins33e",
            "id": "h0rs2gt"
        }
    },
    "kuai0f": {
        "score": 120,
        "selftext": "Dear beloved GME gang, some of you might have read my bull erotica and although I'm not as chad as some of our dearest OG gme bulls, I'm afraid I turned bearish for the next few weeks. Here are a few reasons as to why\n\n1. Everyone expect positive news coming from the ICR conference, however, given that management has failed to excite shareholders in the past, we really shouldn't expect anything different. Someone else posted that RC is not expected to attend the conference so I wouldn't expect anything spectacular. Sherman and gang will probably repeat the same thing they said during the last earning call.\n2. We are also expecting console sales to come out this week, as  Uberkikz pointed out in his models, sales are likely not as strong as they should due to the ongoing shortage. Spoke with some random GME employee today and it sounds like shortages will continue until spring at the very least. This will hopefully just delay profits to later quarters\n3. MM /Dealer option hedging flows. This is IMO the most important reason as to why GME will dump. The below is a combination of tidbits of things I learned over time so take it with a grain of salt, but know this.:[https://charts.stocktwits.com/production/original\\_271543791.png](https://charts.stocktwits.com/production/original_271543791.png)yes I know it's from stocktwits, but this tells us something very important actually. Look at the overall put open interest. GME has a put/call ratio of 2.78,  total puts numbering at 19.359 million.  I've yet to see confirmed reports of exactly how much shares hedge funds like melvin capital actually shorted but I think the answer isn't as much as you think. Yes, they have bearish positions but they are executing on that with put options, meaning the actual short holders are the market makers themselves. (MM short shares as hedge based on delta of the puts they sold to these hedgefunds). If this is true this is gonna really fuck with our short squeeze thesis because MM has pretty deep pockets and they're not likely to be squeezed as they have  a huge margin, any expenses/loss they incur can be compensated for by selling high IV options, and quoting high bid-ask spreads on both options AND shares when transacting. I've been noticing that bid-ask spreads decrease substantially when we pump up into strikes with heavy put option interest and increase when we dump below those put strikes. Longs are getting double fucked by heavy put buying.\n4. Looking at point #3 but in more detail, the options positioning for next week looks bearish af. On the call side we have pretty much all YOLO 30c bought at \\~150% IV  + a bunch of other OTM calls. but on the PUT side we have concentrated 24P with OI of 51k, no doubt from our enemies at Melvin Capital. There is no question that all options are going to get IV crushed, the problem is that\n   1. OTM call getting IV crushed will lead to a dump due to MM selling the shares the bought for hedging (decreased IV on OTM calls = decreased delta hedging = dump)\n   2. ITM Puts getting \"IV crushed\" will lead to a dump due to MM shorting more shares (decreased IV on ITM calls = INCREASED delta hedging with short  = dump)\n\nSo yea, we gonna dump. Now before you retards go screaming to SEC about market manipulation, just know that we do this on a daily basis but with call options, driving shit up every day and getting stupid meme returns. This will be a long drawn out battle, and I suspect the GME squeeze might take much longer than anyone expect. Management will have to prove over time (hopefully soon) that they can turn the business around and generate consistent free cash flow, then one day be able to receive credit upgrades and reinstate dividends.  I hate boomer shit like dividends but it is my belief that dividends will actually cause a pump and short covering rally for the stock, because shorts are responsible for paying dividends.  If you look at historic short interest for GME, it pretty much went vertical when GME announced dividend suspension (check it on ortex around april - july 2019)\n\n&#x200B;\n\nAnyways, I think I wrote a bear erotica, but GME gang needs to understand this and if you're not ready for the long run you should GTFO. I REALLY HOPE I'M WRONG for next week. I really hope management can announce something exciting next week but the writing is on the wall for me. So I am making the following trades.\n\n1. taking profit on my april 20c\n2. Keeping my shares (small measley 500shares) but I'll be waiting for a pump on monday then sell ITM covered calls, then BUY ATM puts EOD monday.\n3. As someone else pointed out, there's a gap down from 16ish - 14ish. I'll be selling puts at the $13 range in the hopes that I'll be assigned those shares.\n\ngodspeed retards\n\nUpdate: You're free to keep your bull positions,  like I said, I could be wrong and I hope I'm wrong. In fact, if  you buy enough OTM (or ITM depending on IV) calls and pump us past 24 we'd probably start a huge rally.  But if you have shares you should probably hedge. If you got profit, nows the time to take some and re-enter at a lower price.  ",
        "title": "GME gang need to prepare for a possible bloodbath next week and a long drawn out battle over at least 3-6 months",
        "created_utc": 1610266040.0,
        "upvote_ratio": 0.76,
        "num_comments": 161,
        "author": {
            "name": "KYJELLYTIME69",
            "id": "87buwj2p"
        }
    },
    "ku4rfr": {
        "score": 39,
        "selftext": "You have all corrupted my mind. My perception of the outside world is now filtered through the lens of stonks. So naturally when this appeared in my advertisement inbox, I knew this had to be shared with my fellow self-proclaimed autists/retards:\n\nhttps://preview.redd.it/iqtb7uzhlea61.jpg?width=1036&format=pjpg&auto=webp&s=ccb6da014901b16a8cbaf11ddb1535e280e39019\n\nMy first thought after seeing this was \"fuck, I could outpace $29/year\". You'd only have to spend $145 a year? Easily done at BBBY.\n\nQuarantine still going on and can't make it to Ashleigh's wedding? Beyond+ sub.\n\nVirtual gender reveal for Carleigh's future POS kid? Beyond+ sub.\n\nKayleigh is about to go off to college for her first year of getting reamed by WSB autists? Beyond+ sub.\n\nAll no problem for BBBY Beyond+, now cheaper than using AMZN prime. And once quarantine is over people are about to go even harder for these exact life events. 100x more weddings, thousands of rona babies, and all the freshman about to fail out of college. Only a matter of time until we are back in the full swing of things and this subscription is fully utilized by the masses to \"save people money\" aka encourages them to spend more.\n\nEdit: Take a fraction of how many people subscribe to amazon prime (as of December 2019, there were an estimated **112 million** U.S. Amazon Prime subscribers). Maybe a million Karen's? Cool. That's an easy $29MM, now say half do the math and spend the $145 to recoup the subscription cost. That's an easy $72.5 MM. I know you have to subtract shipping but still. Shit ton of revenue and new e-commerce traffic.\n\nTL;DR\n\nBBBY go brrrrr with subscription 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 PLTR🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 GME 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "title": "FUCKED ON BBBY EARNINGS? WE WILL FLY AGAIN 🚀🚀🚀🚀🚀",
        "created_utc": 1610243564.0,
        "upvote_ratio": 0.84,
        "num_comments": 19,
        "author": {
            "name": "swadewade51",
            "id": "9972r8k1"
        }
    },
    "ku2fx9": {
        "score": 123,
        "selftext": "Sup retards? Here's my opinions, make your own decisions. \n\nSo I'll start with the TL;DR: Pot stocks are gonna 🚀💥🚀💥🚀💥 over the next 2 years and 2022/23 calls are future printers (or as early as 90 days) that even Elon himself will raise an eyebrow at. Decriminalization is just a layer of icing on a beautiful cake of banking reform. Also, Biden speaks on the same day Aphria presents at JP Morgan conference, big potential. Grab your helmet and HOLD the fuck on. 🚀💸🚀💸🚀\n\nOkay retards, let's talk about weed. First off, some have mentioned this, but nowhere near enough. Since the Democrats took the senate, the next HUGE catalyst for the marijuana industry is the banking bill, this may cause bigger spikes in stocks than even legalization, as that will get priced in over time as momentum builds towards full legalization. Will stocks go up the day it is passed, absolutely. But will they be Powell level printers? Probably not. More like those busted Bitch McConnell ones. Basically like Pfizer's lackluster performance after saving the world. It was already priced in. So I believe pot stocks will do the same over a period of time. Meaning, again in my opinion, the biggest catalyst for Marijuana is the soonest change we can expect from our new government. I really expect this to be as soon as February and as late as July of this year, for the banking bill. Calls out to 2023 are extremely cheap imagining the upside coming, but calls in July might as well be BOGO. Do your own research as far as what timeline you guess the Senate will take. I'll tell you it was said that It will be addressed in the first session. 🤑🤑🤑🤑\n\nAlso, imagine basically any major company being forced to grow with no reasonable access to capital and no access to common tax write offs that every other company gets to use. Can they find debt currently? Sure. But basically at rates that a \"subprime\" lender would get, and then some. Access to reasonable and competitive capital is gonna be a game changer and allow them to invest and expand into things that are working in preparation of national legalization. Also, depending on how it all shakes out it may allow companies like Canopy (CGC) to purchase Acreage (A deal already made.) Or even better, companies like Marlboro to purchase Cronos (again, already a deal). Both deals are contingent on federal legalization though. \n\n Any kind of renewed commitment to the M.O.R.E act or marijuana decriminalization from Biden would make stocks go on 🔥🔥🔥🔥🔥. Also, I expect Aphria's presentation to go well. Why? Well, other than being retarded, we have all been locked down for months. You really think stoners stuck at home are smoking less? No, 🐻🌈, they are not. They are smoking hella weed and playing hella video games. Weed stocks and GME Gang are about to do some Ricky Bobby slingshot shit when Biden locks everyone down thanks to Covid 2.0. 🚀🚀🚀🚀 Though, I have no positions in GME just to be clear. I pray for the MOASS to be bestowed upon you by Lord Cohen, but theres just no way marijuana stocks aren't %1,000+ gains just waiting on Senate approval for fucking blastoff. 🚀🚀🚀🚀\n\nSo, within the next 2 years, we can pretty confidently say we will have made huge strides for the marijuana industry under a vice president who was the senate sponsor for the MORE act, and a president who wants to make himself appear to fight social injustice. Those conversations are going to be hard to have without bringing up marijuana.  Also, a slow path to legalization would be decimation for the chances of small companies to compete considering the infrastructure and experience more established companies will have. Not many companies will be in a position to supply a meaningful amount to a national demand. \n\nIn summary for Marijuana moons: Marijuana jumps again on news of senate vote for MORE act, could jump also if  Papa \"Don't touch me there\" Biden renews any marijuana commitments, MOONS when MORE passes senate, jumps on news of full legalization talks, and finally baby moons again for legalization and starts a nice slow climb into the industry it is expected to be. There's going to be a lot of scaling and growth for quite a while after legalization to meet supply. Companies with experience doing this already are going to be in a much better position than newer companies just frantically trying to meet demand. \n\nWhich companies?? For me I personally like Canopy and Cronos. Why? Because I'm betting on Corona (Canopy) to do well with a cannabis product in a party/bar scene and Marlboro (Cronos) to do well targeting daily users. Marijuana may have been legalized in multiple states, but there's still barely any places for consumers to enjoy THC in a social setting regardless of what state you're in. There's massive business to be made here, once it is an option. Alcohol wouldn't be where they are today without bars. Regardless, just pick one, do what you can and I think there will be a pretty green number there very soon. 🤷 \n\nGood luck out there retards.",
        "title": "The Pot/Weed/Cannabis DD that WSB has been missing. Real roadmap to 🚀🚀",
        "created_utc": 1610235924.0,
        "upvote_ratio": 0.92,
        "num_comments": 141,
        "author": {
            "name": "OverwatchNWeed",
            "id": "5zesd4h3"
        }
    },
    "ktn5hj": {
        "score": 130,
        "selftext": "Everybody knows GME is going to the moon but only recently did I find the OG astronaut who’s been reporting details on GME moon status daily since forever ago: https://twitter.com/rodalzmann?s=21\n\nHe is one of us... he lives and breathes Ryan Cohen, and with his frequent DD updates, he discovers some recognition.\n\nReady for take off this week 🚀🚀🚀\n\nPositions:\n200 shares and 4/16 19c GME",
        "title": "GME Astronaut on Twitter",
        "created_utc": 1610180859.0,
        "upvote_ratio": 0.93,
        "num_comments": 60,
        "author": {
            "name": "spynman",
            "id": "b7atug"
        }
    },
    "ktj9hn": {
        "score": 80,
        "selftext": "What’s up GME gang. I know this week has been hard, but I think we all know this will pay off. Hopefully you all took this week as an opportunity to average down, if you got caught buying at $20 a share. Also I got my dad to purchase 1000 shares right before close, and he said I’m getting the belt if this goes tits up. But on to the important part...\n\nBasically I was browsing the internet, bored as shit with the markets being closed, and found this gem of a detail, that I was completely unaware of. I’ve been long GME, mostly because of daddy Cohen, but this is just one more reason why I’m 💎✋🤚s on this beautiful stock. \n\nThis news might be old, but as someone who looks at all the DD, I was surprised to see it. \n\nTo keep it short, (hahaha fuck Melvin) basically GameStop has a partnership with Microsoft, and gets a percentage of digital game sales, and other digital purchases, if the console was purchased at GameStop. That means that all these new consoles that just keep on selling out at GameStop, will keep generating revenue for years to come, even if customers don’t come and buy games. \n\nArticle: https://gamingstreet.com/hold-or-sell-gamestop-the-digital-shift-vs-a-new-microsoft-partnership/\n\nTL;DR GameStop can still capture digital sales through partnerships. \n\nAnd here are the necessary rockets: \n🚀 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nPositions:\n\n320 shares, price average 18.85\n\nCalls: 4/16/21 $30",
        "title": "An interesting fact about GME and the age of digital gaming (GME to the moon 🚀🚀🚀)",
        "created_utc": 1610164256.0,
        "upvote_ratio": 0.8,
        "num_comments": 22,
        "author": {
            "name": "PacBoiLar",
            "id": "526n3gbe"
        }
    },
    "kth9gp": {
        "score": 540,
        "selftext": "[https://twitter.com/ryancohen/status/1347585815984091136?s=20](https://twitter.com/ryancohen/status/1347585815984091136?s=20)\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nYeah I get it, we have had a rough and painful fucking week. Every orifice we have has been smokefucked relentlessly by Melvin and his circle jerk penises hiding in suits. It hurts, but the bleeding will stop. Now suck it the fuck up. It's time to pack some gauze and toilet paper. Put your helmets and retard safety gear on because Ryan Cohen has us swaddled in his arms.\n\nFor all you raisin brains working your double fast food shifts and lacking the time to watch Ryan Cohen's twitter like the fat kid eyeing the last 5 donuts in your Krispy Kreme box, I have your back.\n\nAs we all know, a great leader doesn't show face 24/7, but they do come around when you are bent over backwards getting pillaged into oblivion by Melvin's STD riddled uvula puncher in a dark alley behind a Waffle House. This time is no different. Our savior Ryan Cohen just told all you dimwit-fell-off-the-shortbus-smooth-brains to strap in for a \"fun ride.\" I went ahead and took a break from half chub jerking off to my friend's TESLA gains to reverse image search this high quality piece of treasure.\n\nMassive Membrane Ryan Cohen took some time out of his day to search roller coaster memes and found this one. We have been instructed to \"keep arms and legs inside the vehicle at all times\". This isn't just some numbing gel to soothe the pain of our torn open and prolapsed assholes. ICR conference is next week and I know some of you weak handed semen squirters hopped on the ride and chickened out at a fucking loss, right before it started. You left your dignity in the same bathroom that you threw your shit-stained underwear. We are gonna go on the ride of a lifetime with enough action that you'll finally have something relatable to tell your wife's boyfriend. It's one that will make your chump pump inflate so explosively that you'll feel a sharp tug on your butthole.\n\nYesterday was everyone but us (and PLTR, sorry guys). Today was Tesla swinging their nuts like vibranium reinforced wrecking balls, knocking every sell wall out like Mike Tyson KO'ing your crippled grandma over the last bit of Chicken Tikka Masala... and everybody else but us again. However, our time to shine is almost upon us. Our balls drop next week and you might even get your first erection. When this rocket starts blasting, you'll go from your first pube to filming your first consensual orgy in record time. (Thanks Melvin for making me point out the sex acts you've forced on us).\n\nFor all you cowards that sold out of GME today and made some money. I am still proud. Either hop back in with more than you had before or go make tendies elsewhere and be prosperous. For you other sperm suckers that sold out of GME today at $17.08 because you have weaker hands than a sleeping quadriplegic, I hope you like giving throat jobs at truck stops for pocket change. Lemme do you a favor, if you sold out of GME at a loss and weren't up EOD, don't hop back in or your toilet paper hands will dissolve as soon as this girl starts getting wet and you'll just lose money all over again.\n\nI know Melvin has done some damage and our assholes move like a blown sub and at this point, probably can't even hold in a fart. It's okay, sometimes making tendies causes grease fires and 3rd degree burns. If you want Melvin out of your guts, you better pull your head out of your own poopchute and throw up a \"Do Not Enter\" sign to prevent future mishaps.\n\nAt this point, I'm more excited to see Melvin capitulate into a ball of wrinkly old man writhing in despair and loss, than I am to see green dildos on my screen. Regardless LOAD UP THE FUCKING ROCKETS AND LIGHT SOME CANDLES BECAUSE IT SMELLS LIKE BITCH IN HERE. IF MELVIN WANTS TO STICK HIS ONE DROP WONDER PLUNGER INTO GME'S CHILI RING, P-UMP IT AND SQUEEZE THAT SHIT CLEAN OFF!!\n\n🚀🚀🚀🚀🚀🚀🚀💦💦💦💦💦💦👨‍🚀👨‍🚀👨‍🚀👨‍🚀👨‍🚀🎢🎢🎢🎢🎢🎢🎢🎢🎢🎢🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nAlso, for the last 10 times I tried to post this, it got blocked by some anti-evil bot and I've had to go back through and censor the more vulgar parts of my post. It doesn't matter because you idiots can't read anyways. Puts on reddit.\n\nEdit 1)  First off, I have tried to post this since noon. I found that the automod was blocking the word \"quickcl0t\" of all the words in this post, which, surprisingly, took me forever to narrow down. It was initially supposed to be \"pack some gauze and quickcl0t\" but toilet paper had to suffice. I suppose it was triggering some sort of call to vi0lence bullshit so it took me forever to find out what was wrong and get this thing approved. Secondly, [/u/zjz](https://www.reddit.com/u/zjz/) and his VisualMod bot smacked me with using the banned ticker \"p-ump\" so that's why that shit looks stupid. Sorry this shit is late, I wanted ya'll to have it earlier, but fighting Melvin and reddit is a full time job. ",
        "title": "Ryan Cohen's Roller Coaster 🚀🚀🚀🚀🚀🚀",
        "created_utc": 1610157107.0,
        "upvote_ratio": 0.97,
        "num_comments": 138,
        "author": {
            "name": "jbro12345",
            "id": "n4cs6"
        }
    },
    "ktbvv1": {
        "score": 198,
        "selftext": "* Elon chan has supplanted Bezos as the richest bro in the universe. This makes all quants who kept yapping about how TSLA pricing action via option gamma squeeze will subside once it's included in S&P screech in horror. Who knew the meme stock can continue its action unabated? TSLA hits ATH almost everyday this week, closing Friday up 7.84% to $880. Unreal.\n\n* For a succinct difference of Elon chan's prowess vs Bezos, refer to chart below:\n\nElon | Bezos |\n:---------|:----------|\nHot [goth gf](https://i.pinimg.com/originals/3a/f1/d6/3af1d61d443906cb37f5ef92d34412b1.png) who will do kinky shit for him | Traded hot milf for botox lady so he can have dirty shit done to him |\nRegularly flies astronauts to the fucking space station with his rockets that can fucking land themselves | Have to keep selling AMZN shares to fund his shit space company that's still dicking around with suborbital flight |\nTalks about new gigafactory and everyone wants to give him sick tax breaks to build in their city/state | Shops for new second HQ to give high paying white collar jobs but AOC and gang gets up on his ass in asking for tax breaks |\n\n* Morning economic numbers: nonfarm payrolls once again looking terrible, with consensus at about 50k increase but instead saw a -140k Dec. This ends a 7-month streak of steady gains in recovery. No worry fam, if you've lived thru March 2020 lows you'll know that market doesn't give a fuck about employment #s until you go all-in on calls. US reports more than 4k covid deaths for the first time ever - refer to above on why market doesn't give a fuck.\n\n* Flurries of behind-the-scene political actions are happening as the country moves on from Y'all Qaeda's storming of the capitol. A number of high-level admin officials from policy advisors to cabinet members have bailed the sinking ship that is this current administration. Chatters of invoking 25th amendment. Second impeachment. POTUS has stated that he will NOT attend the upcoming inauguration (who knew he's a gdamn snowflake?), after finally putting out a statement that an orderly transition will occur. \n\n* Psuedo-SJW social media companies and platforms have banned POTUS in tandem, conveniently doing so after the Dems have clinched both chambers of Congress and will likely sit on committees regulating them. No real movements from these actions yet, though TWTR is pulling back after it banned POTUS for 12 hours until he deleted the offending Tweet. TWTR closed the day down -1.62% to $51.48, after an intraday low of more than -2%.\n\n* BA got a slap on the wrist with a 2.5 bil fine from the DOJ for killing non-Americans. About 10% of the fine goes to the US govt while about 500 mil goes to the families of the 346 people that died in the two 737 Max crash. Remaining (70%) amount goes to BA customers because let's face it, corporations are truly the ones really hurting. BA closed down -1.32% to $209.\n\n* It's a solid day for many Chinese ADRs as as BABA and TCEHY escape Treasury's list of delisting stonk. BABA closed up 4% for the day at $236 while TCEHY closed up 5.61% to $76.89. NIO, the TSLA of China (or is it XPEV? or LI? find out in 1.5 years!) closed up big at 8.55% to almost $59, despite offering to sell 68m more shares last month at $39. Surely the US market isn't going to be China Hustled.\n\n* Today's big movers: DDD and PLUG continues their wild rocket moves to the stratosphere as strong market sentiment continues. DDD closed up 2.48% to $23.54, after touching an intraday high of almost 10% earlier. PLUG closed up 13% to $53.78.\n\n* PSTH, Ackman's brainchild SPAC flew almost 12% today on ZERO news but faded towards end of the day. PSTH gang collectively jizzed and made a mess of themselves. Will it be Stripe? (it's not) Chick-fil-A? (it's not) Bloomberg? (eh they sorta denied it) Subway? (please god no). Find out eventually sometime Q1 2021 as Bill continues to edge us. Seriously Bill, announce something amazing already because I'm up more than 20k on zero news and I'm tempted to sell. PSTH closed up 7.24% to $29.32.\n\n* In WSB meme stock land, a new law is being formed where none of these gdamn stock can go up together on the same day. PLTR faded to flat of 0.80% after being up more than 3% during early mornings, whereas GME and MT both fade some more today after a decent run-up attempt this entire week. GME close the day down -2.16% to $17.69, while MT pulls back from a week's worth of solid gain at -2.7% to $24.83. WSB's new meme ETF ICLN had some profit taking happened much to the displeasure of people who fomo into the ETF this morning, not realizing the sea of red candles were not bullish indicators. ICLN close the day down slightly to -0.75% to $33.15. Funny enough, OTM monthly calls haven't pulled back that much due to the magic of IV.\n\n* While initially red through out most of the day, the DOW reversed course and closed up 0.18% or 56 pts, S&P up 0.55% or 20 pts, Nasdaq up a solid 1% or 134 pts, and RUT closed flat at -0.25% or -5 pts. It's the weekend and WSB newcomers addicted to FDs will no doubt flood the weekend thread, constantly asking if their $700 portfolio (funded in part by the $600 stimulus) with OTM calls will be okay. Don't worry new fam, stonk only goes up.\n\n(Yesterday's recap: none cuz I was lazy and enjoying gains. You can read Wednesday's recap [here](https://www.reddit.com/r/wallstreetbets/comments/ks13de/reeeeeeeeecap_of_todays_market_driving_news_jan_6/)).",
        "title": "Reeeeeeeeecap of recent market driving news (Jan 8, 2021 weekend Elon chan edition)",
        "created_utc": 1610140255.0,
        "upvote_ratio": 0.96,
        "num_comments": 29,
        "author": {
            "name": "freehouse_throwaway",
            "id": "16l3q6"
        }
    },
    "ktbu75": {
        "score": 288,
        "selftext": "So today I went to gamestop first time in years. Literally just to speak with the clerk. As I asked her about PS5 and Xbox sales she said they were backordered into the summer. This was also, just the store's online orders. They only got 4 of the next gen systems for launch. I then went to GNC next door to meet up with my Chad bro and tell him my DD. At this point, the GNC guy proceeds to tell me a story about how he went to Gamestop during pre-orders for receipt paper (apparently GNC is having massive supply issues) and that he somehow managed to be in line perfectly to be put on the pre-order list for a next gen system. He was the ninth person in line per his words.\n\nTL;DR GNC is bankrupt and gamestop has enough paper to give away to other struggling retail.\n\nLong GME till Monday's conference.",
        "title": "GME",
        "created_utc": 1610140123.0,
        "upvote_ratio": 0.93,
        "num_comments": 62,
        "author": {
            "name": "Alien8w8",
            "id": "2hxhapd9"
        }
    },
    "ktbsxu": {
        "score": 64,
        "selftext": "We all heard about how no one could get their hands on the new consoles when they came out back in November. I thought the supply would have caught up by now, but just yesterday I heard a guy say that he tried to buy a PS5 and still couldn't get one. This prompted me to check out Gamestop's online store and sure enough, they have no PS5's or Xbox's anywhere. Heck, even the Nintendo switches are nearly sold out. I think Cohen is doing a good job leading GME into e-commerce and I highly doubt the stock can go much lower from where it currently is because of the huge $17 support right below the current price.\n\n&#x200B;\n\nYolo'd the last embers of my dying account into GME calls. \n\n&#x200B;\n\nPS: If you're wondering, I killed my account with SPY puts thinking that the bad jobs report, big RONA, and riots would bring the market down...... The market didn't give a flip...... I'll probably never short the S&P500 again.\n\nUpdate: Sold my contracts just a few minutes into market open after the huge gap up on news. Account saved.",
        "title": "GME Fundamental Analysis",
        "created_utc": 1610140020.0,
        "upvote_ratio": 0.86,
        "num_comments": 19,
        "author": {
            "name": "Bowen0919",
            "id": "27qmmw35"
        }
    },
    "kt6lyl": {
        "score": 45,
        "selftext": "I was reading up on rules and regulations on [https://www.sec.gov/investor/pubs/regsho.htm](https://www.sec.gov/investor/pubs/regsho.htm)\n\n**5. After adoption of Rule 204, why are there still threshold securities and why is there still a threshold securities close-out requirement?**\n\n**Even after adoption of Rule 204, failures to deliver may occur in certain circumstances. The appearance of a security on a threshold list does not necessarily mean that there has been abusive “naked” short selling or any impermissible trading in the stock. Delivery failures can be caused by both long and short sales. In addition, notwithstanding actions by broker-dealers to close out delivery failures, certain securities may remain on an SRO’s**[**\\[17\\]**](https://www.sec.gov/investor/pubs/regsho.htm#_ftn17) **threshold securities list for a variety of legitimate reasons, such as:**\n\n* **Despite proper action to close out fails, new delivery failures from long or short sales, at the same or other broker-dealers, result in the security staying on the threshold list;**\n* **One or more broker-dealers may have temporary but legitimate problems in obtaining the stock they borrowed in time for delivery;**\n* **Long sellers may have difficulty in producing stock in good deliverable form to their broker-dealer.**\n\nYou retards need to read. Being on NYSE Threshold Securities for consecutive days doesn't mean they're doing an illegal short selling of a stock. It could mean that there could be a failure to deliver at the same or other broker-dealers.",
        "title": "All You Retards Talking About NYSE Threshold Securities for $GME",
        "created_utc": 1610125386.0,
        "upvote_ratio": 0.79,
        "num_comments": 40,
        "author": {
            "name": "SnooWalruses7854",
            "id": "7y8qmrbe"
        }
    },
    "kt5vgi": {
        "score": 0,
        "selftext": "First, to reduce any confusion, the company will be referred to as Papa John's and the person will be referred to as Schnatter.\n\nI was joking about the idea to take over Papa John's with some of my friends yesterday to get Schnatter back in control of his company, and when I started doing my research I actually liked what I saw purely from an investment standpoint. This post will have two main parts: how we can get Schnatter his job back and also how we can easily make money on PZZA. We'll do the money stuff first.\n\n&#x200B;\n\n**Chart**\n\nAs of writing this, PZZA is currently trading at $94.10 and the ATH is $102.25. It is basically guaranteed that it will go back to the ATH. It has also sailed past the 20 and 10 day moving average, so there is no resistance until ATH. This is great for options.\n\nhttps://preview.redd.it/s6klbqs2u4a61.png?width=920&format=png&auto=webp&s=a797b3678678bd167818ee455dcde4d49f6e4512\n\n&#x200B;\n\nIn addition, I suspect that PZZA could be forming a cup and handle pattern. If this plays out, the price target would be (ATH + (ATH - Bottom of Cup)), which is about $131.38. However, we won't know if this is a cup and handle until it happens.\n\nhttps://preview.redd.it/umhvpr1ou4a61.png?width=1140&format=png&auto=webp&s=b468ffd791469758f0679d390c4b6d72cad01a35\n\nEven if the pattern fails, a delivery pizza restaurant is a pretty safe place for your money to be during the pandemic.\n\n&#x200B;\n\n**Other Numbers**\n\n[Target price](https://www.wsj.com/market-data/quotes/PZZA/research-ratings) of $104.50 with a high of $116.00. I think this is low going off the chart.\n\n[31 million shares](https://finviz.com/quote.ashx?t=pzza) float. I know that's a lot, but Schnatter already owns almost [1.3 million shares](https://ir.papajohns.com/stock-information/ownership-profile).\n\nGuys, it's take out pizza in a pandemic it should really be self explanatory.\n\n&#x200B;\n\n&#x200B;\n\nNow we can talk about how Schnatter can become reinvolved with the company, which should help PZZA stock even more. As you will see, ever since he left the company has not been in as good of a position.\n\n**Why Schnatter Left**\n\nIn 2017, he made a controversial comment about how the [NFL player protests were hurting Papa John's sales](https://www.npr.org/sections/thetwo-way/2017/12/22/572779230/papa-johns-ceo-steps-down-following-controversial-remarks-on-nfl) because they were the official pizza sponsor of the NFL. I don't want this to get political, but this is essential to talk about. Schnatter stepped down as CEO but remained on the board of directors. Fast forward into 2018, where Schnatter was reported to have [used a racial slur](https://www.forbes.com/sites/noahkirsch/2018/07/11/papa-johns-founder-john-schnatter-allegedly-used-n-word-on-conference-call/?sh=376e4e6e4cfc) in a meeting and it was recorded. Then, he stepped down from his position and no longer had a role in the company (besides for shareholder).\n\n&#x200B;\n\n**Schnatter's Fight for Innocence**\n\nEver since both of these allegations have surfaced, Schnatter has maintained his innocence and that his words were taken out of context. In a [recent interview](https://www.youtube.com/watch?v=1lYGrUA6YjA) Schnatter had with the H3 Podcast (I know many people don't care for them, myself included, but those opinions don't change what Schnatter says in the interview) where he explained why both allegations were false. Regarding the NFL drama, Schnatter claims that he was talking about how the NFL had a leadership problem because they were not addressing the issue. [His exact words were,](https://www.foxbusiness.com/retail/ex-fbi-director-clears-papa-johns-founder-of-racial-bias-slams-clearly-inaccurate-media) \"*The NFL is hurting, and more importantly by not resolving the current debacle to the player and owner’s satisfaction, NFL leadership has hurt Papa John’s shareholders.\"* In regards to the allegations of him using a racial slur, former FBI director Louis Freeh, wrote a [report](https://papajohnschnatter.report/read-the-report) where he explains how that in the phone call where he used a slur, he many times stated how he does not support any form of racism, and when he said the word, he was referring to how Colonel Sanders used it and it bothered him. There are two parts to the recording that Schnatter has been fighting in court to get released. The first part includes him using the slur and the context, and the second part includes the other people on the call celebrating after Schnatter hung up talking about how \"they got him\" and they needed to get it to the press right away. This is all according to the H3 interview. It is common sense that Schnatter would not want a recording made public that would damage him, and the company seems intent on keeping it secret, showing that they are likely hiding something.\n\n&#x200B;\n\n**Sales are Slumping**\n\n[Sales are decreasing](https://www.statista.com/statistics/221441/papa-johns-total-revenue/#:~:text=Revenue%20of%20Papa%20John's%20worldwide%202007%2D2019&text=American%20pizza%20restaurant%20franchise%20Papa,seeing%20a%20decline%20in%20revenue) every year since his role as been minimized. It's as simple as that. They are in no way a failing company, they are just making less money than they were.\n\n*Processing img 934fvr5jq4a61...*\n\nIn addition to slumping sales, in the [H3 interview](https://www.youtube.com/watch?v=1lYGrUA6YjA), Schnatter claims that Papa John's total number of customers is down significantly and that the quality has decreased. He says he buys about 600 pizzas every 90 days from stores around the country to check on the quality. In my personal experience, I can say the quality at my local Papa John's has decreased over the past couple years.\n\n&#x200B;\n\n**Why Schnatter Can Fix This**\n\nSchnatter is more devoted to Papa John's than most CEOs (after Karp and Elon), even though he technically doesn't work for them anymore. As I said before, he does frequent quality checks on the restaurants. The reason he does is is because he cares about the franchise owners and employees who have been negatively impacted by the new management and slumping sales. Who else still puts effort into a company after they've been fired from it? Also, this is just speculation, but since he is still closely associated with the company it is still his reputation.\n\n&#x200B;\n\n**What we can do**\n\nIt's simple, buy shares! If we buy enough shares of PZZA, we (along with Schnatter) can become the majority shareholder of the company. There are [just over 31 million shares float](https://finviz.com/quote.ashx?t=pzza) and Schnatter still owns almost [1.3 million shares](https://ir.papajohns.com/stock-information/ownership-profile), or 3.88% of the company. If he can convince a few of the other large investors that it is in their best interest to see him in charge again, we can easily call a shareholder meeting, vote out those who wrongly accused him, and put him, back in charge.\n\n&#x200B;\n\n**Historical Implications**\n\nSchnatter has long been touting \"The Day of Reckoning\" but has not given any hints as to if it has already happened, if it is multiple events, or what it will be specifically. If we can accomplish this, WSB would go down in history (it already has) again for giving a man his company back... and we will make money in the process. We can be the day of reckoning!\n\n&#x200B;\n\n**Is This Legal?**\n\nYes, it is perfectly legal. This would technically be a hostile takeover, which is legal, but we can just call it something else. Besides, I'm pretty sure Ryan Cohen is trying to do the same thing with Game Stop.\n\n&#x200B;\n\n**TLDR**\n\nPZZA chart shows easy money, Schnatter is innocent of accusations, only he can bring Papa John's back to its former glory, and we can be the ones to do that. The Day of Reckoning is here!\n\n&#x200B;\n\nPZZA PLTR NIO GME SPCE ICLN TSLA 🚀🚀🚀\n\n&#x200B;\n\nAlso if I misspelled \"Schnatter\" anywhere I'm sorry.",
        "title": "Papa John's $PZZA - Make money, help franchise owners, and give Papa his company back",
        "created_utc": 1610123265.0,
        "upvote_ratio": 0.38,
        "num_comments": 20,
        "author": {
            "name": "AUSTINpowers050",
            "id": "27v0qrjg"
        }
    },
    "kt4igt": {
        "score": 504,
        "selftext": "friends (other attorneys with experience in trading and regulation) suggested getting a full list of Case Numbers for all the SEC, FINRA, and NYSE reports people have been making!\n\nPlease check your email and add them to this post.\n\nIf you haven't filed a complaint. File one here:\n\nFinancial Industry Regulatory AuthorityFINRA[https://www.finra.org/investors/have-problem/file-complaint/complaint-center](https://www.finra.org/investors/have-problem/file-complaint/complaint-center)\n\nSecurity Exchange CommissionSEC[https://www.sec.gov/tcr](https://www.sec.gov/tcr)or [https://www.sec.gov/oiea/Complaint.html](https://www.sec.gov/oiea/Complaint.html)\n\nNew York Stock ExchangeNYSE[https://www.nyse.com/regulation/complaints-and-inquiries](https://www.nyse.com/regulation/complaints-and-inquiries)\n\nI can update this post with a list of case numbers you guys provide.Here is a screenshot example from NYSE. Unfortunately SEC and FINRA don't include the ticket in their response email, so you guys will likely have to find it another way.\n\nhttps://preview.redd.it/yz84ljokj4a61.png?width=2024&format=png&auto=webp&s=b0080798d3b47f9d2567a4aaaa10e6eb8a28522f\n\n  \n\n\nEDIT: Here is a template to complain with Provided from [**u/Isthiswittyenough92**](https://www.reddit.com/user/Isthiswittyenough92/)\n\n*To whom it may concern,*\n\n*This letter serves to bring the SEC’s attention to suspected illegal activity in GameStop Corporation’s (ticker GME) trading. As a shareholder in GME, I have concerns about illegal naked short selling and increasing failure-to-deliver rates in the month of December 2020 through present day. GME has consistently appeared on the NYSE Threshold Security list for the last 21 trading days. In order to appear on the threshold list, a stock has to have 0.05% of outstanding shares fail-to-deliver, for GameStop this amounts to roughly 350,000 shares.* ***GME’s failure to-delivery rates have exceed this amount on most trading days in December 2020***\\*.\\* ***Furthermore, on at least three trading days in December,*** ***the total number of shares failed-to-deliver exceeded 1 million***\\*. Below is a summary of trading days in December which had exceptionally high failures-to-deliver:\\*\n\n*12/1: 91,971 @ $16.56*\n\n*12/2: 1,061,397 @ $15.80*\n\n*12/3: 1,787,191 @ $16.58*\n\n*12/4: 999,475 @ $16.12*\n\n*12/7: 1,002,379 @ $16.90*\n\n*12/8: 872,292 @ $16.35*\n\n*12/9: 721,361 @ $16.94*\n\n*12/10: 605,975 @ $13.66*\n\n*12/11: 880,063 @ $14.12*\n\n*12/14: 284,296 @ $13.31*\n\n*Given the data presented above, I request the SEC to further investigate suspected illegal naked short-selling in GME, particularly as it concerns Melvin Capital, who holds a substantial short position in the Company.*\n\nand finally GME 🚀🚀🚀🚀🚀🚀",
        "title": "🚀🚀🚀Look guys I'm helping!! Let's get more pressure on the GME shorts 🚀🚀🚀",
        "created_utc": 1610119257.0,
        "upvote_ratio": 0.96,
        "num_comments": 55,
        "author": {
            "name": "imposter22",
            "id": "4rsa7"
        }
    },
    "kt30cj": {
        "score": 388,
        "selftext": "Just got a text from a “non-autist” complaining about the new Xbox drop. Apparently in their most recent drop the only options were bundles costing from 6-700 dollars and it comes with a 25 dollar GME gift card, game pass ultimate, and some other stuff like an extra controller that I don’t give two shits about.\n\nAll I know it’s PROFITS PROFITS PROFITS for GME\n\n #wewantcohen #omnichannel\n\nPositions: GME $22 2/19, GME $30 4/16, GME $ 35 4/16, and GME $ 35 7/16 in case DA BEARS see us all buying April calls and pull some illegal bullshit which of course they won’t get in trouble for.",
        "title": "Microsoft & Xbox forcing profits to Gamestop with their new Xbox Bundles 🚀🚀🚀",
        "created_utc": 1610114573.0,
        "upvote_ratio": 0.96,
        "num_comments": 45,
        "author": {
            "name": "norhymeorreason96",
            "id": "3fpx7ykq"
        }
    },
    "ksfgdt": {
        "score": 708,
        "selftext": "[https://iborrowdesk.com/report/GME](https://iborrowdesk.com/report/GME)\n\nonly 700 shares available to short on [iborrowdesk.com](https://iborrowdesk.com)?? from 55,000 yesterday and 200,000 last week.Melvin and friends can't stop the share holders anymore.People are buying, stock is rising, they are bleeding.Let the shorts bleed and die. Buy more GME shares. Squeeze them until they give up  \n\n\n**Edit**: I've been told that it seems like they are trying to hide their naked shorts behavior. They are reducing the short shares available because of this. Its panic from the banks who were selling naked shorts.   \nThose SEC, FINRA and NYSE complaints are paying off!!  \nYou cant stop the 🚀's",
        "title": "Shorts are fighting for their lives... GME 🚀🚀🚀🚀🌝",
        "created_utc": 1610033191.0,
        "upvote_ratio": 0.96,
        "num_comments": 183,
        "author": {
            "name": "imposter22",
            "id": "4rsa7"
        }
    },
    "ksethj": {
        "score": 239,
        "selftext": "As. of 9:45 am\n\nWhile not all of this isnt all the available shares to short in the market, it is a reasonably good indicator and currently there is only 2000 shares available!! It has never historically been this low! It's been close but as long as I've been keeping track of it, it's never been like this. Hopefully this is a good indicator for the possibility of the squeeze!\n\n&#x200B;\n\nEDIT: AS OF 10:00AM THERE IS ONLY 700 SHARES!!! I REPEAT THERE IS ONLY 700 SHARES!!!\n\n&#x200B;\n\nEDIT 2: It. hasn't updated past 10.00am, so I don't know\n\n[https://iborrowdesk.com/report/GME](https://iborrowdesk.com/report/GME)",
        "title": "Available shares on iBorrowdesk For GME at an all time low! 🚀 🚀 🚀 🚀",
        "created_utc": 1610031295.0,
        "upvote_ratio": 0.93,
        "num_comments": 105,
        "author": {
            "name": "_Unoriginal_Name",
            "id": "14ek3e"
        }
    },
    "kscunh": {
        "score": 54,
        "selftext": "**Stocks go bonkers while the Dems take Georgia. The Capitol is breached. Is this the time to buy Solar, Pot & Industrial stocks? Let’s talk about this and other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw a mixed day with the [Dow Jones](https://ibb.co/nsJ4qqL) leading the way up over 400points and closing at a new record high, with the broad stock market [SP500](https://ibb.co/kKxbFdQ) also finishing 0.57% up for the day, while the tech heavy [Nasdaq Composite](https://ibb.co/C7CdfX8) finished the day down 0.6%. All 3 of the big indexes were trading higher earlier in the day before the [VIX](https://ibb.co/4PR24Fc) saw a spike of more than 10% as rioters [STORMED](https://ibb.co/KjbQPkD) the US Capitol, before eventually getting back to certifying the electoral votes, which brought back some stability. This was a very bad incident but shouldn’t have long-lasting effects on the stock market.\n\nYesterday we saw almost 70% of [COMPANIES](https://ibb.co/Br0Y0hB) advancing with over 300 new highs as the volume also spiked up, as 8 of the 11 [SECTORS](https://ibb.co/FmhD70s) finished in the green with Banks , Energy and Materials gaining more than 3%, while the biggest loser was by far the tech sectors, dropping 1.7%, as we saw Large-Cap Growth companies underperforming the [MARKET](https://ibb.co/XpbdM7p), while small & mid-caps, especially the value plays, outperformed the market.\n\nHere is the [HEAT MAP](https://ibb.co/WKhNSZh) from yesterday which shows how Big tech companies suffered yesterday, as the perceived threat of increased [TAXES](https://ibb.co/D79SMMP) spooked the market, while the Industrials, Banks, Green Energy & [POT](https://ibb.co/XZFHGvj) stocks flourished on the hope of a big stimulus with new & improved regulations, as it is expected that there will be an improved legislation that will help the cannabis stocks soar and the possible big stimulus would be a huge boost to most of the [RETAIL](https://ibb.co/GfwgQ3Z) sector which saw names like Nordstrom, GameStop, Target and many others posting big moves to the upside. Joining them should be [COSTCO](https://ibb.co/pQdXm2H), which did lag yesterday, but posted terrific December numbers after hours, with comparable sales increasing more than 10% while e-commerce rose by more than 60% for the month.\n\nYesterday we also saw the [FED](https://ibb.co/mFgqXN4) deciding to continue the current QE pace, as they still see plenty of uncertainty around, especially in the first quarter of 2021. They will continue to buy $120B worth of securities every month, as well as possibly moving on to some lengthier term maturities, while being opened to even more monetary easing if necessary.\n\nIn some more good news, we saw the [Factory Orders](https://ibb.co/jRqfPf7) for November coming it at +1%, better than expected as shipments increased by 0.7%.\n\nWhile in some other not so good numbers we saw the December [PMI](https://ibb.co/7XjyFjB) slowing to 55.3, less than the 55.7 expected and 58.6 in the previous month, but this is still an indicator of expanding business activity, while ADP [numbers](https://ibb.co/kJ6jjRx) came in worse than expected, as the US lost 123K nonfarm jobs, worse than the 130K addition of jobs expected and 304K jobs gained in the previous month, as we saw a big loss of jobs in large business especially in the leisure/hospitality [SECTOR](https://ibb.co/9sCLVqY). This was the first [month](https://ibb.co/3F8Q9j0) since April when we saw a lose of jobs in the nonfarm private business.\n\n[TODAY](https://ibb.co/vsB6NM2) we have a loaded economic data calendar starting with jobless numbers early in the morning and finishing with the Fed Balance Sheet at the market close.\n\nIn some other stock market news, we saw a report that [ROBLOX](https://ibb.co/3yqfGFZ) is looking to go public via direct listing, rather the traditional IPO. The latest funding round at $45/share saw the company valued at almost $30B, which is very high but we have to see the latest books of the company before making a prediction if it will go higher or not. This may be a better opportunity for retail investors to get in at lower prices, rather than buying at 2-3 times the IPO price.\n\nSo, guys, due to the latest political developments we have seen a huge shift in the markets, as we saw yesterday the [SOLAR](https://ibb.co/KWH2wHh) stocks having spectacular gains with Sunrun, & SunPower gaining more than 16% with many other companies like [ENPHASE](https://ibb.co/72jTgdq) also soring, while the hydrogen play Plug Power also [soared](https://ibb.co/xDxrq80) more than 20% in after-hours after agreeing to a collaboration with SK Group.\n\nWe also saw gambling names move up after with the Senate changing leadership and states like New York pushing for the legalization of [gambling](https://ibb.co/CPFdVpv) in most of the US.\n\nWe also saw other companies posting great numbers, with [T-Mobile](https://ibb.co/qC2rXQC) adding 5.5M customers, its best ever number as they lead the industry, while [ROKU](https://ibb.co/qxWCNg4) continued to be one of the best plays in the streaming business alongside Disney & Netflix as they have surpassed 50M accounts.\n\nAnd on the industrial side we saw companies like Caterpillar and US Steel posting big gains in anticipation of an infrastructure bill that would greatly benefit them.\n\n[Ford](https://ibb.co/yNz7PjD) also beat expectations with a decline in sales of just under 10%, better than the 14% expected as the company continues to move towards more trucks, SUVs & EVs.\n\nOn the other-hand we also saw [Chinese](https://ibb.co/rbRQwyq) tech and EV stocks fall, after more bad headlines like the US looking to ban even more big companies in the US like Alibaba & Tencent. This is a continuing story which has peaked up steam in the recent year after the political tensions between the US and China have increased. This companies were also joined by the big tech which continued to face selloff pressure after the blue sweep in Georgia.\n\nMy opinion is that you should start buying some green energy, pot and industrial stocks but you shouldn’t go to heavy on the first day. You should wait for things to cool-off a little and not buy everything at the top. I think a bi-weekly split strategy or monthly strategy would be nice. Which would mean you should divide your investment money and buy especially on red days every couple of weeks or on a monthly basis, but I would avoid Chinese stocks for now at least.\n\nSo, let’s hope for a good day in the market as the [WORLD](https://ibb.co/LCv8Dp1) markets are mixed while the US [FUTURES](https://ibb.co/wghkCJ1) seem to be pointing at a good open with the Nasdaq leading the way,  though in the last few days every single time the futures were up the stocks finished lower and vice-verse, when the futures were red the stocks finished higher, so you shouldn’t base your investment on this. \n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!",
        "title": "Stock Market News for Today | RUN, ENPH, TLRY, ACB, NIO, ROKU, CAT, F & Other Stock News [01-07]",
        "created_utc": 1610024631.0,
        "upvote_ratio": 0.98,
        "num_comments": 23,
        "author": {
            "name": "0toHeroInvesting",
            "id": "8oq1j048"
        }
    },
    "ks13de": {
        "score": 423,
        "selftext": "(*Editor's note: It's a [wild day](https://d2qig04bry9arv.cloudfront.net/uploads/2014/04/roller-coaster.jpg) for the market and the country, and I will try to be as neutral as possible despite the fuckery afoot)*.\n\n* Dems clinched the GA Senate run-off election as Warnock defeats Loeffler while Ossoff defeats Perdue (the first millennial Senator). As the results became more clear last night, futures took a deep dive particularly for NQ, while conversely small caps enjoys a favorable bump. The market opened deeply red for QQQ as big tech retreated with renew fear on antitrust probes  and overall an unfriendly corporate environment as Democrats will control WH and both chambers of Congress. \n\n* By early morning, the sell-off quickly reversed and big tech recovered most of their red, with big tech such as AAPL going from -3% to just shy of yesterday's close during day's high. In contrast to big tech, clean tech and weed soared on Dems securing the Senate. ICLN was up almost 4% during pre-market and as high as 9% during intraday high and HASI was up 10% during intraday high. Weed stock such as TLRY was up as high as 21%, ACB as high as 11%+, and APHA as high as 14%.\n\n* Things quickly pulled back and tech started fading in earnest at 2:15 PM ET when protestors [cosplaying as revolutionaries](https://image.cnbcfm.com/api/v1/image/106820104-1609961746992-gettyimages-1230453313-AFP_8YA6MW.jpg) stormed the capitol and Congress had to quickly pause their certifying of the Electoral College votes. Shit got real when a lady got shot as these protestors attempt to storm the [barricaded House chamber](https://dynaimage.cdn.cnn.com/cnn/w_1600/https%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F210106150417-03-house-chamber-0106.jpg) while Reps were still in the building.\n\n* The sell-off accelerated for AAPL, AMZN, FB, MSFT, and NFLX as most drilled back to opening lows by EOD. AAPL closed the day -3.37% to $126.60, AMZN -2.49% to $3,138, FB -2.83% to $263, MSFT -2.59% to $212, and NFLX -3.9% to $500.49. Thanks to overall negative sentiment of all things tech, QQQ closed the day red at -1.39% to $307 (retreating quite a bit more than IXIC given the weigh of big tech in QQQ).\n\n* Morning economic numbers had ADP reporting payrolls dropping to 123k in Dec, slightly below consensus of 130k. PMI was at 54.8 while consensus was 55.3, while factory order was up 1.0% MoM. Thankfully, none of these number fucking matters as the Dow, SPY, and IWM proceed to sky rocket with the market looking forward to stronger spending and stimulus from a Dem controlled govt.\n\n* Beyond weed, clean tech, and infrastructure - financial sector killed it today in particular mid-cap banks such as ZION (up 11.24%), CNC (up 9.81%), and KEY (up 9.73%). You'll find a similar story for large-cap bank stock with JPM closing up 4.70%, BAC up 6.25%, C up 5.75%, and WFC up 7.08%. It's a good thing I've already dumped my reopening [WFC leaps play](https://www.reddit.com/r/wallstreetbets/comments/kftjzt/weekend_discussion_thread_for_the_weekend_of/ggarcbi/) of $25c and $30c which are now fucking ITM by $3~$8 and still have a year left to go on them. Nice.\n\n* In yet another confusing about-face and showing a real Karen spunk, the NYSE is *really* delisting the three Chinese telecoms this time. The real kicker though came in at 2:25 PM ET when news broke that US officials are considering *more* Chinese stock delisting, adding Chinese big tech Alibaba, Tencent, et al. to the potential list. A sea of red soon followed to compound the sell-off as BABA crater to the Earth's core and closed down -5.32%. Following suit, PDD closed down -5.58%, JD down -7.66%, and the same goes for Chinese EV NIO at -5% and XPEV at -2.62%. LI escapes semi-unscathed and closed the day up 2.48% thanks to a new BofA coverage with a Buy rating and a PT of $42.\n\n* In WSB meme stock land, GME was on track for a solid 8-9% day until the storming of the capitol occurred, PLTR's fade accelerated further while MT stays modestly flat, bouncing back from the overall market sell off. GME closed up 5.70% to $18.36, PLTR closed down -4.31% to $23.54, and MT closed up 0.32% to $24.70. ICLN, a new WSB favorite due to new balance of power in Congress might be added to future roundup if it continues to pump. Imagine that, a clean energy boomer ETF becoming a meme stock. The iShares fund managers are probably wondering why their alerts going tits up with social media mentions and sentiment brewing.\n\n* Random trade ideas (these are not financial advice and if it goes wrong that's your own gdamn fault):\n\n    1) FSLY leaps Jan 2022 90c or 100c+ for eventual TikTok climbing back fully onto the service as ByteDance pointedly makes a political jab at outgoing administration. Headwind on this retarded play: cloud/stay-at-home stock continues to take a beating as rona gets under control as vaccine roll out picks up. \n\n    2) Sell AAPL cash secured puts Jan 15 120p to 122p if the big tech fade continues rest of the week. These ~0.18 to 0.24 delta strikes are likely safe enough and if assigned, you'll have an upcoming ER on Jan 26 to sell IV pumped covered calls to get out of the trade intact. Feb 19 puts are likely okay to sell as well given you'll receive much more premium from the ~43 dte chains. Headwinds on this retarded play: its CSP and CC. As boomer as it gets. \n\n    3) BABA leaps and/or March debit call spread for another bounce in a wild trading week for BABA. March 230c/250c is probably a sufficient spread while baking in a bit of IV via ER which is on Feb 11. Jan 230c to 250c if you're not poor. Headwind on this retarded play: Jack Ma really is missing and the US govt really will delist a 600 bil market cap Chinese ADR, forcing out all major US institution holders. Yeah, right.\n\n* The DOW closed up 1.44% or 437 pts, Nasdaq down -0.61% or -78 pts, S&P up 0.57% or 21 pts, and RUT closed up 3.98% (!!) or 78 pts. Stay in school kids and avoid storming federal buildings or Twitter will start banning your fucking account. (TWTR locks POTUS account for 12 hrs and is down -1.99% AH).\n\n(Yesterday's [recap](https://www.reddit.com/r/wallstreetbets/comments/kr7ze8/reeeeeeeeecap_of_todays_market_driving_news_jan_5/)).",
        "title": "Reeeeeeeeecap of today's market driving news (Jan 6, 2021 after market close)",
        "created_utc": 1609978905.0,
        "upvote_ratio": 0.98,
        "num_comments": 83,
        "author": {
            "name": "freehouse_throwaway",
            "id": "16l3q6"
        }
    },
    "krsa5c": {
        "score": 429,
        "selftext": "All- I am still holding the same 3 major positions. My total take home from my prpl play is about 5.8M. 600K has been withdrawn for taxes and 200K for personal expenses.\n\n&#x200B;\n\nPOSITIONS:\n\nPSTH - 20/30 spreads, 22.50/35 spreads and shares. I only open spreads to keep the same exposure with less capital due to tax stuff.\n\nPRPL - spreads,  short puts and debit spreads.\n\nBFT and [BFTWS](https://BFT.WS) \\- Shares and warrants. Standard options became available today and I do not own any.\n\n&#x200B;\n\nhttps://preview.redd.it/dri5f3uwuq961.png?width=1365&format=png&auto=webp&s=3fd4528b525df5239a7c82fc06fc50ec9ce41781\n\n&#x200B;\n\nhttps://preview.redd.it/lzebqv32vq961.png?width=1352&format=png&auto=webp&s=32702cc569a6cf583b60111b79c0e5c302f73e88\n\n&#x200B;\n\nhttps://preview.redd.it/junck4hmvq961.png?width=1362&format=png&auto=webp&s=ac0f608e0b273b5e2b7f50aef7a21772cf6a57f2\n\n&#x200B;\n\nhttps://preview.redd.it/c6ss1r5qvq961.png?width=1347&format=png&auto=webp&s=559369dc84a929c95541e6e6b64e33b9aad378a2\n\nI have reduced by BFT position slightly to buy some of the Theil SPAC.\n\nI have rolled my PRPL short puts from January 30's to February 35's. I still believe the next leg up will put us in the high 30's or even the low 40's. I expect some type of press release soon as the company has been silent for a long time.\n\nPSTH- anticipated announcement in Q1, hopefully January. The six month mark is Jan 22nd.\n\nBFT- Expecting a merger date announcement soon. CNBC's Grasso is back from having the corona and he is pumping it again. That along with a few big twitter guys will keep this on a lot of peoples radar. Paysafe is a solid play IMO, even if it doesnt shoot to 30 post merger. I am optimistic that we see 17/18 per merger and 25 post merger. This is purely a guess.\n\nAll my other positions are small. I've posted them all above. And no, I don't own GME- it might be the play of the century but I think I missed the big run.\n\n&#x200B;\n\nGod Speed Handi-capables.",
        "title": "Update ---- $4,937,000 ----- YOLO",
        "created_utc": 1609953409.0,
        "upvote_ratio": 0.95,
        "num_comments": 266,
        "author": {
            "name": "dhsmatt2",
            "id": "1s9iwp51"
        }
    },
    "krrpd7": {
        "score": 2050,
        "selftext": "Once the pandemic started, I liquidated my portfolio (sold everything, including TSLA).  Shorted SPY on the way down to make some money.  Early May, decided we had hit bottom and put everything into TSLA stock and LEAPS.  You can see a dip in my portfolio value when TSLA went down, but 💎 🤚! Total value includes increases in TSLA since the new year.  Ended 2020 with $7.1M and since then almost up another $1M thanks to TSLA!  Still waiting on my GME calls to print... Looking forward to TSLA Q4 earnings report!\n\nhttps://preview.redd.it/4648amlerq961.png?width=1709&format=png&auto=webp&s=0894ca7dbd94d9a7154323e53a67a79f403f5987\n\nhttps://preview.redd.it/eikuu6vdrq961.png?width=1661&format=png&auto=webp&s=a05b683f7c8135098a85df9516f0959fc9b1eff2",
        "title": "Thanks TSLA for 1092% gains in 2020!",
        "created_utc": 1609951820.0,
        "upvote_ratio": 0.98,
        "num_comments": 470,
        "author": {
            "name": "Pokerhobo",
            "id": "9k1ez"
        }
    },
    "kro81j": {
        "score": 77,
        "selftext": "Had issues with the visual bot so these charts are from last night. I had to repost and am not going to take the time to update all charts for pre-market movement.\n\nthe banned ticker: [https://imgur.com/a/yM9lWZT](https://imgur.com/a/yM9lWZT)\n\n[Further out TA: CRAYON MANIA! GME, TSLA, PLTR, AMD, CRM, NIO , ZM, and DIS or 4 dos who cant red or right!!!!!!!](https://www.reddit.com/r/wallstreetbets/comments/kqmsqo/crayon_mania_gme_tsla_pltr_amd_crm_nio_zm_and_dis/?utm_source=share&utm_medium=web2x&context=3)\n\nBefore you poop out my 🖍crayons 🖍\n\nThis is just a taste the DD I perform and I do not solely rely on my magic crayons. Wish it were that easy.\n\n\\-------------------------------------------------------------------------------------------------------------------------------\n\nGME (Long term Bullish) - If you're not already in GME then I don't recommend playing until you see a break at 18.10 (ish) with heavy volume. If it breaks resistance look out for 18.97-19.74-20.5 range.\n\nIf current support fails, look GME to fill a gap at 16.55-15.77 range. If it breaks 15.77 support then we f'ed. Watchout for 14.5-13.50. Anything below 13.5 and that means Cohen probably died or something.\n\nIf it breaks 19.74 then we moon to 21-23 range for this week.\n\nLink to weekly chart: [https://www.tradingview.com/chart/GME/k94qRfVq-gme-weekly/](https://www.tradingview.com/chart/GME/k94qRfVq-gme-weekly/)\n\nLink to earning runnup chart: [https://www.tradingview.com/chart/GME/FajqVHfS-gme/](https://www.tradingview.com/chart/GME/FajqVHfS-gme/)\n\nhttps://preview.redd.it/uct52h9tup961.png?width=3510&format=png&auto=webp&s=a8b9a251d05a4980b1f919c7e3f3af24081e41d4\n\nTSLA (Bullish): Expecting TSLA to head down to 748 range since it mooned after hours and is near resistance BUT it could hit 757-765-770 because it's TSLA. If green support line fails we could see 740-733-731 area but would need catalyst and volume. If it breaks out of support with no volume then it could trade around no-man's land for the rest of the week while our calles get the theta treatment.\n\nLink to weekly chart: [https://www.tradingview.com/chart/TSLA/nHGT9Uma-tsla-weekly/](https://www.tradingview.com/chart/TSLA/nHGT9Uma-tsla-weekly/)\n\nLink to earnings run chart: [https://www.tradingview.com/chart/TSLA/JPJ2pbU2-tsla-2/](https://www.tradingview.com/chart/TSLA/JPJ2pbU2-tsla-2/)\n\nhttps://preview.redd.it/whjtmtpuup961.png?width=3510&format=png&auto=webp&s=663b39d1a6a048499652554b6249d69dd1c08dc6\n\nAMD (bullish for earning run): If AMD breaks 93.20 with volume then look out for 95-97.99 range. If it bounce off 93.20 resistance with volume then look out for 91.55-89.55.\n\nAMD weekly live chart: [https://www.tradingview.com/chart/AMD/aFDkTOVw-amd-weekly/](https://www.tradingview.com/chart/AMD/aFDkTOVw-amd-weekly/)\n\nAMD earnings run chart: [https://www.tradingview.com/chart/AMD/pCUBtFjh-AMD/](https://www.tradingview.com/chart/AMD/pCUBtFjh-AMD/)\n\nhttps://preview.redd.it/d6ppqrkvup961.png?width=3510&format=png&auto=webp&s=4d264f54a62f8d898789aa63ab5aafa87f065f16\n\nCRM (Bullish): If CRM breaks resistance with volume, look for 226-230-231 range. If it bounces with volume, look for 220-218-216 range.\n\nlink to weekly chart: [https://www.tradingview.com/chart/CRM/H7OpE4N6-crm-weekly/](https://www.tradingview.com/chart/CRM/H7OpE4N6-crm-weekly/)\n\nlink to earnings chart: [https://www.tradingview.com/chart/CRM/rF9L6PCW-crm/](https://www.tradingview.com/chart/CRM/rF9L6PCW-crm/)\n\n&#x200B;\n\nhttps://preview.redd.it/izn2cpqwup961.png?width=3510&format=png&auto=webp&s=43dc2c8a7b9a410cae8cc9e66e0979e4120c997d\n\nGT LEAP Bullish: Need volume. Break at 10.7. Pt 11.42 - 12.02. Rejections at 10.70 with volume and lookout for 10.12 - 9.77. Major failure and major break also shown.\n\nlink to weekly chart: [https://www.tradingview.com/chart/GT/RWcInGSH-gt-weekly/](https://www.tradingview.com/chart/GT/RWcInGSH-gt-weekly/)\n\nlink to leap chart: [https://www.tradingview.com/chart/GT/Xc4XjGlW-GT2/](https://www.tradingview.com/chart/GT/Xc4XjGlW-GT2/)\n\n&#x200B;\n\nhttps://preview.redd.it/7zyflshxup961.png?width=3510&format=png&auto=webp&s=4b181fddda9db0748ca754bea9d656f0b86ebbc6\n\nNIO (bullish earnings run): Look for a pt of 55.88-57.83 if NIO breaks current resistance area. If not, look for it to stay within 53.16 (ish) - 51.20 consolidation channel. Complete breakdown at 49.38-46.63 range.\n\nlink to weekly chart: [https://www.tradingview.com/chart/NIO/PeCIV1Y1-nio-weekly-2/](https://www.tradingview.com/chart/NIO/PeCIV1Y1-nio-weekly-2/)\n\nlink late feb chart: [https://www.tradingview.com/chart/NIO/R6oYO5er-nio2/](https://www.tradingview.com/chart/NIO/R6oYO5er-nio2/)\n\nhttps://preview.redd.it/zzetcscyup961.png?width=3510&format=png&auto=webp&s=610dfa926af6f562c1938e3ff7eaeb879fc63b7a\n\nPLTR (Bullish): Look for a break at 24.39 with volume for a pt got 25.5-26.96-28.60. If resistance holds look for 21.48 ish. Anything lower and we are in trouble friends.\n\nlink to weekly chart: [https://www.tradingview.com/chart/PLTR/eag3pAz2-pltr-weekly/](https://www.tradingview.com/chart/PLTR/eag3pAz2-pltr-weekly/)\n\nlink to earnings chart: [https://www.tradingview.com/chart/PLTR/Q7tajVq1-PLTR/](https://www.tradingview.com/chart/PLTR/Q7tajVq1-PLTR/)\n\nhttps://preview.redd.it/swj7crazup961.png?width=3510&format=png&auto=webp&s=5f9238d0d0f8e869d572296c924a31296ddf71de\n\nDIT: Adding SPY\n\nNot touching this until tomorrow at earliest since GA runnoff but heres bullish and bearish ranges.\n\nlink to weekly chart: [https://www.tradingview.com/chart/SPY/gOZNobdY-spy-weekly/](https://www.tradingview.com/chart/SPY/gOZNobdY-spy-weekly/)\n\nlink to longer term chart: [https://www.tradingview.com/chart/SPY/hyjgMvWm-spy/](https://www.tradingview.com/chart/SPY/hyjgMvWm-spy/)\n\nhttps://preview.redd.it/c5u8knuozp961.png?width=3510&format=png&auto=webp&s=96527f90ef7023bbea538019d62bc2ca09e61a59\n\nThanks for reading.\n\nNightMan",
        "title": "Crayon Mania Weekly Addition!!!!!!!!!! GME, TSLA, AMD, CRM, GT, NIO, and PLTR or 4 thos wu kant red or write gud (3rd grade reading level and below)",
        "created_utc": 1609941047.0,
        "upvote_ratio": 0.95,
        "num_comments": 39,
        "author": {
            "name": "napkins33e",
            "id": "h0rs2gt"
        }
    },
    "krnthp": {
        "score": 1475,
        "selftext": "Based on u/Isthiswittyenough92's [earlier post](https://www.reddit.com/r/wallstreetbets/comments/kr98ym/gme_gang_we_need_to_complain_about_naked_short/), I just delivered a similar message via Tor/SecureDrop to several news agencies' tip line: The New York Times, WSJ, Financial Times, Reuters, Forbes, Bloomberg, and...BuzzFeed.\n\nI made it clear in the message that the SEC adopted the rules on naked short selling after the GFC of 2008, hopefully to get some journalist wet with click-baity anticipation, drawing a direct line of Wall Street incompetence from then to now. I'll either edit this post or create a new one if I get any replies back (depends on the reply). Will it makes a difference? I dunno, but I had to try.\n\nIf we see any of these news sites posting something about this...you're welcome.\n\nEdit 1: no one has replied to my hot tips on illegal activity yet :/",
        "title": "Forget the SEC, I took the GME cause to the media",
        "created_utc": 1609939549.0,
        "upvote_ratio": 0.97,
        "num_comments": 137,
        "author": null
    },
    "krgvq6": {
        "score": 341,
        "selftext": "# Missed Opportunities\n\nMelvin was too blind (or too stuck) to cover back at $4, $8, $10...I'm here to provide them the research that their junior associates kids could've done. Hey Melvin if you want to pay me my hourly is on sale for you at $420.69 per hour.\n\n&#x200B;\n\n[Shorts could've started closing at 1\\/4 of GME price now](https://preview.redd.it/6lqafzjsqm961.jpg?width=533&format=pjpg&auto=webp&s=e70bb18d75df914c596cef0129c9c2146f6ed4a7)\n\nIt's been about 5 months of GameStop continually rising, and from those skinny orange lines the short position has not decreased at all. During this time, GME bulls have been blessed with a sleuth of positive news. Before we start cookin let me get all the ingredients into the pot for you guys:\n\n# Tendie Recipe\n\n[Provided to you by GME shorts](https://preview.redd.it/sg8apugjsm961.jpg?width=2048&format=pjpg&auto=webp&s=17bb70cb3f0a0c5c4bf91e8505e7655177ef15c5)\n\n# Ingredients\n\n1 **DIGITAL** revenue sharing agreement with GameStop  [(certified fresh by Domo Capital Management)](https://arstechnica.com/gaming/2020/10/microsoft-will-give-gamestop-a-share-of-xboxs-digital-revenues/)\n\nXbox Game Pass subscriptions to taste [(15 million subs at $9.99 / month as of Sep 2020)](https://www.theverge.com/2020/9/21/21449219/xbox-game-pass-15-million-subscribers-microsoft-growth).\n\n1 acquisition of one of largest private game developers in the world for $7.5 billion dollars  [(responsible for elder scrolls, fallout, doom...)](https://news.xbox.com/en-us/2020/09/21/welcoming-bethesda-to-the-xbox-family/)\n\n# Cooking Instructions\n\nYou have to have a chef's vision to see all this come together - the goal is to stew enough Game Pass subscriptions to make more and more tendies later on. How do we stew more Game pass subs?\n\n* Bullets below - More Game Pass subs = 🚀🚀🚀\n   * Take the acquisition above and put some of their best games on Game Pass letting anyone on the subscription play it on Console or on PC.  Steam is on PC, and developers are starting to protest them.  Sony doesn't have a gaming subscription for cross PC-Console play. The digital future will have one master race there will be no console or PC - only game.\n   * Partner with the only worldwide gaming focused retailer so they can push your products over competitors.  Sony has a bigger market share globally right now, but with GameStop, Microsoft sees its partner in crime.\n\n&#x200B;\n\n[ 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀 ](https://preview.redd.it/jxf6csxg1n961.jpg?width=506&format=pjpg&auto=webp&s=49e265425dd12fb93f6b55c0b39ea59b6cf7992f)\n\nAbove you see how much money Microsoft can make ANNUALLY if they get more subscriptions.  Now back to the whole point of this, we need the last ingredient, that spicy Microsoft deal with GameStop.\n\nGameStop get's a cut of Microsoft's digital Xbox revenue. Here is a quote from the article I linked above:\n\n*\"Loop Capital analyst Anthony Chukumba confirmed that same basic outline to Ars Technica based on his conversations with GameStop management. \"The way it's going to work is for every Microsoft Xbox console that GameStop sells going forward, GameStop will get some percentage of the revenue from every digital full game download, DLC, microtransaction, and any subscriptions as well.\"*\n\nHow much of a cut? No one really knows. After July I'll pay one of you paper hands to find out because you're most likely better at that then making this tendie recipe.  Let's speculate though assuming GameStop collects 3% of the revenues.\n\n50 million annual subscriptions = Additional $6 billion in ANNUAL revs for Microsoft\n\nLet's say that GameStop, because they're chummy with Microsoft, sell about 35% of ongoing XBOXs moving forward, allowing them to access the digital revenue share.\n\nThis works out to be additional $63 million dollars at almost 100% margins. And this is just from **subscriptions alone**.  How much are the rest of the DLC, microtransactions, and full digital game downloads worth for GameStop?  It's hard to know because Microsoft doesn't release detailed stats.  But let's take a look at their competitor so we can extrapolate [from Sony Quarterly earnings.](https://www.sony.net/SonyInfo/IR/library/presen/er/pdf/20q2_supplement.pdf)\n\n&#x200B;\n\n[Lots of Yen](https://preview.redd.it/urv8n5y77n961.jpg?width=1406&format=pjpg&auto=webp&s=e8de8bfc9ff4122aec1940d23b047fd7bc7f3668)\n\nListen, I'm not going to to sit here and convert what a million million yen is.  All you have to know is 3% of that is\n\n# 🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀  🚀",
        "title": "GME gang - Digital is the rebirth of GameStop not the death. Tendie recipe provided. 💎💎 🚀🚀🚀💎💎",
        "created_utc": 1609909505.0,
        "upvote_ratio": 0.95,
        "num_comments": 85,
        "author": {
            "name": "txbustanut",
            "id": "6h057"
        }
    },
    "krdqp5": {
        "score": 447,
        "selftext": "GME GANGGGG!!! Most of you know I've been long GameStop since 2017, initially. I am an OG GME bull and yearn for our true value to be recognized by the market. RC Ventures sees it. Many others (Senvest, Michael Burry, Hedgeye, etc.) do as well.\n\nBut Melvin Capital does not. They wish we would file for bankruptcy so they can just escape this trade. Alas, they didn't close when the price was $2.57. Greed will be their downfall. But, they are smart. They see the data and for that reason I must enlighten you all about what I am seeing in the data, too. Remember though, one quarter doesn't make or break this thesis.\n\nGameStop 4Q results will be weak, barring a spontaneous console creation event. Holiday results will be weak. The reality is while the future may be brighter than the wasteland the Melvin perceives for GME, the present isn't so great being at your core primarily a B&M retailer. It doesn't matter how in demand your products are if supply isn't there. I placed more notes in the image.\n\nThe reality is the order rate had been excellent earlier in the quarter and had been tapering for some time, spiking when resupply events occurred. I had trimmed my estimates previously, but given the continued slowing of the order rate (\\~62k/day to start January) and viewing some US CC data that reflects a slowing sales performance as the quarter went on, it is my duty to share my belief that the forthcoming Holiday results will not be that strong. As I noted in my last post, there was also embedded console resupply included in my January base case, I have removed that assumption, too.\n\nBut let's not get too upset, fellow \\*\\*\\*. While Melvin and its army of bankruptcy believers will spew forth vitriol claiming how weak sales prove nO oNe ShOpS aT gAmEsToP, the truth is they know what is coming from RC Ventures and will look to use any entrance of retail shorts into the trade as a means of  supply purchasing their shares from to cover some. The price may retrace if this proves true, however the reality is RC Ventures has bought at $16, and will likely deem a price under the 50 day MA as an excellent buying opportunity especially if they clearly communicate to the market that the reason for the price appreciation is Ryan Cohen, not George Sherman.\n\nLook, it's a chess match, take the DD aside and think about it. Management reported 3Q and shares tanked. Ryan Cohen bought, and can be seen by observers as the primary catalyst for the upside move. Now, management will report Holiday Sales (and whatever else they have in mind at ICR \\[I view a strategic partnership or a smallish technology oriented M&A play as my base case\\]) and the price will likely dip next week. Do you believe Ryan Cohen won't take the opportunity to ramp his position up another 2% to 14.9% if the price dips below $15? He will file on Form 4 within two business days and show himself to be the savior, once again. I am speculating, but given the clear preference of WSB, Twitter, and StockTwits for #WeWantCohen its safe to say that retail is on his side. He will likely gather more votes under his own power and from those in alignment with his viewpoint. A forthcoming board slate would be publicized in early March. This is a war, always has been.\n\nPlay tactically if you wish, or 💎 ✋. I would advise against FD buying (in almost all cases, but especially this time). Here's the model.\n\nI'd rather tell it like it is (as the data informs me) rather than put out BS. Hopefully I'm overly conservative. Call me \\*\\*\\* if you must, but I'll own GME longer than 99% of you. Still have a price target of \\~$100 by 2023. Cheers\n\nHere are the broader analyst estimates: [https://imgur.com/a/GYRKhUy](https://imgur.com/a/GYRKhUy) \\- $2.417B consensus rev vs. mine $2.35B, $1.66 consensus EPS vs. $1.49.\n\nhttps://preview.redd.it/n2jufilwdm961.png?width=1636&format=png&auto=webp&s=456a0d0fcee285d12119416cb23e3a049b6f7777",
        "title": "GME 4Q20 Financial Model Update",
        "created_utc": 1609898700.0,
        "upvote_ratio": 0.94,
        "num_comments": 223,
        "author": {
            "name": "Uberkikz11",
            "id": "2654s8w"
        }
    },
    "krb5hg": {
        "score": 10,
        "selftext": "Sup fellow losers!\n\nThis is my first ever \"solo\" post. The pun will explain itself here shortly. I also think no one will read this unless I give a shoutout to my primary holdings, $GME. Like many of you, I have a rather large position in GME, but I have size available to trade other tickers as well, so feel free to click away if you got trapped thinking this was a GME post.\n\nSo, here is some DD on the EV play $SOLO...\n\nFirst, I am from Texas, so I drive an \"eco-friendly\" Chevy 1500 even though I live in the heart of Downtown Houston and would never own an EV car that looks like SOLO's. Although, I am fully aware that my view is not what America and environment-friendly people like. That's fine. I plan on making money from your stupid looking cars. TAKE A LOOK AT THESE TRIPOD SOLO CARS, then come back to me. I guess people still drive Kia's after the hamster commercials and Fiat's, so who knows...\n\nSo the cool thing about this company is that the cars are only $20k, which is a good market for the broke Starbuck environment hippie employee who lives in a $2,000 a month apt in the city cause that is where the action is. This is a great price point for even the commuters into the city because it's a cheap car that they can drive only to work and back.\n\nRide Share. I am not sure about everyone here, but my wife loves riding the damn bird scooters, especially when she is drunk. Well, SOLO is trying to create the same thing with their vehicles. Pick up a small tripod and drive them around the city, then drop them off (OBVIOUSLY NOT IF YOU HAVE BEEN DRINKING!!!). This is perfect for people who have to pay to park in the city and don't want to lose their spot. You bet your sweet titties they will pay to rent a Tripod. Even I would drive one of these tripods around to see my boys laugh at me.\n\nTax Credit. Again, I am from Texas (if you ever met anyone from Texas, you will know because you will tell you 100 times), so I don't have state income tax, but hippies from the west coast could use all the tax breaks they can get. Now you can get a tax credit from owning an EV car. Well, $20k is a lot better than the price of a Tesla... again, I understand these cars don't look like Tesla's. But a wise man once told me, I am not gay, but $20 is $20.\n\nCurrent Retail Footprint.  All in the west coast.... I WONDER WHY???\n\n1. San Diego, CA\n2. Brea, CA\n3. Scottsdale, AZ — Kierland Commons and Westfield Fashion Square\n4. Glendale, AZ\n5. Santa Clara, CA\n6. Walnut Creek, CA\n7. Century City, CA\n8. Sherman Oaks, CA\n9. Portland, OR\n\nManufacturing. SOLO is a Canadian company but is expected to announce a new site in the US for manufacturing. Right now, they only have manufacturing in China. This is great news because now they don't have to pay import/export prices from China anymore. They have narrowed the search down to two sites, Arizona and Tennessee. After all, who knows what will happen with whoever our president is coming next month.\n\nChart Technical. Based on the below, currently while writing this the ticker is at $6.57. I think we could hit a new high of $15 with a small short squeeze and then back to $9. I AM NOT A PROFESSIONAL!!!!\n\n* Float: 24M\n* 52 High: $13.60\n* Short %: 12.23%\n* Market Cap: 422.26M\n* EPS: -0.28\n\nSOLO is Presenting at the 23rd Annual Needham Growth Conference on January 12, 2021. So join in to hear more. This ticker is being picked up on numerous articles, some good, some bad. This is just my DD cause I never see anything on here about SOLO.\n\nTLDR: STAY WOKE ON SOLO, price target $15.\n\nPositions: 19 Mar 21 5.5 Calls, Crapload of GME",
        "title": "EV play about to Rocket",
        "created_utc": 1609890611.0,
        "upvote_ratio": 0.62,
        "num_comments": 35,
        "author": {
            "name": "jayyyycrayyy",
            "id": "y2pevjh"
        }
    }
}